Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_jpeg.
; ===============

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_jpeg equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// JPEG address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    CONFR0;
    volatile    uint32_t    CONFR1;
    volatile    uint32_t    CONFR2;
    volatile    uint32_t    CONFR3;
    volatile    uint32_t    CONFR4;
    volatile    uint32_t    CONFR5;
    volatile    uint32_t    CONFR6;
    volatile    uint32_t    CONFR7;
    volatile    uint32_t    RESERVED0[4];
    volatile    uint32_t    CR;
    volatile    uint32_t    SR;
    volatile    uint32_t    CFR;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    DIR;
    volatile    uint32_t    DOR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    QMEM0_0;
    volatile    uint32_t    QMEM0_1;
    volatile    uint32_t    QMEM0_2;
    volatile    uint32_t    QMEM0_3;
    volatile    uint32_t    QMEM0_4;
    volatile    uint32_t    QMEM0_5;
    volatile    uint32_t    QMEM0_6;
    volatile    uint32_t    QMEM0_7;
    volatile    uint32_t    QMEM0_8;
    volatile    uint32_t    QMEM0_9;
    volatile    uint32_t    QMEM0_10;
    volatile    uint32_t    QMEM0_11;
    volatile    uint32_t    QMEM0_12;
    volatile    uint32_t    QMEM0_13;
    volatile    uint32_t    QMEM0_14;
    volatile    uint32_t    QMEM0_15;
    volatile    uint32_t    QMEM1_0;
    volatile    uint32_t    QMEM1_1;
    volatile    uint32_t    QMEM1_2;
    volatile    uint32_t    QMEM1_3;
    volatile    uint32_t    QMEM1_4;
    volatile    uint32_t    QMEM1_5;
    volatile    uint32_t    QMEM1_6;
    volatile    uint32_t    QMEM1_7;
    volatile    uint32_t    QMEM1_8;
    volatile    uint32_t    QMEM1_9;
    volatile    uint32_t    QMEM1_10;
    volatile    uint32_t    QMEM1_11;
    volatile    uint32_t    QMEM1_12;
    volatile    uint32_t    QMEM1_13;
    volatile    uint32_t    QMEM1_14;
    volatile    uint32_t    QMEM1_15;
    volatile    uint32_t    QMEM2_0;
    volatile    uint32_t    QMEM2_1;
    volatile    uint32_t    QMEM2_2;
    volatile    uint32_t    QMEM2_3;
    volatile    uint32_t    QMEM2_4;
    volatile    uint32_t    QMEM2_5;
    volatile    uint32_t    QMEM2_6;
    volatile    uint32_t    QMEM2_7;
    volatile    uint32_t    QMEM2_8;
    volatile    uint32_t    QMEM2_9;
    volatile    uint32_t    QMEM2_10;
    volatile    uint32_t    QMEM2_11;
    volatile    uint32_t    QMEM2_12;
    volatile    uint32_t    QMEM2_13;
    volatile    uint32_t    QMEM2_14;
    volatile    uint32_t    QMEM2_15;
    volatile    uint32_t    QMEM3_0;
    volatile    uint32_t    QMEM3_1;
    volatile    uint32_t    QMEM3_2;
    volatile    uint32_t    QMEM3_3;
    volatile    uint32_t    QMEM3_4;
    volatile    uint32_t    QMEM3_5;
    volatile    uint32_t    QMEM3_6;
    volatile    uint32_t    QMEM3_7;
    volatile    uint32_t    QMEM3_8;
    volatile    uint32_t    QMEM3_9;
    volatile    uint32_t    QMEM3_10;
    volatile    uint32_t    QMEM3_11;
    volatile    uint32_t    QMEM3_12;
    volatile    uint32_t    QMEM3_13;
    volatile    uint32_t    QMEM3_14;
    volatile    uint32_t    QMEM3_15;
    volatile    uint32_t    HUFFMIN0_0;
    volatile    uint32_t    HUFFMIN0_1;
    volatile    uint32_t    HUFFMIN0_2;
    volatile    uint32_t    HUFFMIN0_3;
    volatile    uint32_t    HUFFMIN1_0;
    volatile    uint32_t    HUFFMIN1_1;
    volatile    uint32_t    HUFFMIN1_2;
    volatile    uint32_t    HUFFMIN1_3;
    volatile    uint32_t    HUFFMIN2_0;
    volatile    uint32_t    HUFFMIN2_1;
    volatile    uint32_t    HUFFMIN2_2;
    volatile    uint32_t    HUFFMIN2_3;
    volatile    uint32_t    HUFFMIN3_0;
    volatile    uint32_t    HUFFMIN3_1;
    volatile    uint32_t    HUFFMIN3_2;
    volatile    uint32_t    HUFFMIN3_3;
    volatile    uint32_t    HUFFBASE0;
    volatile    uint32_t    HUFFBASE1;
    volatile    uint32_t    HUFFBASE2;
    volatile    uint32_t    HUFFBASE3;
    volatile    uint32_t    HUFFBASE4;
    volatile    uint32_t    HUFFBASE5;
    volatile    uint32_t    HUFFBASE6;
    volatile    uint32_t    HUFFBASE7;
    volatile    uint32_t    HUFFBASE8;
    volatile    uint32_t    HUFFBASE9;
    volatile    uint32_t    HUFFBASE10;
    volatile    uint32_t    HUFFBASE11;
    volatile    uint32_t    HUFFBASE12;
    volatile    uint32_t    HUFFBASE13;
    volatile    uint32_t    HUFFBASE14;
    volatile    uint32_t    HUFFBASE15;
    volatile    uint32_t    HUFFBASE16;
    volatile    uint32_t    HUFFBASE17;
    volatile    uint32_t    HUFFBASE18;
    volatile    uint32_t    HUFFBASE19;
    volatile    uint32_t    HUFFBASE20;
    volatile    uint32_t    HUFFBASE21;
    volatile    uint32_t    HUFFBASE22;
    volatile    uint32_t    HUFFBASE23;
    volatile    uint32_t    HUFFBASE24;
    volatile    uint32_t    HUFFBASE25;
    volatile    uint32_t    HUFFBASE26;
    volatile    uint32_t    HUFFBASE27;
    volatile    uint32_t    HUFFBASE28;
    volatile    uint32_t    HUFFBASE29;
    volatile    uint32_t    HUFFBASE30;
    volatile    uint32_t    HUFFBASE31;
    volatile    uint32_t    HUFFSYMB0;
    volatile    uint32_t    HUFFSYMB1;
    volatile    uint32_t    HUFFSYMB2;
    volatile    uint32_t    HUFFSYMB3;
    volatile    uint32_t    HUFFSYMB4;
    volatile    uint32_t    HUFFSYMB5;
    volatile    uint32_t    HUFFSYMB6;
    volatile    uint32_t    HUFFSYMB7;
    volatile    uint32_t    HUFFSYMB8;
    volatile    uint32_t    HUFFSYMB9;
    volatile    uint32_t    HUFFSYMB10;
    volatile    uint32_t    HUFFSYMB11;
    volatile    uint32_t    HUFFSYMB12;
    volatile    uint32_t    HUFFSYMB13;
    volatile    uint32_t    HUFFSYMB14;
    volatile    uint32_t    HUFFSYMB15;
    volatile    uint32_t    HUFFSYMB16;
    volatile    uint32_t    HUFFSYMB17;
    volatile    uint32_t    HUFFSYMB18;
    volatile    uint32_t    HUFFSYMB19;
    volatile    uint32_t    HUFFSYMB20;
    volatile    uint32_t    HUFFSYMB21;
    volatile    uint32_t    HUFFSYMB22;
    volatile    uint32_t    HUFFSYMB23;
    volatile    uint32_t    HUFFSYMB24;
    volatile    uint32_t    HUFFSYMB25;
    volatile    uint32_t    HUFFSYMB26;
    volatile    uint32_t    HUFFSYMB27;
    volatile    uint32_t    HUFFSYMB28;
    volatile    uint32_t    HUFFSYMB29;
    volatile    uint32_t    HUFFSYMB30;
    volatile    uint32_t    HUFFSYMB31;
    volatile    uint32_t    HUFFSYMB32;
    volatile    uint32_t    HUFFSYMB33;
    volatile    uint32_t    HUFFSYMB34;
    volatile    uint32_t    HUFFSYMB35;
    volatile    uint32_t    HUFFSYMB36;
    volatile    uint32_t    HUFFSYMB37;
    volatile    uint32_t    HUFFSYMB38;
    volatile    uint32_t    HUFFSYMB39;
    volatile    uint32_t    HUFFSYMB40;
    volatile    uint32_t    HUFFSYMB41;
    volatile    uint32_t    HUFFSYMB42;
    volatile    uint32_t    HUFFSYMB43;
    volatile    uint32_t    HUFFSYMB44;
    volatile    uint32_t    HUFFSYMB45;
    volatile    uint32_t    HUFFSYMB46;
    volatile    uint32_t    HUFFSYMB47;
    volatile    uint32_t    HUFFSYMB48;
    volatile    uint32_t    HUFFSYMB49;
    volatile    uint32_t    HUFFSYMB50;
    volatile    uint32_t    HUFFSYMB51;
    volatile    uint32_t    HUFFSYMB52;
    volatile    uint32_t    HUFFSYMB53;
    volatile    uint32_t    HUFFSYMB54;
    volatile    uint32_t    HUFFSYMB55;
    volatile    uint32_t    HUFFSYMB56;
    volatile    uint32_t    HUFFSYMB57;
    volatile    uint32_t    HUFFSYMB58;
    volatile    uint32_t    HUFFSYMB59;
    volatile    uint32_t    HUFFSYMB60;
    volatile    uint32_t    HUFFSYMB61;
    volatile    uint32_t    HUFFSYMB62;
    volatile    uint32_t    HUFFSYMB63;
    volatile    uint32_t    HUFFSYMB64;
    volatile    uint32_t    HUFFSYMB65;
    volatile    uint32_t    HUFFSYMB66;
    volatile    uint32_t    HUFFSYMB67;
    volatile    uint32_t    HUFFSYMB68;
    volatile    uint32_t    HUFFSYMB69;
    volatile    uint32_t    HUFFSYMB70;
    volatile    uint32_t    HUFFSYMB71;
    volatile    uint32_t    HUFFSYMB72;
    volatile    uint32_t    HUFFSYMB73;
    volatile    uint32_t    HUFFSYMB74;
    volatile    uint32_t    HUFFSYMB75;
    volatile    uint32_t    HUFFSYMB76;
    volatile    uint32_t    HUFFSYMB77;
    volatile    uint32_t    HUFFSYMB78;
    volatile    uint32_t    HUFFSYMB79;
    volatile    uint32_t    HUFFSYMB80;
    volatile    uint32_t    HUFFSYMB81;
    volatile    uint32_t    HUFFSYMB82;
    volatile    uint32_t    HUFFSYMB83;
    volatile    uint32_t    DHTMEM0;
    volatile    uint32_t    DHTMEM1;
    volatile    uint32_t    DHTMEM2;
    volatile    uint32_t    DHTMEM3;
    volatile    uint32_t    DHTMEM4;
    volatile    uint32_t    DHTMEM5;
    volatile    uint32_t    DHTMEM6;
    volatile    uint32_t    DHTMEM7;
    volatile    uint32_t    DHTMEM8;
    volatile    uint32_t    DHTMEM9;
    volatile    uint32_t    DHTMEM10;
    volatile    uint32_t    DHTMEM11;
    volatile    uint32_t    DHTMEM12;
    volatile    uint32_t    DHTMEM13;
    volatile    uint32_t    DHTMEM14;
    volatile    uint32_t    DHTMEM15;
    volatile    uint32_t    DHTMEM16;
    volatile    uint32_t    DHTMEM17;
    volatile    uint32_t    DHTMEM18;
    volatile    uint32_t    DHTMEM19;
    volatile    uint32_t    DHTMEM20;
    volatile    uint32_t    DHTMEM21;
    volatile    uint32_t    DHTMEM22;
    volatile    uint32_t    DHTMEM23;
    volatile    uint32_t    DHTMEM24;
    volatile    uint32_t    DHTMEM25;
    volatile    uint32_t    DHTMEM26;
    volatile    uint32_t    DHTMEM27;
    volatile    uint32_t    DHTMEM28;
    volatile    uint32_t    DHTMEM29;
    volatile    uint32_t    DHTMEM30;
    volatile    uint32_t    DHTMEM31;
    volatile    uint32_t    DHTMEM32;
    volatile    uint32_t    DHTMEM33;
    volatile    uint32_t    DHTMEM34;
    volatile    uint32_t    DHTMEM35;
    volatile    uint32_t    DHTMEM36;
    volatile    uint32_t    DHTMEM37;
    volatile    uint32_t    DHTMEM38;
    volatile    uint32_t    DHTMEM39;
    volatile    uint32_t    DHTMEM40;
    volatile    uint32_t    DHTMEM41;
    volatile    uint32_t    DHTMEM42;
    volatile    uint32_t    DHTMEM43;
    volatile    uint32_t    DHTMEM44;
    volatile    uint32_t    DHTMEM45;
    volatile    uint32_t    DHTMEM46;
    volatile    uint32_t    DHTMEM47;
    volatile    uint32_t    DHTMEM48;
    volatile    uint32_t    DHTMEM49;
    volatile    uint32_t    DHTMEM50;
    volatile    uint32_t    DHTMEM51;
    volatile    uint32_t    DHTMEM52;
    volatile    uint32_t    DHTMEM53;
    volatile    uint32_t    DHTMEM54;
    volatile    uint32_t    DHTMEM55;
    volatile    uint32_t    DHTMEM56;
    volatile    uint32_t    DHTMEM57;
    volatile    uint32_t    DHTMEM58;
    volatile    uint32_t    DHTMEM59;
    volatile    uint32_t    DHTMEM60;
    volatile    uint32_t    DHTMEM61;
    volatile    uint32_t    DHTMEM62;
    volatile    uint32_t    DHTMEM63;
    volatile    uint32_t    DHTMEM64;
    volatile    uint32_t    DHTMEM65;
    volatile    uint32_t    DHTMEM66;
    volatile    uint32_t    DHTMEM67;
    volatile    uint32_t    DHTMEM68;
    volatile    uint32_t    DHTMEM69;
    volatile    uint32_t    DHTMEM70;
    volatile    uint32_t    DHTMEM71;
    volatile    uint32_t    DHTMEM72;
    volatile    uint32_t    DHTMEM73;
    volatile    uint32_t    DHTMEM74;
    volatile    uint32_t    DHTMEM75;
    volatile    uint32_t    DHTMEM76;
    volatile    uint32_t    DHTMEM77;
    volatile    uint32_t    DHTMEM78;
    volatile    uint32_t    DHTMEM79;
    volatile    uint32_t    DHTMEM80;
    volatile    uint32_t    DHTMEM81;
    volatile    uint32_t    DHTMEM82;
    volatile    uint32_t    DHTMEM83;
    volatile    uint32_t    DHTMEM84;
    volatile    uint32_t    DHTMEM85;
    volatile    uint32_t    DHTMEM86;
    volatile    uint32_t    DHTMEM87;
    volatile    uint32_t    DHTMEM88;
    volatile    uint32_t    DHTMEM89;
    volatile    uint32_t    DHTMEM90;
    volatile    uint32_t    DHTMEM91;
    volatile    uint32_t    DHTMEM92;
    volatile    uint32_t    DHTMEM93;
    volatile    uint32_t    DHTMEM94;
    volatile    uint32_t    DHTMEM95;
    volatile    uint32_t    DHTMEM96;
    volatile    uint32_t    DHTMEM97;
    volatile    uint32_t    DHTMEM98;
    volatile    uint32_t    DHTMEM99;
    volatile    uint32_t    DHTMEM100;
    volatile    uint32_t    DHTMEM101;
    volatile    uint32_t    DHTMEM102;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    HUFFENC_AC0_0;
    volatile    uint32_t    HUFFENC_AC0_1;
    volatile    uint32_t    HUFFENC_AC0_2;
    volatile    uint32_t    HUFFENC_AC0_3;
    volatile    uint32_t    HUFFENC_AC0_4;
    volatile    uint32_t    HUFFENC_AC0_5;
    volatile    uint32_t    HUFFENC_AC0_6;
    volatile    uint32_t    HUFFENC_AC0_7;
    volatile    uint32_t    HUFFENC_AC0_8;
    volatile    uint32_t    HUFFENC_AC0_9;
    volatile    uint32_t    HUFFENC_AC0_10;
    volatile    uint32_t    HUFFENC_AC0_11;
    volatile    uint32_t    HUFFENC_AC0_12;
    volatile    uint32_t    HUFFENC_AC0_13;
    volatile    uint32_t    HUFFENC_AC0_14;
    volatile    uint32_t    HUFFENC_AC0_15;
    volatile    uint32_t    HUFFENC_AC0_16;
    volatile    uint32_t    HUFFENC_AC0_17;
    volatile    uint32_t    HUFFENC_AC0_18;
    volatile    uint32_t    HUFFENC_AC0_19;
    volatile    uint32_t    HUFFENC_AC0_20;
    volatile    uint32_t    HUFFENC_AC0_21;
    volatile    uint32_t    HUFFENC_AC0_22;
    volatile    uint32_t    HUFFENC_AC0_23;
    volatile    uint32_t    HUFFENC_AC0_24;
    volatile    uint32_t    HUFFENC_AC0_25;
    volatile    uint32_t    HUFFENC_AC0_26;
    volatile    uint32_t    HUFFENC_AC0_27;
    volatile    uint32_t    HUFFENC_AC0_28;
    volatile    uint32_t    HUFFENC_AC0_29;
    volatile    uint32_t    HUFFENC_AC0_30;
    volatile    uint32_t    HUFFENC_AC0_31;
    volatile    uint32_t    HUFFENC_AC0_32;
    volatile    uint32_t    HUFFENC_AC0_33;
    volatile    uint32_t    HUFFENC_AC0_34;
    volatile    uint32_t    HUFFENC_AC0_35;
    volatile    uint32_t    HUFFENC_AC0_36;
    volatile    uint32_t    HUFFENC_AC0_37;
    volatile    uint32_t    HUFFENC_AC0_38;
    volatile    uint32_t    HUFFENC_AC0_39;
    volatile    uint32_t    HUFFENC_AC0_40;
    volatile    uint32_t    HUFFENC_AC0_41;
    volatile    uint32_t    HUFFENC_AC0_42;
    volatile    uint32_t    HUFFENC_AC0_43;
    volatile    uint32_t    HUFFENC_AC0_44;
    volatile    uint32_t    HUFFENC_AC0_45;
    volatile    uint32_t    HUFFENC_AC0_46;
    volatile    uint32_t    HUFFENC_AC0_47;
    volatile    uint32_t    HUFFENC_AC0_48;
    volatile    uint32_t    HUFFENC_AC0_49;
    volatile    uint32_t    HUFFENC_AC0_50;
    volatile    uint32_t    HUFFENC_AC0_51;
    volatile    uint32_t    HUFFENC_AC0_52;
    volatile    uint32_t    HUFFENC_AC0_53;
    volatile    uint32_t    HUFFENC_AC0_54;
        union {
    volatile    uint32_t    HUFFENC_AC0_55;
    volatile    uint32_t    HUFFENC_AC1_0;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_56;
    volatile    uint32_t    HUFFENC_AC1_1;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_57;
    volatile    uint32_t    HUFFENC_AC1_2;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_58;
    volatile    uint32_t    HUFFENC_AC1_3;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_59;
    volatile    uint32_t    HUFFENC_AC1_4;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_60;
    volatile    uint32_t    HUFFENC_AC1_5;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_61;
    volatile    uint32_t    HUFFENC_AC1_6;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_62;
    volatile    uint32_t    HUFFENC_AC1_7;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_63;
    volatile    uint32_t    HUFFENC_AC1_8;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_64;
    volatile    uint32_t    HUFFENC_AC1_9;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_65;
    volatile    uint32_t    HUFFENC_AC1_10;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_66;
    volatile    uint32_t    HUFFENC_AC1_11;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_67;
    volatile    uint32_t    HUFFENC_AC1_12;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_68;
    volatile    uint32_t    HUFFENC_AC1_13;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_69;
    volatile    uint32_t    HUFFENC_AC1_14;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_70;
    volatile    uint32_t    HUFFENC_AC1_15;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_71;
    volatile    uint32_t    HUFFENC_AC1_16;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_72;
    volatile    uint32_t    HUFFENC_AC1_17;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_73;
    volatile    uint32_t    HUFFENC_AC1_18;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_74;
    volatile    uint32_t    HUFFENC_AC1_19;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_75;
    volatile    uint32_t    HUFFENC_AC1_20;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_76;
    volatile    uint32_t    HUFFENC_AC1_21;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_77;
    volatile    uint32_t    HUFFENC_AC1_22;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_78;
    volatile    uint32_t    HUFFENC_AC1_23;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_79;
    volatile    uint32_t    HUFFENC_AC1_24;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_80;
    volatile    uint32_t    HUFFENC_AC1_25;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_81;
    volatile    uint32_t    HUFFENC_AC1_26;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_82;
    volatile    uint32_t    HUFFENC_AC1_27;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_83;
    volatile    uint32_t    HUFFENC_AC1_28;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_84;
    volatile    uint32_t    HUFFENC_AC1_29;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_85;
    volatile    uint32_t    HUFFENC_AC1_30;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_86;
    volatile    uint32_t    HUFFENC_AC1_31;
        };
        union {
    volatile    uint32_t    HUFFENC_AC0_87;
    volatile    uint32_t    HUFFENC_AC1_32;
        };
    volatile    uint32_t    HUFFENC_AC1_33;
    volatile    uint32_t    HUFFENC_AC1_34;
    volatile    uint32_t    HUFFENC_AC1_35;
    volatile    uint32_t    HUFFENC_AC1_36;
    volatile    uint32_t    HUFFENC_AC1_37;
    volatile    uint32_t    HUFFENC_AC1_38;
    volatile    uint32_t    HUFFENC_AC1_39;
    volatile    uint32_t    HUFFENC_AC1_40;
    volatile    uint32_t    HUFFENC_AC1_41;
    volatile    uint32_t    HUFFENC_AC1_42;
    volatile    uint32_t    HUFFENC_AC1_43;
    volatile    uint32_t    HUFFENC_AC1_44;
    volatile    uint32_t    HUFFENC_AC1_45;
    volatile    uint32_t    HUFFENC_AC1_46;
    volatile    uint32_t    HUFFENC_AC1_47;
    volatile    uint32_t    HUFFENC_AC1_48;
    volatile    uint32_t    HUFFENC_AC1_49;
    volatile    uint32_t    HUFFENC_AC1_50;
    volatile    uint32_t    HUFFENC_AC1_51;
    volatile    uint32_t    HUFFENC_AC1_52;
    volatile    uint32_t    HUFFENC_AC1_53;
    volatile    uint32_t    HUFFENC_AC1_54;
    volatile    uint32_t    HUFFENC_AC1_55;
    volatile    uint32_t    HUFFENC_AC1_56;
    volatile    uint32_t    HUFFENC_AC1_57;
    volatile    uint32_t    HUFFENC_AC1_58;
    volatile    uint32_t    HUFFENC_AC1_59;
    volatile    uint32_t    HUFFENC_AC1_60;
    volatile    uint32_t    HUFFENC_AC1_61;
    volatile    uint32_t    HUFFENC_AC1_62;
    volatile    uint32_t    HUFFENC_AC1_63;
    volatile    uint32_t    HUFFENC_AC1_64;
    volatile    uint32_t    HUFFENC_AC1_65;
    volatile    uint32_t    HUFFENC_AC1_66;
    volatile    uint32_t    HUFFENC_AC1_67;
    volatile    uint32_t    HUFFENC_AC1_68;
    volatile    uint32_t    HUFFENC_AC1_69;
    volatile    uint32_t    HUFFENC_AC1_70;
    volatile    uint32_t    HUFFENC_AC1_71;
    volatile    uint32_t    HUFFENC_AC1_72;
    volatile    uint32_t    HUFFENC_AC1_73;
    volatile    uint32_t    HUFFENC_AC1_74;
    volatile    uint32_t    HUFFENC_AC1_75;
    volatile    uint32_t    HUFFENC_AC1_76;
    volatile    uint32_t    HUFFENC_AC1_77;
    volatile    uint32_t    HUFFENC_AC1_78;
    volatile    uint32_t    HUFFENC_AC1_79;
    volatile    uint32_t    HUFFENC_AC1_80;
    volatile    uint32_t    HUFFENC_AC1_81;
    volatile    uint32_t    HUFFENC_AC1_82;
    volatile    uint32_t    HUFFENC_AC1_83;
    volatile    uint32_t    HUFFENC_AC1_84;
    volatile    uint32_t    HUFFENC_AC1_85;
    volatile    uint32_t    HUFFENC_AC1_86;
    volatile    uint32_t    HUFFENC_AC1_87;
    volatile    uint32_t    RESERVED4[33];
    volatile    uint32_t    HUFFENC_DC0_0;
    volatile    uint32_t    HUFFENC_DC0_1;
    volatile    uint32_t    HUFFENC_DC0_2;
    volatile    uint32_t    HUFFENC_DC0_3;
    volatile    uint32_t    HUFFENC_DC0_4;
    volatile    uint32_t    HUFFENC_DC0_5;
    volatile    uint32_t    HUFFENC_DC0_6;
    volatile    uint32_t    HUFFENC_DC0_7;
    volatile    uint32_t    RESERVED5[47];
    volatile    uint32_t    HUFFENC_DC1_0;
    volatile    uint32_t    HUFFENC_DC1_1;
    volatile    uint32_t    HUFFENC_DC1_2;
    volatile    uint32_t    HUFFENC_DC1_3;
    volatile    uint32_t    HUFFENC_DC1_4;
    volatile    uint32_t    HUFFENC_DC1_5;
    volatile    uint32_t    HUFFENC_DC1_6;
    volatile    uint32_t    HUFFENC_DC1_7;
} JPEG_TypeDef;

#ifdef __cplusplus
#define JPEG_NS reinterpret_cast<JPEG_TypeDef *>(0x4002A000U)
#define JPEG_S  reinterpret_cast<JPEG_TypeDef *>(0x5002A000U)

#else
#define JPEG_NS ((JPEG_TypeDef *)0x4002A000U)
#define JPEG_S  ((JPEG_TypeDef *)0x5002A000U)
#endif

// CONFR0 Configuration

#define JPEG_CONFR0_START               (0x1U<<0)
#define JPEG_CONFR0_START_B_0X0         (0x0U<<0)
#define JPEG_CONFR0_START_B_0X1         (0x1U<<0)

// CONFR1 Configuration

