Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
#define JPEG_CONFR1_YSIZE               (0xFFFFU<<16)
#define JPEG_CONFR1_YSIZE_0             (0x1U<<16)
#define JPEG_CONFR1_HDR                 (0x1U<<8)
#define JPEG_CONFR1_NS                  (0x3U<<6)
#define JPEG_CONFR1_NS_0                (0x1U<<6)
#define JPEG_CONFR1_COLSPACE            (0x3U<<4)
#define JPEG_CONFR1_COLSPACE_0          (0x1U<<4)
#define JPEG_CONFR1_DE                  (0x1U<<3)
#define JPEG_CONFR1_NF                  (0x3U<<0)
#define JPEG_CONFR1_NF_0                (0x1U<<0)
#define JPEG_CONFR1_HDR_B_0X0           (0x0U<<8)
#define JPEG_CONFR1_HDR_B_0X1           (0x1U<<8)
#define JPEG_CONFR1_COLSPACE_B_0X0      (0x0U<<4)
#define JPEG_CONFR1_COLSPACE_B_0X1      (0x1U<<4)
#define JPEG_CONFR1_COLSPACE_B_0X2      (0x2U<<4)
#define JPEG_CONFR1_COLSPACE_B_0X3      (0x3U<<4)
#define JPEG_CONFR1_DE_B_0X0            (0x0U<<3)
#define JPEG_CONFR1_DE_B_0X1            (0x1U<<3)
#define JPEG_CONFR1_NF_B_0X0            (0x0U<<0)
#define JPEG_CONFR1_NF_B_0X1            (0x1U<<0)
#define JPEG_CONFR1_NF_B_0X2            (0x2U<<0)
#define JPEG_CONFR1_NF_B_0X3            (0x3U<<0)

// CONFR2 Configuration

#define JPEG_CONFR2_NMCU                (0x3FFFFFFU<<0)
#define JPEG_CONFR2_NMCU_0              (0x1U<<0)

// CONFR3 Configuration

#define JPEG_CONFR3_XSIZE               (0xFFFFU<<16)
#define JPEG_CONFR3_XSIZE_0             (0x1U<<16)

// CONFR4 Configuration

#define JPEG_CONFR4_HSF                 (0xFU<<12)
#define JPEG_CONFR4_HSF_0               (0x1U<<12)
#define JPEG_CONFR4_VSF                 (0xFU<<8)
#define JPEG_CONFR4_VSF_0               (0x1U<<8)
#define JPEG_CONFR4_NB                  (0xFU<<4)
#define JPEG_CONFR4_NB_0                (0x1U<<4)
#define JPEG_CONFR4_QT                  (0x3U<<2)
#define JPEG_CONFR4_QT_0                (0x1U<<2)
#define JPEG_CONFR4_HA                  (0x1U<<1)
#define JPEG_CONFR4_HD                  (0x1U<<0)
#define JPEG_CONFR4_QT_B_0X0            (0x0U<<2)
#define JPEG_CONFR4_QT_B_0X1            (0x1U<<2)
#define JPEG_CONFR4_QT_B_0X2            (0x2U<<2)
#define JPEG_CONFR4_QT_B_0X3            (0x3U<<2)
#define JPEG_CONFR4_HA_B_0X0            (0x0U<<1)
#define JPEG_CONFR4_HA_B_0X1            (0x1U<<1)
#define JPEG_CONFR4_HD_B_0X0            (0x0U<<0)
#define JPEG_CONFR4_HD_B_0X1            (0x1U<<0)

// CONFR5 Configuration

#define JPEG_CONFR5_HSF                 (0xFU<<12)
#define JPEG_CONFR5_HSF_0               (0x1U<<12)
#define JPEG_CONFR5_VSF                 (0xFU<<8)
#define JPEG_CONFR5_VSF_0               (0x1U<<8)
#define JPEG_CONFR5_NB                  (0xFU<<4)
#define JPEG_CONFR5_NB_0                (0x1U<<4)
#define JPEG_CONFR5_QT                  (0x3U<<2)
#define JPEG_CONFR5_QT_0                (0x1U<<2)
#define JPEG_CONFR5_HA                  (0x1U<<1)
#define JPEG_CONFR5_HD                  (0x1U<<0)
#define JPEG_CONFR5_QT_B_0X0            (0x0U<<2)
#define JPEG_CONFR5_QT_B_0X1            (0x1U<<2)
#define JPEG_CONFR5_QT_B_0X2            (0x2U<<2)
#define JPEG_CONFR5_QT_B_0X3            (0x3U<<2)
#define JPEG_CONFR5_HA_B_0X0            (0x0U<<1)
#define JPEG_CONFR5_HA_B_0X1            (0x1U<<1)
#define JPEG_CONFR5_HD_B_0X0            (0x0U<<0)
#define JPEG_CONFR5_HD_B_0X1            (0x1U<<0)

// CONFR6 Configuration

#define JPEG_CONFR6_HSF                 (0xFU<<12)
#define JPEG_CONFR6_HSF_0               (0x1U<<12)
#define JPEG_CONFR6_VSF                 (0xFU<<8)
#define JPEG_CONFR6_VSF_0               (0x1U<<8)
#define JPEG_CONFR6_NB                  (0xFU<<4)
#define JPEG_CONFR6_NB_0                (0x1U<<4)
#define JPEG_CONFR6_QT                  (0x3U<<2)
#define JPEG_CONFR6_QT_0                (0x1U<<2)
#define JPEG_CONFR6_HA                  (0x1U<<1)
#define JPEG_CONFR6_HD                  (0x1U<<0)
#define JPEG_CONFR6_QT_B_0X0            (0x0U<<2)
#define JPEG_CONFR6_QT_B_0X1            (0x1U<<2)
#define JPEG_CONFR6_QT_B_0X2            (0x2U<<2)
#define JPEG_CONFR6_QT_B_0X3            (0x3U<<2)
#define JPEG_CONFR6_HA_B_0X0            (0x0U<<1)
#define JPEG_CONFR6_HA_B_0X1            (0x1U<<1)
#define JPEG_CONFR6_HD_B_0X0            (0x0U<<0)
#define JPEG_CONFR6_HD_B_0X1            (0x1U<<0)

// CONFR7 Configuration

#define JPEG_CONFR7_HSF                 (0xFU<<12)
#define JPEG_CONFR7_HSF_0               (0x1U<<12)
#define JPEG_CONFR7_VSF                 (0xFU<<8)
#define JPEG_CONFR7_VSF_0               (0x1U<<8)
#define JPEG_CONFR7_NB                  (0xFU<<4)
#define JPEG_CONFR7_NB_0                (0x1U<<4)
#define JPEG_CONFR7_QT                  (0x3U<<2)
#define JPEG_CONFR7_QT_0                (0x1U<<2)
#define JPEG_CONFR7_HA                  (0x1U<<1)
#define JPEG_CONFR7_HD                  (0x1U<<0)
#define JPEG_CONFR7_QT_B_0X0            (0x0U<<2)
#define JPEG_CONFR7_QT_B_0X1            (0x1U<<2)
#define JPEG_CONFR7_QT_B_0X2            (0x2U<<2)
#define JPEG_CONFR7_QT_B_0X3            (0x3U<<2)
#define JPEG_CONFR7_HA_B_0X0            (0x0U<<1)
#define JPEG_CONFR7_HA_B_0X1            (0x1U<<1)
#define JPEG_CONFR7_HD_B_0X0            (0x0U<<0)
#define JPEG_CONFR7_HD_B_0X1            (0x1U<<0)

// CR Configuration

#define JPEG_CR_OFF                     (0x1U<<14)
#define JPEG_CR_IFF                     (0x1U<<13)
#define JPEG_CR_ODMAEN                  (0x1U<<12)
#define JPEG_CR_IDMAEN                  (0x1U<<11)
#define JPEG_CR_HPDIE                   (0x1U<<6)
#define JPEG_CR_EOCIE                   (0x1U<<5)
#define JPEG_CR_OFNEIE                  (0x1U<<4)
#define JPEG_CR_OFTIE                   (0x1U<<3)
#define JPEG_CR_IFNFIE                  (0x1U<<2)
#define JPEG_CR_IFTIE                   (0x1U<<1)
#define JPEG_CR_JCEN                    (0x1U<<0)
#define JPEG_CR_OFF_B_0X0               (0x0U<<14)
#define JPEG_CR_OFF_B_0X1               (0x1U<<14)
#define JPEG_CR_IFF_B_0X0               (0x0U<<13)
#define JPEG_CR_IFF_B_0X1               (0x1U<<13)
#define JPEG_CR_ODMAEN_B_0X0            (0x0U<<12)
#define JPEG_CR_ODMAEN_B_0X1            (0x1U<<12)
#define JPEG_CR_IDMAEN_B_0X0            (0x0U<<11)
#define JPEG_CR_IDMAEN_B_0X1            (0x1U<<11)
#define JPEG_CR_HPDIE_B_0X0             (0x0U<<6)
#define JPEG_CR_HPDIE_B_0X1             (0x1U<<6)
#define JPEG_CR_EOCIE_B_0X0             (0x0U<<5)
#define JPEG_CR_EOCIE_B_0X1             (0x1U<<5)
#define JPEG_CR_OFNEIE_B_0X0            (0x0U<<4)
#define JPEG_CR_OFNEIE_B_0X1            (0x1U<<4)
#define JPEG_CR_OFTIE_B_0X0             (0x0U<<3)
#define JPEG_CR_OFTIE_B_0X1             (0x1U<<3)
#define JPEG_CR_IFNFIE_B_0X0            (0x0U<<2)
#define JPEG_CR_IFNFIE_B_0X1            (0x1U<<2)
#define JPEG_CR_IFTIE_B_0X0             (0x0U<<1)
#define JPEG_CR_IFTIE_B_0X1             (0x1U<<1)
#define JPEG_CR_JCEN_B_0X0              (0x0U<<0)
#define JPEG_CR_JCEN_B_0X1              (0x1U<<0)

// SR Configuration

#define JPEG_SR_COF                     (0x1U<<7)
#define JPEG_SR_HPDF                    (0x1U<<6)
#define JPEG_SR_EOCF                    (0x1U<<5)
#define JPEG_SR_OFNEF                   (0x1U<<4)
#define JPEG_SR_OFTF                    (0x1U<<3)
#define JPEG_SR_IFNFF                   (0x1U<<2)
#define JPEG_SR_IFTF                    (0x1U<<1)
#define JPEG_SR_COF_B_0X0               (0x0U<<7)
#define JPEG_SR_COF_B_0X1               (0x1U<<7)
#define JPEG_SR_HPDF_B_0X0              (0x0U<<6)
#define JPEG_SR_HPDF_B_0X1              (0x1U<<6)
#define JPEG_SR_EOCF_B_0X0              (0x0U<<5)
#define JPEG_SR_EOCF_B_0X1              (0x1U<<5)
#define JPEG_SR_OFNEF_B_0X0             (0x0U<<4)
#define JPEG_SR_OFNEF_B_0X1             (0x1U<<4)
#define JPEG_SR_OFTF_B_0X0              (0x0U<<3)
#define JPEG_SR_OFTF_B_0X1              (0x1U<<3)
#define JPEG_SR_IFNFF_B_0X0             (0x0U<<2)
#define JPEG_SR_IFNFF_B_0X1             (0x1U<<2)
#define JPEG_SR_IFTF_B_0X0              (0x0U<<1)
#define JPEG_SR_IFTF_B_0X1              (0x1U<<1)

