Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// CFR Configuration

#define JPEG_CFR_CHPDF                  (0x1U<<6)
#define JPEG_CFR_CEOCF                  (0x1U<<5)
#define JPEG_CFR_CHPDF_B_0X0            (0x0U<<6)
#define JPEG_CFR_CHPDF_B_0X1            (0x1U<<6)
#define JPEG_CFR_CEOCF_B_0X0            (0x0U<<5)
#define JPEG_CFR_CEOCF_B_0X1            (0x1U<<5)

// DIR Configuration

#define JPEG_DIR_DATAIN                 (0xFFFFFFFFU<<0)
#define JPEG_DIR_DATAIN_0               (0x1U<<0)

// DOR Configuration

#define JPEG_DOR_DATAOUT                (0xFFFFFFFFU<<0)
#define JPEG_DOR_DATAOUT_0              (0x1U<<0)

// QMEM0_0 Configuration

#define JPEG_QMEM0_0_QCOEF3             (0xFFU<<24)
#define JPEG_QMEM0_0_QCOEF3_0           (0x1U<<24)
#define JPEG_QMEM0_0_QCOEF2             (0xFFU<<16)
#define JPEG_QMEM0_0_QCOEF2_0           (0x1U<<16)
#define JPEG_QMEM0_0_QCOEF1             (0xFFU<<8)
#define JPEG_QMEM0_0_QCOEF1_0           (0x1U<<8)
#define JPEG_QMEM0_0_QCOEF0             (0xFFU<<0)
#define JPEG_QMEM0_0_QCOEF0_0           (0x1U<<0)

// QMEM0_1 Configuration

#define JPEG_QMEM0_1_QCOEF7             (0xFFU<<24)
#define JPEG_QMEM0_1_QCOEF7_0           (0x1U<<24)
#define JPEG_QMEM0_1_QCOEF6             (0xFFU<<16)
#define JPEG_QMEM0_1_QCOEF6_0           (0x1U<<16)
#define JPEG_QMEM0_1_QCOEF5             (0xFFU<<8)
#define JPEG_QMEM0_1_QCOEF5_0           (0x1U<<8)
#define JPEG_QMEM0_1_QCOEF4             (0xFFU<<0)
#define JPEG_QMEM0_1_QCOEF4_0           (0x1U<<0)

// QMEM0_2 Configuration

#define JPEG_QMEM0_2_QCOEF11            (0xFFU<<24)
#define JPEG_QMEM0_2_QCOEF11_0          (0x1U<<24)
#define JPEG_QMEM0_2_QCOEF10            (0xFFU<<16)
#define JPEG_QMEM0_2_QCOEF10_0          (0x1U<<16)
#define JPEG_QMEM0_2_QCOEF9             (0xFFU<<8)
#define JPEG_QMEM0_2_QCOEF9_0           (0x1U<<8)
#define JPEG_QMEM0_2_QCOEF8             (0xFFU<<0)
#define JPEG_QMEM0_2_QCOEF8_0           (0x1U<<0)

// QMEM0_3 Configuration

#define JPEG_QMEM0_3_QCOEF15            (0xFFU<<24)
#define JPEG_QMEM0_3_QCOEF15_0          (0x1U<<24)
#define JPEG_QMEM0_3_QCOEF14            (0xFFU<<16)
#define JPEG_QMEM0_3_QCOEF14_0          (0x1U<<16)
#define JPEG_QMEM0_3_QCOEF13            (0xFFU<<8)
#define JPEG_QMEM0_3_QCOEF13_0          (0x1U<<8)
#define JPEG_QMEM0_3_QCOEF12            (0xFFU<<0)
#define JPEG_QMEM0_3_QCOEF12_0          (0x1U<<0)

// QMEM0_4 Configuration

#define JPEG_QMEM0_4_QCOEF19            (0xFFU<<24)
#define JPEG_QMEM0_4_QCOEF19_0          (0x1U<<24)
#define JPEG_QMEM0_4_QCOEF18            (0xFFU<<16)
#define JPEG_QMEM0_4_QCOEF18_0          (0x1U<<16)
#define JPEG_QMEM0_4_QCOEF17            (0xFFU<<8)
#define JPEG_QMEM0_4_QCOEF17_0          (0x1U<<8)
#define JPEG_QMEM0_4_QCOEF16            (0xFFU<<0)
#define JPEG_QMEM0_4_QCOEF16_0          (0x1U<<0)

// QMEM0_5 Configuration

#define JPEG_QMEM0_5_QCOEF23            (0xFFU<<24)
#define JPEG_QMEM0_5_QCOEF23_0          (0x1U<<24)
#define JPEG_QMEM0_5_QCOEF22            (0xFFU<<16)
#define JPEG_QMEM0_5_QCOEF22_0          (0x1U<<16)
#define JPEG_QMEM0_5_QCOEF21            (0xFFU<<8)
#define JPEG_QMEM0_5_QCOEF21_0          (0x1U<<8)
#define JPEG_QMEM0_5_QCOEF20            (0xFFU<<0)
#define JPEG_QMEM0_5_QCOEF20_0          (0x1U<<0)

// QMEM0_6 Configuration

#define JPEG_QMEM0_6_QCOEF27            (0xFFU<<24)
#define JPEG_QMEM0_6_QCOEF27_0          (0x1U<<24)
#define JPEG_QMEM0_6_QCOEF26            (0xFFU<<16)
#define JPEG_QMEM0_6_QCOEF26_0          (0x1U<<16)
#define JPEG_QMEM0_6_QCOEF25            (0xFFU<<8)
#define JPEG_QMEM0_6_QCOEF25_0          (0x1U<<8)
#define JPEG_QMEM0_6_QCOEF24            (0xFFU<<0)
#define JPEG_QMEM0_6_QCOEF24_0          (0x1U<<0)

// QMEM0_7 Configuration

#define JPEG_QMEM0_7_QCOEF31            (0xFFU<<24)
#define JPEG_QMEM0_7_QCOEF31_0          (0x1U<<24)
#define JPEG_QMEM0_7_QCOEF30            (0xFFU<<16)
#define JPEG_QMEM0_7_QCOEF30_0          (0x1U<<16)
#define JPEG_QMEM0_7_QCOEF29            (0xFFU<<8)
#define JPEG_QMEM0_7_QCOEF29_0          (0x1U<<8)
#define JPEG_QMEM0_7_QCOEF28            (0xFFU<<0)
#define JPEG_QMEM0_7_QCOEF28_0          (0x1U<<0)

// QMEM0_8 Configuration

#define JPEG_QMEM0_8_QCOEF35            (0xFFU<<24)
#define JPEG_QMEM0_8_QCOEF35_0          (0x1U<<24)
#define JPEG_QMEM0_8_QCOEF34            (0xFFU<<16)
#define JPEG_QMEM0_8_QCOEF34_0          (0x1U<<16)
#define JPEG_QMEM0_8_QCOEF33            (0xFFU<<8)
#define JPEG_QMEM0_8_QCOEF33_0          (0x1U<<8)
#define JPEG_QMEM0_8_QCOEF32            (0xFFU<<0)
#define JPEG_QMEM0_8_QCOEF32_0          (0x1U<<0)

// QMEM0_9 Configuration

#define JPEG_QMEM0_9_QCOEF39            (0xFFU<<24)
#define JPEG_QMEM0_9_QCOEF39_0          (0x1U<<24)
#define JPEG_QMEM0_9_QCOEF38            (0xFFU<<16)
#define JPEG_QMEM0_9_QCOEF38_0          (0x1U<<16)
#define JPEG_QMEM0_9_QCOEF37            (0xFFU<<8)
#define JPEG_QMEM0_9_QCOEF37_0          (0x1U<<8)
#define JPEG_QMEM0_9_QCOEF36            (0xFFU<<0)
#define JPEG_QMEM0_9_QCOEF36_0          (0x1U<<0)

// QMEM0_10 Configuration

#define JPEG_QMEM0_10_QCOEF43           (0xFFU<<24)
#define JPEG_QMEM0_10_QCOEF43_0         (0x1U<<24)
#define JPEG_QMEM0_10_QCOEF42           (0xFFU<<16)
#define JPEG_QMEM0_10_QCOEF42_0         (0x1U<<16)
#define JPEG_QMEM0_10_QCOEF41           (0xFFU<<8)
#define JPEG_QMEM0_10_QCOEF41_0         (0x1U<<8)
#define JPEG_QMEM0_10_QCOEF40           (0xFFU<<0)
#define JPEG_QMEM0_10_QCOEF40_0         (0x1U<<0)

// QMEM0_11 Configuration

#define JPEG_QMEM0_11_QCOEF47           (0xFFU<<24)
#define JPEG_QMEM0_11_QCOEF47_0         (0x1U<<24)
#define JPEG_QMEM0_11_QCOEF46           (0xFFU<<16)
#define JPEG_QMEM0_11_QCOEF46_0         (0x1U<<16)
#define JPEG_QMEM0_11_QCOEF45           (0xFFU<<8)
#define JPEG_QMEM0_11_QCOEF45_0         (0x1U<<8)
#define JPEG_QMEM0_11_QCOEF44           (0xFFU<<0)
#define JPEG_QMEM0_11_QCOEF44_0         (0x1U<<0)

// QMEM0_12 Configuration

#define JPEG_QMEM0_12_QCOEF51           (0xFFU<<24)
#define JPEG_QMEM0_12_QCOEF51_0         (0x1U<<24)
#define JPEG_QMEM0_12_QCOEF50           (0xFFU<<16)
#define JPEG_QMEM0_12_QCOEF50_0         (0x1U<<16)
#define JPEG_QMEM0_12_QCOEF49           (0xFFU<<8)
#define JPEG_QMEM0_12_QCOEF49_0         (0x1U<<8)
#define JPEG_QMEM0_12_QCOEF48           (0xFFU<<0)
#define JPEG_QMEM0_12_QCOEF48_0         (0x1U<<0)

// QMEM0_13 Configuration

#define JPEG_QMEM0_13_QCOEF55           (0xFFU<<24)
#define JPEG_QMEM0_13_QCOEF55_0         (0x1U<<24)
#define JPEG_QMEM0_13_QCOEF54           (0xFFU<<16)
#define JPEG_QMEM0_13_QCOEF54_0         (0x1U<<16)
#define JPEG_QMEM0_13_QCOEF53           (0xFFU<<8)
#define JPEG_QMEM0_13_QCOEF53_0         (0x1U<<8)
#define JPEG_QMEM0_13_QCOEF52           (0xFFU<<0)
#define JPEG_QMEM0_13_QCOEF52_0         (0x1U<<0)

// QMEM0_14 Configuration

#define JPEG_QMEM0_14_QCOEF59           (0xFFU<<24)
#define JPEG_QMEM0_14_QCOEF59_0         (0x1U<<24)
#define JPEG_QMEM0_14_QCOEF58           (0xFFU<<16)
#define JPEG_QMEM0_14_QCOEF58_0         (0x1U<<16)
#define JPEG_QMEM0_14_QCOEF57           (0xFFU<<8)
#define JPEG_QMEM0_14_QCOEF57_0         (0x1U<<8)
#define JPEG_QMEM0_14_QCOEF56           (0xFFU<<0)
#define JPEG_QMEM0_14_QCOEF56_0         (0x1U<<0)

// QMEM0_15 Configuration

#define JPEG_QMEM0_15_QCOEF63           (0xFFU<<24)
#define JPEG_QMEM0_15_QCOEF63_0         (0x1U<<24)
#define JPEG_QMEM0_15_QCOEF62           (0xFFU<<16)
#define JPEG_QMEM0_15_QCOEF62_0         (0x1U<<16)
#define JPEG_QMEM0_15_QCOEF61           (0xFFU<<8)
#define JPEG_QMEM0_15_QCOEF61_0         (0x1U<<8)
#define JPEG_QMEM0_15_QCOEF60           (0xFFU<<0)
#define JPEG_QMEM0_15_QCOEF60_0         (0x1U<<0)

// QMEM1_0 Configuration

