Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// QMEM1_14 Configuration

#define JPEG_QMEM1_14_QCOEF59           (0xFFU<<24)
#define JPEG_QMEM1_14_QCOEF59_0         (0x1U<<24)
#define JPEG_QMEM1_14_QCOEF58           (0xFFU<<16)
#define JPEG_QMEM1_14_QCOEF58_0         (0x1U<<16)
#define JPEG_QMEM1_14_QCOEF57           (0xFFU<<8)
#define JPEG_QMEM1_14_QCOEF57_0         (0x1U<<8)
#define JPEG_QMEM1_14_QCOEF56           (0xFFU<<0)
#define JPEG_QMEM1_14_QCOEF56_0         (0x1U<<0)

// QMEM1_15 Configuration

#define JPEG_QMEM1_15_QCOEF63           (0xFFU<<24)
#define JPEG_QMEM1_15_QCOEF63_0         (0x1U<<24)
#define JPEG_QMEM1_15_QCOEF62           (0xFFU<<16)
#define JPEG_QMEM1_15_QCOEF62_0         (0x1U<<16)
#define JPEG_QMEM1_15_QCOEF61           (0xFFU<<8)
#define JPEG_QMEM1_15_QCOEF61_0         (0x1U<<8)
#define JPEG_QMEM1_15_QCOEF60           (0xFFU<<0)
#define JPEG_QMEM1_15_QCOEF60_0         (0x1U<<0)

// QMEM2_0 Configuration

#define JPEG_QMEM2_0_QCOEF3             (0xFFU<<24)
#define JPEG_QMEM2_0_QCOEF3_0           (0x1U<<24)
#define JPEG_QMEM2_0_QCOEF2             (0xFFU<<16)
#define JPEG_QMEM2_0_QCOEF2_0           (0x1U<<16)
#define JPEG_QMEM2_0_QCOEF1             (0xFFU<<8)
#define JPEG_QMEM2_0_QCOEF1_0           (0x1U<<8)
#define JPEG_QMEM2_0_QCOEF0             (0xFFU<<0)
#define JPEG_QMEM2_0_QCOEF0_0           (0x1U<<0)

// QMEM2_1 Configuration

#define JPEG_QMEM2_1_QCOEF7             (0xFFU<<24)
#define JPEG_QMEM2_1_QCOEF7_0           (0x1U<<24)
#define JPEG_QMEM2_1_QCOEF6             (0xFFU<<16)
#define JPEG_QMEM2_1_QCOEF6_0           (0x1U<<16)
#define JPEG_QMEM2_1_QCOEF5             (0xFFU<<8)
#define JPEG_QMEM2_1_QCOEF5_0           (0x1U<<8)
#define JPEG_QMEM2_1_QCOEF4             (0xFFU<<0)
#define JPEG_QMEM2_1_QCOEF4_0           (0x1U<<0)

// QMEM2_2 Configuration

#define JPEG_QMEM2_2_QCOEF11            (0xFFU<<24)
#define JPEG_QMEM2_2_QCOEF11_0          (0x1U<<24)
#define JPEG_QMEM2_2_QCOEF10            (0xFFU<<16)
#define JPEG_QMEM2_2_QCOEF10_0          (0x1U<<16)
#define JPEG_QMEM2_2_QCOEF9             (0xFFU<<8)
#define JPEG_QMEM2_2_QCOEF9_0           (0x1U<<8)
#define JPEG_QMEM2_2_QCOEF8             (0xFFU<<0)
#define JPEG_QMEM2_2_QCOEF8_0           (0x1U<<0)

// QMEM2_3 Configuration

#define JPEG_QMEM2_3_QCOEF15            (0xFFU<<24)
#define JPEG_QMEM2_3_QCOEF15_0          (0x1U<<24)
#define JPEG_QMEM2_3_QCOEF14            (0xFFU<<16)
#define JPEG_QMEM2_3_QCOEF14_0          (0x1U<<16)
#define JPEG_QMEM2_3_QCOEF13            (0xFFU<<8)
#define JPEG_QMEM2_3_QCOEF13_0          (0x1U<<8)
#define JPEG_QMEM2_3_QCOEF12            (0xFFU<<0)
#define JPEG_QMEM2_3_QCOEF12_0          (0x1U<<0)

// QMEM2_4 Configuration

#define JPEG_QMEM2_4_QCOEF19            (0xFFU<<24)
#define JPEG_QMEM2_4_QCOEF19_0          (0x1U<<24)
#define JPEG_QMEM2_4_QCOEF18            (0xFFU<<16)
#define JPEG_QMEM2_4_QCOEF18_0          (0x1U<<16)
#define JPEG_QMEM2_4_QCOEF17            (0xFFU<<8)
#define JPEG_QMEM2_4_QCOEF17_0          (0x1U<<8)
#define JPEG_QMEM2_4_QCOEF16            (0xFFU<<0)
#define JPEG_QMEM2_4_QCOEF16_0          (0x1U<<0)

// QMEM2_5 Configuration

#define JPEG_QMEM2_5_QCOEF23            (0xFFU<<24)
#define JPEG_QMEM2_5_QCOEF23_0          (0x1U<<24)
#define JPEG_QMEM2_5_QCOEF22            (0xFFU<<16)
#define JPEG_QMEM2_5_QCOEF22_0          (0x1U<<16)
#define JPEG_QMEM2_5_QCOEF21            (0xFFU<<8)
#define JPEG_QMEM2_5_QCOEF21_0          (0x1U<<8)
#define JPEG_QMEM2_5_QCOEF20            (0xFFU<<0)
#define JPEG_QMEM2_5_QCOEF20_0          (0x1U<<0)

// QMEM2_6 Configuration

#define JPEG_QMEM2_6_QCOEF27            (0xFFU<<24)
#define JPEG_QMEM2_6_QCOEF27_0          (0x1U<<24)
#define JPEG_QMEM2_6_QCOEF26            (0xFFU<<16)
#define JPEG_QMEM2_6_QCOEF26_0          (0x1U<<16)
#define JPEG_QMEM2_6_QCOEF25            (0xFFU<<8)
#define JPEG_QMEM2_6_QCOEF25_0          (0x1U<<8)
#define JPEG_QMEM2_6_QCOEF24            (0xFFU<<0)
#define JPEG_QMEM2_6_QCOEF24_0          (0x1U<<0)

// QMEM2_7 Configuration

#define JPEG_QMEM2_7_QCOEF31            (0xFFU<<24)
#define JPEG_QMEM2_7_QCOEF31_0          (0x1U<<24)
#define JPEG_QMEM2_7_QCOEF30            (0xFFU<<16)
#define JPEG_QMEM2_7_QCOEF30_0          (0x1U<<16)
#define JPEG_QMEM2_7_QCOEF29            (0xFFU<<8)
#define JPEG_QMEM2_7_QCOEF29_0          (0x1U<<8)
#define JPEG_QMEM2_7_QCOEF28            (0xFFU<<0)
#define JPEG_QMEM2_7_QCOEF28_0          (0x1U<<0)

// QMEM2_8 Configuration

#define JPEG_QMEM2_8_QCOEF35            (0xFFU<<24)
#define JPEG_QMEM2_8_QCOEF35_0          (0x1U<<24)
#define JPEG_QMEM2_8_QCOEF34            (0xFFU<<16)
#define JPEG_QMEM2_8_QCOEF34_0          (0x1U<<16)
#define JPEG_QMEM2_8_QCOEF33            (0xFFU<<8)
#define JPEG_QMEM2_8_QCOEF33_0          (0x1U<<8)
#define JPEG_QMEM2_8_QCOEF32            (0xFFU<<0)
#define JPEG_QMEM2_8_QCOEF32_0          (0x1U<<0)

// QMEM2_9 Configuration

#define JPEG_QMEM2_9_QCOEF39            (0xFFU<<24)
#define JPEG_QMEM2_9_QCOEF39_0          (0x1U<<24)
#define JPEG_QMEM2_9_QCOEF38            (0xFFU<<16)
#define JPEG_QMEM2_9_QCOEF38_0          (0x1U<<16)
#define JPEG_QMEM2_9_QCOEF37            (0xFFU<<8)
#define JPEG_QMEM2_9_QCOEF37_0          (0x1U<<8)
#define JPEG_QMEM2_9_QCOEF36            (0xFFU<<0)
#define JPEG_QMEM2_9_QCOEF36_0          (0x1U<<0)

// QMEM2_10 Configuration

#define JPEG_QMEM2_10_QCOEF43           (0xFFU<<24)
#define JPEG_QMEM2_10_QCOEF43_0         (0x1U<<24)
#define JPEG_QMEM2_10_QCOEF42           (0xFFU<<16)
#define JPEG_QMEM2_10_QCOEF42_0         (0x1U<<16)
#define JPEG_QMEM2_10_QCOEF41           (0xFFU<<8)
#define JPEG_QMEM2_10_QCOEF41_0         (0x1U<<8)
#define JPEG_QMEM2_10_QCOEF40           (0xFFU<<0)
#define JPEG_QMEM2_10_QCOEF40_0         (0x1U<<0)

// QMEM2_11 Configuration

#define JPEG_QMEM2_11_QCOEF47           (0xFFU<<24)
#define JPEG_QMEM2_11_QCOEF47_0         (0x1U<<24)
#define JPEG_QMEM2_11_QCOEF46           (0xFFU<<16)
#define JPEG_QMEM2_11_QCOEF46_0         (0x1U<<16)
#define JPEG_QMEM2_11_QCOEF45           (0xFFU<<8)
#define JPEG_QMEM2_11_QCOEF45_0         (0x1U<<8)
#define JPEG_QMEM2_11_QCOEF44           (0xFFU<<0)
#define JPEG_QMEM2_11_QCOEF44_0         (0x1U<<0)

