Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// QMEM3_10 Configuration

#define JPEG_QMEM3_10_QCOEF43           (0xFFU<<24)
#define JPEG_QMEM3_10_QCOEF43_0         (0x1U<<24)
#define JPEG_QMEM3_10_QCOEF42           (0xFFU<<16)
#define JPEG_QMEM3_10_QCOEF42_0         (0x1U<<16)
#define JPEG_QMEM3_10_QCOEF41           (0xFFU<<8)
#define JPEG_QMEM3_10_QCOEF41_0         (0x1U<<8)
#define JPEG_QMEM3_10_QCOEF40           (0xFFU<<0)
#define JPEG_QMEM3_10_QCOEF40_0         (0x1U<<0)

// QMEM3_11 Configuration

#define JPEG_QMEM3_11_QCOEF47           (0xFFU<<24)
#define JPEG_QMEM3_11_QCOEF47_0         (0x1U<<24)
#define JPEG_QMEM3_11_QCOEF46           (0xFFU<<16)
#define JPEG_QMEM3_11_QCOEF46_0         (0x1U<<16)
#define JPEG_QMEM3_11_QCOEF45           (0xFFU<<8)
#define JPEG_QMEM3_11_QCOEF45_0         (0x1U<<8)
#define JPEG_QMEM3_11_QCOEF44           (0xFFU<<0)
#define JPEG_QMEM3_11_QCOEF44_0         (0x1U<<0)

// QMEM3_12 Configuration

#define JPEG_QMEM3_12_QCOEF51           (0xFFU<<24)
#define JPEG_QMEM3_12_QCOEF51_0         (0x1U<<24)
#define JPEG_QMEM3_12_QCOEF50           (0xFFU<<16)
#define JPEG_QMEM3_12_QCOEF50_0         (0x1U<<16)
#define JPEG_QMEM3_12_QCOEF49           (0xFFU<<8)
#define JPEG_QMEM3_12_QCOEF49_0         (0x1U<<8)
#define JPEG_QMEM3_12_QCOEF48           (0xFFU<<0)
#define JPEG_QMEM3_12_QCOEF48_0         (0x1U<<0)

// QMEM3_13 Configuration

#define JPEG_QMEM3_13_QCOEF55           (0xFFU<<24)
#define JPEG_QMEM3_13_QCOEF55_0         (0x1U<<24)
#define JPEG_QMEM3_13_QCOEF54           (0xFFU<<16)
#define JPEG_QMEM3_13_QCOEF54_0         (0x1U<<16)
#define JPEG_QMEM3_13_QCOEF53           (0xFFU<<8)
#define JPEG_QMEM3_13_QCOEF53_0         (0x1U<<8)
#define JPEG_QMEM3_13_QCOEF52           (0xFFU<<0)
#define JPEG_QMEM3_13_QCOEF52_0         (0x1U<<0)

// QMEM3_14 Configuration

#define JPEG_QMEM3_14_QCOEF59           (0xFFU<<24)
#define JPEG_QMEM3_14_QCOEF59_0         (0x1U<<24)
#define JPEG_QMEM3_14_QCOEF58           (0xFFU<<16)
#define JPEG_QMEM3_14_QCOEF58_0         (0x1U<<16)
#define JPEG_QMEM3_14_QCOEF57           (0xFFU<<8)
#define JPEG_QMEM3_14_QCOEF57_0         (0x1U<<8)
#define JPEG_QMEM3_14_QCOEF56           (0xFFU<<0)
#define JPEG_QMEM3_14_QCOEF56_0         (0x1U<<0)

// QMEM3_15 Configuration

#define JPEG_QMEM3_15_QCOEF63           (0xFFU<<24)
#define JPEG_QMEM3_15_QCOEF63_0         (0x1U<<24)
#define JPEG_QMEM3_15_QCOEF62           (0xFFU<<16)
#define JPEG_QMEM3_15_QCOEF62_0         (0x1U<<16)
#define JPEG_QMEM3_15_QCOEF61           (0xFFU<<8)
#define JPEG_QMEM3_15_QCOEF61_0         (0x1U<<8)
#define JPEG_QMEM3_15_QCOEF60           (0xFFU<<0)
#define JPEG_QMEM3_15_QCOEF60_0         (0x1U<<0)

// HUFFMIN0_0 Configuration

#define JPEG_HUFFMIN0_0_DATA0           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN0_0_DATA0_0         (0x1U<<0)

// HUFFMIN0_1 Configuration

#define JPEG_HUFFMIN0_1_DATA0           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN0_1_DATA0_0         (0x1U<<0)

// HUFFMIN0_2 Configuration

#define JPEG_HUFFMIN0_2_DATA0           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN0_2_DATA0_0         (0x1U<<0)

// HUFFMIN0_3 Configuration

#define JPEG_HUFFMIN0_3_DATA0           (0xFU<<0)
#define JPEG_HUFFMIN0_3_DATA0_0         (0x1U<<0)

// HUFFMIN1_0 Configuration

#define JPEG_HUFFMIN1_0_DATA1           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN1_0_DATA1_0         (0x1U<<0)

// HUFFMIN1_1 Configuration

#define JPEG_HUFFMIN1_1_DATA1           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN1_1_DATA1_0         (0x1U<<0)

// HUFFMIN1_2 Configuration

#define JPEG_HUFFMIN1_2_DATA1           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN1_2_DATA1_0         (0x1U<<0)

// HUFFMIN1_3 Configuration

#define JPEG_HUFFMIN1_3_DATA1           (0xFU<<0)
#define JPEG_HUFFMIN1_3_DATA1_0         (0x1U<<0)

// HUFFMIN2_0 Configuration

#define JPEG_HUFFMIN2_0_DATA2           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN2_0_DATA2_0         (0x1U<<0)

// HUFFMIN2_1 Configuration

#define JPEG_HUFFMIN2_1_DATA2           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN2_1_DATA2_0         (0x1U<<0)

// HUFFMIN2_2 Configuration

#define JPEG_HUFFMIN2_2_DATA2           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN2_2_DATA2_0         (0x1U<<0)

// HUFFMIN2_3 Configuration

#define JPEG_HUFFMIN2_3_DATA2           (0xFU<<0)
#define JPEG_HUFFMIN2_3_DATA2_0         (0x1U<<0)

// HUFFMIN3_0 Configuration

#define JPEG_HUFFMIN3_0_DATA3           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN3_0_DATA3_0         (0x1U<<0)

// HUFFMIN3_1 Configuration

#define JPEG_HUFFMIN3_1_DATA3           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN3_1_DATA3_0         (0x1U<<0)

// HUFFMIN3_2 Configuration

#define JPEG_HUFFMIN3_2_DATA3           (0xFFFFFFFFU<<0)
#define JPEG_HUFFMIN3_2_DATA3_0         (0x1U<<0)

// HUFFMIN3_3 Configuration

#define JPEG_HUFFMIN3_3_DATA3           (0xFU<<0)
#define JPEG_HUFFMIN3_3_DATA3_0         (0x1U<<0)

// HUFFBASE0 Configuration

#define JPEG_HUFFBASE0_DATA1            (0x1FFU<<16)
#define JPEG_HUFFBASE0_DATA1_0          (0x1U<<16)
#define JPEG_HUFFBASE0_DATA0            (0x1FFU<<0)
#define JPEG_HUFFBASE0_DATA0_0          (0x1U<<0)

// HUFFBASE1 Configuration

#define JPEG_HUFFBASE1_DATA3            (0x1FFU<<16)
#define JPEG_HUFFBASE1_DATA3_0          (0x1U<<16)
#define JPEG_HUFFBASE1_DATA2            (0x1FFU<<0)
#define JPEG_HUFFBASE1_DATA2_0          (0x1U<<0)

// HUFFBASE2 Configuration

#define JPEG_HUFFBASE2_DATA5            (0x1FFU<<16)
#define JPEG_HUFFBASE2_DATA5_0          (0x1U<<16)
#define JPEG_HUFFBASE2_DATA4            (0x1FFU<<0)
#define JPEG_HUFFBASE2_DATA4_0          (0x1U<<0)

// HUFFBASE3 Configuration

#define JPEG_HUFFBASE3_DATA7            (0x1FFU<<16)
#define JPEG_HUFFBASE3_DATA7_0          (0x1U<<16)
#define JPEG_HUFFBASE3_DATA6            (0x1FFU<<0)
#define JPEG_HUFFBASE3_DATA6_0          (0x1U<<0)

// HUFFBASE4 Configuration

#define JPEG_HUFFBASE4_DATA9            (0x1FFU<<16)
#define JPEG_HUFFBASE4_DATA9_0          (0x1U<<16)
#define JPEG_HUFFBASE4_DATA8            (0x1FFU<<0)
#define JPEG_HUFFBASE4_DATA8_0          (0x1U<<0)

// HUFFBASE5 Configuration

#define JPEG_HUFFBASE5_DATA11           (0x1FFU<<16)
#define JPEG_HUFFBASE5_DATA11_0         (0x1U<<16)
#define JPEG_HUFFBASE5_DATA10           (0x1FFU<<0)
#define JPEG_HUFFBASE5_DATA10_0         (0x1U<<0)

// HUFFBASE6 Configuration

#define JPEG_HUFFBASE6_DATA13           (0x1FFU<<16)
#define JPEG_HUFFBASE6_DATA13_0         (0x1U<<16)
#define JPEG_HUFFBASE6_DATA12           (0x1FFU<<0)
#define JPEG_HUFFBASE6_DATA12_0         (0x1U<<0)

// HUFFBASE7 Configuration

#define JPEG_HUFFBASE7_DATA15           (0x1FFU<<16)
#define JPEG_HUFFBASE7_DATA15_0         (0x1U<<16)
#define JPEG_HUFFBASE7_DATA14           (0x1FFU<<0)
#define JPEG_HUFFBASE7_DATA14_0         (0x1U<<0)

// HUFFBASE8 Configuration

#define JPEG_HUFFBASE8_DATA17           (0x1FFU<<16)
#define JPEG_HUFFBASE8_DATA17_0         (0x1U<<16)
#define JPEG_HUFFBASE8_DATA16           (0x1FFU<<0)
#define JPEG_HUFFBASE8_DATA16_0         (0x1U<<0)

// HUFFBASE9 Configuration

