Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
#define JPEG_HUFFSYMB2_DATA11           (0xFFU<<24)
#define JPEG_HUFFSYMB2_DATA11_0         (0x1U<<24)
#define JPEG_HUFFSYMB2_DATA10           (0xFFU<<16)
#define JPEG_HUFFSYMB2_DATA10_0         (0x1U<<16)
#define JPEG_HUFFSYMB2_DATA9            (0xFFU<<8)
#define JPEG_HUFFSYMB2_DATA9_0          (0x1U<<8)
#define JPEG_HUFFSYMB2_DATA8            (0xFFU<<0)
#define JPEG_HUFFSYMB2_DATA8_0          (0x1U<<0)

// HUFFSYMB3 Configuration

#define JPEG_HUFFSYMB3_DATA15           (0xFFU<<24)
#define JPEG_HUFFSYMB3_DATA15_0         (0x1U<<24)
#define JPEG_HUFFSYMB3_DATA14           (0xFFU<<16)
#define JPEG_HUFFSYMB3_DATA14_0         (0x1U<<16)
#define JPEG_HUFFSYMB3_DATA13           (0xFFU<<8)
#define JPEG_HUFFSYMB3_DATA13_0         (0x1U<<8)
#define JPEG_HUFFSYMB3_DATA12           (0xFFU<<0)
#define JPEG_HUFFSYMB3_DATA12_0         (0x1U<<0)

// HUFFSYMB4 Configuration

#define JPEG_HUFFSYMB4_DATA19           (0xFFU<<24)
#define JPEG_HUFFSYMB4_DATA19_0         (0x1U<<24)
#define JPEG_HUFFSYMB4_DATA18           (0xFFU<<16)
#define JPEG_HUFFSYMB4_DATA18_0         (0x1U<<16)
#define JPEG_HUFFSYMB4_DATA17           (0xFFU<<8)
#define JPEG_HUFFSYMB4_DATA17_0         (0x1U<<8)
#define JPEG_HUFFSYMB4_DATA16           (0xFFU<<0)
#define JPEG_HUFFSYMB4_DATA16_0         (0x1U<<0)

// HUFFSYMB5 Configuration

#define JPEG_HUFFSYMB5_DATA23           (0xFFU<<24)
#define JPEG_HUFFSYMB5_DATA23_0         (0x1U<<24)
#define JPEG_HUFFSYMB5_DATA22           (0xFFU<<16)
#define JPEG_HUFFSYMB5_DATA22_0         (0x1U<<16)
#define JPEG_HUFFSYMB5_DATA21           (0xFFU<<8)
#define JPEG_HUFFSYMB5_DATA21_0         (0x1U<<8)
#define JPEG_HUFFSYMB5_DATA20           (0xFFU<<0)
#define JPEG_HUFFSYMB5_DATA20_0         (0x1U<<0)

// HUFFSYMB6 Configuration

#define JPEG_HUFFSYMB6_DATA27           (0xFFU<<24)
#define JPEG_HUFFSYMB6_DATA27_0         (0x1U<<24)
#define JPEG_HUFFSYMB6_DATA26           (0xFFU<<16)
#define JPEG_HUFFSYMB6_DATA26_0         (0x1U<<16)
#define JPEG_HUFFSYMB6_DATA25           (0xFFU<<8)
#define JPEG_HUFFSYMB6_DATA25_0         (0x1U<<8)
#define JPEG_HUFFSYMB6_DATA24           (0xFFU<<0)
#define JPEG_HUFFSYMB6_DATA24_0         (0x1U<<0)

// HUFFSYMB7 Configuration

#define JPEG_HUFFSYMB7_DATA31           (0xFFU<<24)
#define JPEG_HUFFSYMB7_DATA31_0         (0x1U<<24)
#define JPEG_HUFFSYMB7_DATA30           (0xFFU<<16)
#define JPEG_HUFFSYMB7_DATA30_0         (0x1U<<16)
#define JPEG_HUFFSYMB7_DATA29           (0xFFU<<8)
#define JPEG_HUFFSYMB7_DATA29_0         (0x1U<<8)
#define JPEG_HUFFSYMB7_DATA28           (0xFFU<<0)
#define JPEG_HUFFSYMB7_DATA28_0         (0x1U<<0)

// HUFFSYMB8 Configuration

#define JPEG_HUFFSYMB8_DATA35           (0xFFU<<24)
#define JPEG_HUFFSYMB8_DATA35_0         (0x1U<<24)
#define JPEG_HUFFSYMB8_DATA34           (0xFFU<<16)
#define JPEG_HUFFSYMB8_DATA34_0         (0x1U<<16)
#define JPEG_HUFFSYMB8_DATA33           (0xFFU<<8)
#define JPEG_HUFFSYMB8_DATA33_0         (0x1U<<8)
#define JPEG_HUFFSYMB8_DATA32           (0xFFU<<0)
#define JPEG_HUFFSYMB8_DATA32_0         (0x1U<<0)

// HUFFSYMB9 Configuration

#define JPEG_HUFFSYMB9_DATA39           (0xFFU<<24)
#define JPEG_HUFFSYMB9_DATA39_0         (0x1U<<24)
#define JPEG_HUFFSYMB9_DATA38           (0xFFU<<16)
#define JPEG_HUFFSYMB9_DATA38_0         (0x1U<<16)
#define JPEG_HUFFSYMB9_DATA37           (0xFFU<<8)
#define JPEG_HUFFSYMB9_DATA37_0         (0x1U<<8)
#define JPEG_HUFFSYMB9_DATA36           (0xFFU<<0)
#define JPEG_HUFFSYMB9_DATA36_0         (0x1U<<0)

// HUFFSYMB10 Configuration

#define JPEG_HUFFSYMB10_DATA43          (0xFFU<<24)
#define JPEG_HUFFSYMB10_DATA43_0        (0x1U<<24)
#define JPEG_HUFFSYMB10_DATA42          (0xFFU<<16)
#define JPEG_HUFFSYMB10_DATA42_0        (0x1U<<16)
#define JPEG_HUFFSYMB10_DATA41          (0xFFU<<8)
#define JPEG_HUFFSYMB10_DATA41_0        (0x1U<<8)
#define JPEG_HUFFSYMB10_DATA40          (0xFFU<<0)
#define JPEG_HUFFSYMB10_DATA40_0        (0x1U<<0)

// HUFFSYMB11 Configuration

#define JPEG_HUFFSYMB11_DATA47          (0xFFU<<24)
#define JPEG_HUFFSYMB11_DATA47_0        (0x1U<<24)
#define JPEG_HUFFSYMB11_DATA46          (0xFFU<<16)
#define JPEG_HUFFSYMB11_DATA46_0        (0x1U<<16)
#define JPEG_HUFFSYMB11_DATA45          (0xFFU<<8)
#define JPEG_HUFFSYMB11_DATA45_0        (0x1U<<8)
#define JPEG_HUFFSYMB11_DATA44          (0xFFU<<0)
#define JPEG_HUFFSYMB11_DATA44_0        (0x1U<<0)

// HUFFSYMB12 Configuration

#define JPEG_HUFFSYMB12_DATA51          (0xFFU<<24)
#define JPEG_HUFFSYMB12_DATA51_0        (0x1U<<24)
#define JPEG_HUFFSYMB12_DATA50          (0xFFU<<16)
#define JPEG_HUFFSYMB12_DATA50_0        (0x1U<<16)
#define JPEG_HUFFSYMB12_DATA49          (0xFFU<<8)
#define JPEG_HUFFSYMB12_DATA49_0        (0x1U<<8)
#define JPEG_HUFFSYMB12_DATA48          (0xFFU<<0)
#define JPEG_HUFFSYMB12_DATA48_0        (0x1U<<0)

// HUFFSYMB13 Configuration

#define JPEG_HUFFSYMB13_DATA55          (0xFFU<<24)
#define JPEG_HUFFSYMB13_DATA55_0        (0x1U<<24)
#define JPEG_HUFFSYMB13_DATA54          (0xFFU<<16)
#define JPEG_HUFFSYMB13_DATA54_0        (0x1U<<16)
#define JPEG_HUFFSYMB13_DATA53          (0xFFU<<8)
#define JPEG_HUFFSYMB13_DATA53_0        (0x1U<<8)
#define JPEG_HUFFSYMB13_DATA52          (0xFFU<<0)
#define JPEG_HUFFSYMB13_DATA52_0        (0x1U<<0)

// HUFFSYMB14 Configuration

#define JPEG_HUFFSYMB14_DATA59          (0xFFU<<24)
#define JPEG_HUFFSYMB14_DATA59_0        (0x1U<<24)
#define JPEG_HUFFSYMB14_DATA58          (0xFFU<<16)
#define JPEG_HUFFSYMB14_DATA58_0        (0x1U<<16)
#define JPEG_HUFFSYMB14_DATA57          (0xFFU<<8)
#define JPEG_HUFFSYMB14_DATA57_0        (0x1U<<8)
#define JPEG_HUFFSYMB14_DATA56          (0xFFU<<0)
#define JPEG_HUFFSYMB14_DATA56_0        (0x1U<<0)

// HUFFSYMB15 Configuration

#define JPEG_HUFFSYMB15_DATA63          (0xFFU<<24)
#define JPEG_HUFFSYMB15_DATA63_0        (0x1U<<24)
#define JPEG_HUFFSYMB15_DATA62          (0xFFU<<16)
#define JPEG_HUFFSYMB15_DATA62_0        (0x1U<<16)
#define JPEG_HUFFSYMB15_DATA61          (0xFFU<<8)
#define JPEG_HUFFSYMB15_DATA61_0        (0x1U<<8)
#define JPEG_HUFFSYMB15_DATA60          (0xFFU<<0)
#define JPEG_HUFFSYMB15_DATA60_0        (0x1U<<0)

// HUFFSYMB16 Configuration

#define JPEG_HUFFSYMB16_DATA67          (0xFFU<<24)
#define JPEG_HUFFSYMB16_DATA67_0        (0x1U<<24)
#define JPEG_HUFFSYMB16_DATA66          (0xFFU<<16)
#define JPEG_HUFFSYMB16_DATA66_0        (0x1U<<16)
#define JPEG_HUFFSYMB16_DATA65          (0xFFU<<8)
#define JPEG_HUFFSYMB16_DATA65_0        (0x1U<<8)
#define JPEG_HUFFSYMB16_DATA64          (0xFFU<<0)
#define JPEG_HUFFSYMB16_DATA64_0        (0x1U<<0)

// HUFFSYMB17 Configuration

#define JPEG_HUFFSYMB17_DATA71          (0xFFU<<24)
#define JPEG_HUFFSYMB17_DATA71_0        (0x1U<<24)
#define JPEG_HUFFSYMB17_DATA70          (0xFFU<<16)
#define JPEG_HUFFSYMB17_DATA70_0        (0x1U<<16)
#define JPEG_HUFFSYMB17_DATA69          (0xFFU<<8)
#define JPEG_HUFFSYMB17_DATA69_0        (0x1U<<8)
#define JPEG_HUFFSYMB17_DATA68          (0xFFU<<0)
#define JPEG_HUFFSYMB17_DATA68_0        (0x1U<<0)

