Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFSYMB18 Configuration

#define JPEG_HUFFSYMB18_DATA75          (0xFFU<<24)
#define JPEG_HUFFSYMB18_DATA75_0        (0x1U<<24)
#define JPEG_HUFFSYMB18_DATA74          (0xFFU<<16)
#define JPEG_HUFFSYMB18_DATA74_0        (0x1U<<16)
#define JPEG_HUFFSYMB18_DATA73          (0xFFU<<8)
#define JPEG_HUFFSYMB18_DATA73_0        (0x1U<<8)
#define JPEG_HUFFSYMB18_DATA72          (0xFFU<<0)
#define JPEG_HUFFSYMB18_DATA72_0        (0x1U<<0)

// HUFFSYMB19 Configuration

#define JPEG_HUFFSYMB19_DATA79          (0xFFU<<24)
#define JPEG_HUFFSYMB19_DATA79_0        (0x1U<<24)
#define JPEG_HUFFSYMB19_DATA78          (0xFFU<<16)
#define JPEG_HUFFSYMB19_DATA78_0        (0x1U<<16)
#define JPEG_HUFFSYMB19_DATA77          (0xFFU<<8)
#define JPEG_HUFFSYMB19_DATA77_0        (0x1U<<8)
#define JPEG_HUFFSYMB19_DATA76          (0xFFU<<0)
#define JPEG_HUFFSYMB19_DATA76_0        (0x1U<<0)

// HUFFSYMB20 Configuration

#define JPEG_HUFFSYMB20_DATA83          (0xFFU<<24)
#define JPEG_HUFFSYMB20_DATA83_0        (0x1U<<24)
#define JPEG_HUFFSYMB20_DATA82          (0xFFU<<16)
#define JPEG_HUFFSYMB20_DATA82_0        (0x1U<<16)
#define JPEG_HUFFSYMB20_DATA81          (0xFFU<<8)
#define JPEG_HUFFSYMB20_DATA81_0        (0x1U<<8)
#define JPEG_HUFFSYMB20_DATA80          (0xFFU<<0)
#define JPEG_HUFFSYMB20_DATA80_0        (0x1U<<0)

// HUFFSYMB21 Configuration

#define JPEG_HUFFSYMB21_DATA87          (0xFFU<<24)
#define JPEG_HUFFSYMB21_DATA87_0        (0x1U<<24)
#define JPEG_HUFFSYMB21_DATA86          (0xFFU<<16)
#define JPEG_HUFFSYMB21_DATA86_0        (0x1U<<16)
#define JPEG_HUFFSYMB21_DATA85          (0xFFU<<8)
#define JPEG_HUFFSYMB21_DATA85_0        (0x1U<<8)
#define JPEG_HUFFSYMB21_DATA84          (0xFFU<<0)
#define JPEG_HUFFSYMB21_DATA84_0        (0x1U<<0)

// HUFFSYMB22 Configuration

#define JPEG_HUFFSYMB22_DATA91          (0xFFU<<24)
#define JPEG_HUFFSYMB22_DATA91_0        (0x1U<<24)
#define JPEG_HUFFSYMB22_DATA90          (0xFFU<<16)
#define JPEG_HUFFSYMB22_DATA90_0        (0x1U<<16)
#define JPEG_HUFFSYMB22_DATA89          (0xFFU<<8)
#define JPEG_HUFFSYMB22_DATA89_0        (0x1U<<8)
#define JPEG_HUFFSYMB22_DATA88          (0xFFU<<0)
#define JPEG_HUFFSYMB22_DATA88_0        (0x1U<<0)

// HUFFSYMB23 Configuration

#define JPEG_HUFFSYMB23_DATA95          (0xFFU<<24)
#define JPEG_HUFFSYMB23_DATA95_0        (0x1U<<24)
#define JPEG_HUFFSYMB23_DATA94          (0xFFU<<16)
#define JPEG_HUFFSYMB23_DATA94_0        (0x1U<<16)
#define JPEG_HUFFSYMB23_DATA93          (0xFFU<<8)
#define JPEG_HUFFSYMB23_DATA93_0        (0x1U<<8)
#define JPEG_HUFFSYMB23_DATA92          (0xFFU<<0)
#define JPEG_HUFFSYMB23_DATA92_0        (0x1U<<0)

// HUFFSYMB24 Configuration

#define JPEG_HUFFSYMB24_DATA99          (0xFFU<<24)
#define JPEG_HUFFSYMB24_DATA99_0        (0x1U<<24)
#define JPEG_HUFFSYMB24_DATA98          (0xFFU<<16)
#define JPEG_HUFFSYMB24_DATA98_0        (0x1U<<16)
#define JPEG_HUFFSYMB24_DATA97          (0xFFU<<8)
#define JPEG_HUFFSYMB24_DATA97_0        (0x1U<<8)
#define JPEG_HUFFSYMB24_DATA96          (0xFFU<<0)
#define JPEG_HUFFSYMB24_DATA96_0        (0x1U<<0)

// HUFFSYMB25 Configuration

#define JPEG_HUFFSYMB25_DATA103         (0xFFU<<24)
#define JPEG_HUFFSYMB25_DATA103_0       (0x1U<<24)
#define JPEG_HUFFSYMB25_DATA102         (0xFFU<<16)
#define JPEG_HUFFSYMB25_DATA102_0       (0x1U<<16)
#define JPEG_HUFFSYMB25_DATA101         (0xFFU<<8)
#define JPEG_HUFFSYMB25_DATA101_0       (0x1U<<8)
#define JPEG_HUFFSYMB25_DATA100         (0xFFU<<0)
#define JPEG_HUFFSYMB25_DATA100_0       (0x1U<<0)

// HUFFSYMB26 Configuration

#define JPEG_HUFFSYMB26_DATA107         (0xFFU<<24)
#define JPEG_HUFFSYMB26_DATA107_0       (0x1U<<24)
#define JPEG_HUFFSYMB26_DATA106         (0xFFU<<16)
#define JPEG_HUFFSYMB26_DATA106_0       (0x1U<<16)
#define JPEG_HUFFSYMB26_DATA105         (0xFFU<<8)
#define JPEG_HUFFSYMB26_DATA105_0       (0x1U<<8)
#define JPEG_HUFFSYMB26_DATA104         (0xFFU<<0)
#define JPEG_HUFFSYMB26_DATA104_0       (0x1U<<0)

// HUFFSYMB27 Configuration

#define JPEG_HUFFSYMB27_DATA111         (0xFFU<<24)
#define JPEG_HUFFSYMB27_DATA111_0       (0x1U<<24)
#define JPEG_HUFFSYMB27_DATA110         (0xFFU<<16)
#define JPEG_HUFFSYMB27_DATA110_0       (0x1U<<16)
#define JPEG_HUFFSYMB27_DATA109         (0xFFU<<8)
#define JPEG_HUFFSYMB27_DATA109_0       (0x1U<<8)
#define JPEG_HUFFSYMB27_DATA108         (0xFFU<<0)
#define JPEG_HUFFSYMB27_DATA108_0       (0x1U<<0)

// HUFFSYMB28 Configuration

#define JPEG_HUFFSYMB28_DATA115         (0xFFU<<24)
#define JPEG_HUFFSYMB28_DATA115_0       (0x1U<<24)
#define JPEG_HUFFSYMB28_DATA114         (0xFFU<<16)
#define JPEG_HUFFSYMB28_DATA114_0       (0x1U<<16)
#define JPEG_HUFFSYMB28_DATA113         (0xFFU<<8)
#define JPEG_HUFFSYMB28_DATA113_0       (0x1U<<8)
#define JPEG_HUFFSYMB28_DATA112         (0xFFU<<0)
#define JPEG_HUFFSYMB28_DATA112_0       (0x1U<<0)

// HUFFSYMB29 Configuration

#define JPEG_HUFFSYMB29_DATA119         (0xFFU<<24)
#define JPEG_HUFFSYMB29_DATA119_0       (0x1U<<24)
#define JPEG_HUFFSYMB29_DATA118         (0xFFU<<16)
#define JPEG_HUFFSYMB29_DATA118_0       (0x1U<<16)
#define JPEG_HUFFSYMB29_DATA117         (0xFFU<<8)
#define JPEG_HUFFSYMB29_DATA117_0       (0x1U<<8)
#define JPEG_HUFFSYMB29_DATA116         (0xFFU<<0)
#define JPEG_HUFFSYMB29_DATA116_0       (0x1U<<0)

// HUFFSYMB30 Configuration

#define JPEG_HUFFSYMB30_DATA123         (0xFFU<<24)
#define JPEG_HUFFSYMB30_DATA123_0       (0x1U<<24)
#define JPEG_HUFFSYMB30_DATA122         (0xFFU<<16)
#define JPEG_HUFFSYMB30_DATA122_0       (0x1U<<16)
#define JPEG_HUFFSYMB30_DATA121         (0xFFU<<8)
#define JPEG_HUFFSYMB30_DATA121_0       (0x1U<<8)
#define JPEG_HUFFSYMB30_DATA120         (0xFFU<<0)
#define JPEG_HUFFSYMB30_DATA120_0       (0x1U<<0)

// HUFFSYMB31 Configuration

#define JPEG_HUFFSYMB31_DATA127         (0xFFU<<24)
#define JPEG_HUFFSYMB31_DATA127_0       (0x1U<<24)
#define JPEG_HUFFSYMB31_DATA126         (0xFFU<<16)
#define JPEG_HUFFSYMB31_DATA126_0       (0x1U<<16)
#define JPEG_HUFFSYMB31_DATA125         (0xFFU<<8)
#define JPEG_HUFFSYMB31_DATA125_0       (0x1U<<8)
#define JPEG_HUFFSYMB31_DATA124         (0xFFU<<0)
#define JPEG_HUFFSYMB31_DATA124_0       (0x1U<<0)

// HUFFSYMB32 Configuration

#define JPEG_HUFFSYMB32_DATA131         (0xFFU<<24)
#define JPEG_HUFFSYMB32_DATA131_0       (0x1U<<24)
#define JPEG_HUFFSYMB32_DATA130         (0xFFU<<16)
#define JPEG_HUFFSYMB32_DATA130_0       (0x1U<<16)
#define JPEG_HUFFSYMB32_DATA129         (0xFFU<<8)
#define JPEG_HUFFSYMB32_DATA129_0       (0x1U<<8)
#define JPEG_HUFFSYMB32_DATA128         (0xFFU<<0)
#define JPEG_HUFFSYMB32_DATA128_0       (0x1U<<0)

// HUFFSYMB33 Configuration

