Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
#define JPEG_HUFFSYMB33_DATA135         (0xFFU<<24)
#define JPEG_HUFFSYMB33_DATA135_0       (0x1U<<24)
#define JPEG_HUFFSYMB33_DATA134         (0xFFU<<16)
#define JPEG_HUFFSYMB33_DATA134_0       (0x1U<<16)
#define JPEG_HUFFSYMB33_DATA133         (0xFFU<<8)
#define JPEG_HUFFSYMB33_DATA133_0       (0x1U<<8)
#define JPEG_HUFFSYMB33_DATA132         (0xFFU<<0)
#define JPEG_HUFFSYMB33_DATA132_0       (0x1U<<0)

// HUFFSYMB34 Configuration

#define JPEG_HUFFSYMB34_DATA139         (0xFFU<<24)
#define JPEG_HUFFSYMB34_DATA139_0       (0x1U<<24)
#define JPEG_HUFFSYMB34_DATA138         (0xFFU<<16)
#define JPEG_HUFFSYMB34_DATA138_0       (0x1U<<16)
#define JPEG_HUFFSYMB34_DATA137         (0xFFU<<8)
#define JPEG_HUFFSYMB34_DATA137_0       (0x1U<<8)
#define JPEG_HUFFSYMB34_DATA136         (0xFFU<<0)
#define JPEG_HUFFSYMB34_DATA136_0       (0x1U<<0)

// HUFFSYMB35 Configuration

#define JPEG_HUFFSYMB35_DATA143         (0xFFU<<24)
#define JPEG_HUFFSYMB35_DATA143_0       (0x1U<<24)
#define JPEG_HUFFSYMB35_DATA142         (0xFFU<<16)
#define JPEG_HUFFSYMB35_DATA142_0       (0x1U<<16)
#define JPEG_HUFFSYMB35_DATA141         (0xFFU<<8)
#define JPEG_HUFFSYMB35_DATA141_0       (0x1U<<8)
#define JPEG_HUFFSYMB35_DATA140         (0xFFU<<0)
#define JPEG_HUFFSYMB35_DATA140_0       (0x1U<<0)

// HUFFSYMB36 Configuration

#define JPEG_HUFFSYMB36_DATA147         (0xFFU<<24)
#define JPEG_HUFFSYMB36_DATA147_0       (0x1U<<24)
#define JPEG_HUFFSYMB36_DATA146         (0xFFU<<16)
#define JPEG_HUFFSYMB36_DATA146_0       (0x1U<<16)
#define JPEG_HUFFSYMB36_DATA145         (0xFFU<<8)
#define JPEG_HUFFSYMB36_DATA145_0       (0x1U<<8)
#define JPEG_HUFFSYMB36_DATA144         (0xFFU<<0)
#define JPEG_HUFFSYMB36_DATA144_0       (0x1U<<0)

// HUFFSYMB37 Configuration

#define JPEG_HUFFSYMB37_DATA151         (0xFFU<<24)
#define JPEG_HUFFSYMB37_DATA151_0       (0x1U<<24)
#define JPEG_HUFFSYMB37_DATA150         (0xFFU<<16)
#define JPEG_HUFFSYMB37_DATA150_0       (0x1U<<16)
#define JPEG_HUFFSYMB37_DATA149         (0xFFU<<8)
#define JPEG_HUFFSYMB37_DATA149_0       (0x1U<<8)
#define JPEG_HUFFSYMB37_DATA148         (0xFFU<<0)
#define JPEG_HUFFSYMB37_DATA148_0       (0x1U<<0)

// HUFFSYMB38 Configuration

#define JPEG_HUFFSYMB38_DATA155         (0xFFU<<24)
#define JPEG_HUFFSYMB38_DATA155_0       (0x1U<<24)
#define JPEG_HUFFSYMB38_DATA154         (0xFFU<<16)
#define JPEG_HUFFSYMB38_DATA154_0       (0x1U<<16)
#define JPEG_HUFFSYMB38_DATA153         (0xFFU<<8)
#define JPEG_HUFFSYMB38_DATA153_0       (0x1U<<8)
#define JPEG_HUFFSYMB38_DATA152         (0xFFU<<0)
#define JPEG_HUFFSYMB38_DATA152_0       (0x1U<<0)

// HUFFSYMB39 Configuration

#define JPEG_HUFFSYMB39_DATA159         (0xFFU<<24)
#define JPEG_HUFFSYMB39_DATA159_0       (0x1U<<24)
#define JPEG_HUFFSYMB39_DATA158         (0xFFU<<16)
#define JPEG_HUFFSYMB39_DATA158_0       (0x1U<<16)
#define JPEG_HUFFSYMB39_DATA157         (0xFFU<<8)
#define JPEG_HUFFSYMB39_DATA157_0       (0x1U<<8)
#define JPEG_HUFFSYMB39_DATA156         (0xFFU<<0)
#define JPEG_HUFFSYMB39_DATA156_0       (0x1U<<0)

// HUFFSYMB40 Configuration

#define JPEG_HUFFSYMB40_DATA163         (0xFFU<<24)
#define JPEG_HUFFSYMB40_DATA163_0       (0x1U<<24)
#define JPEG_HUFFSYMB40_DATA162         (0xFFU<<16)
#define JPEG_HUFFSYMB40_DATA162_0       (0x1U<<16)
#define JPEG_HUFFSYMB40_DATA161         (0xFFU<<8)
#define JPEG_HUFFSYMB40_DATA161_0       (0x1U<<8)
#define JPEG_HUFFSYMB40_DATA160         (0xFFU<<0)
#define JPEG_HUFFSYMB40_DATA160_0       (0x1U<<0)

// HUFFSYMB41 Configuration

#define JPEG_HUFFSYMB41_DATA167         (0xFFU<<24)
#define JPEG_HUFFSYMB41_DATA167_0       (0x1U<<24)
#define JPEG_HUFFSYMB41_DATA166         (0xFFU<<16)
#define JPEG_HUFFSYMB41_DATA166_0       (0x1U<<16)
#define JPEG_HUFFSYMB41_DATA165         (0xFFU<<8)
#define JPEG_HUFFSYMB41_DATA165_0       (0x1U<<8)
#define JPEG_HUFFSYMB41_DATA164         (0xFFU<<0)
#define JPEG_HUFFSYMB41_DATA164_0       (0x1U<<0)

// HUFFSYMB42 Configuration

#define JPEG_HUFFSYMB42_DATA171         (0xFFU<<24)
#define JPEG_HUFFSYMB42_DATA171_0       (0x1U<<24)
#define JPEG_HUFFSYMB42_DATA170         (0xFFU<<16)
#define JPEG_HUFFSYMB42_DATA170_0       (0x1U<<16)
#define JPEG_HUFFSYMB42_DATA169         (0xFFU<<8)
#define JPEG_HUFFSYMB42_DATA169_0       (0x1U<<8)
#define JPEG_HUFFSYMB42_DATA168         (0xFFU<<0)
#define JPEG_HUFFSYMB42_DATA168_0       (0x1U<<0)

// HUFFSYMB43 Configuration

#define JPEG_HUFFSYMB43_DATA175         (0xFFU<<24)
#define JPEG_HUFFSYMB43_DATA175_0       (0x1U<<24)
#define JPEG_HUFFSYMB43_DATA174         (0xFFU<<16)
#define JPEG_HUFFSYMB43_DATA174_0       (0x1U<<16)
#define JPEG_HUFFSYMB43_DATA173         (0xFFU<<8)
#define JPEG_HUFFSYMB43_DATA173_0       (0x1U<<8)
#define JPEG_HUFFSYMB43_DATA172         (0xFFU<<0)
#define JPEG_HUFFSYMB43_DATA172_0       (0x1U<<0)

// HUFFSYMB44 Configuration

#define JPEG_HUFFSYMB44_DATA179         (0xFFU<<24)
#define JPEG_HUFFSYMB44_DATA179_0       (0x1U<<24)
#define JPEG_HUFFSYMB44_DATA178         (0xFFU<<16)
#define JPEG_HUFFSYMB44_DATA178_0       (0x1U<<16)
#define JPEG_HUFFSYMB44_DATA177         (0xFFU<<8)
#define JPEG_HUFFSYMB44_DATA177_0       (0x1U<<8)
#define JPEG_HUFFSYMB44_DATA176         (0xFFU<<0)
#define JPEG_HUFFSYMB44_DATA176_0       (0x1U<<0)

// HUFFSYMB45 Configuration

#define JPEG_HUFFSYMB45_DATA183         (0xFFU<<24)
#define JPEG_HUFFSYMB45_DATA183_0       (0x1U<<24)
#define JPEG_HUFFSYMB45_DATA182         (0xFFU<<16)
#define JPEG_HUFFSYMB45_DATA182_0       (0x1U<<16)
#define JPEG_HUFFSYMB45_DATA181         (0xFFU<<8)
#define JPEG_HUFFSYMB45_DATA181_0       (0x1U<<8)
#define JPEG_HUFFSYMB45_DATA180         (0xFFU<<0)
#define JPEG_HUFFSYMB45_DATA180_0       (0x1U<<0)

// HUFFSYMB46 Configuration

#define JPEG_HUFFSYMB46_DATA187         (0xFFU<<24)
#define JPEG_HUFFSYMB46_DATA187_0       (0x1U<<24)
#define JPEG_HUFFSYMB46_DATA186         (0xFFU<<16)
#define JPEG_HUFFSYMB46_DATA186_0       (0x1U<<16)
#define JPEG_HUFFSYMB46_DATA185         (0xFFU<<8)
#define JPEG_HUFFSYMB46_DATA185_0       (0x1U<<8)
#define JPEG_HUFFSYMB46_DATA184         (0xFFU<<0)
#define JPEG_HUFFSYMB46_DATA184_0       (0x1U<<0)

// HUFFSYMB47 Configuration

#define JPEG_HUFFSYMB47_DATA191         (0xFFU<<24)
#define JPEG_HUFFSYMB47_DATA191_0       (0x1U<<24)
#define JPEG_HUFFSYMB47_DATA190         (0xFFU<<16)
#define JPEG_HUFFSYMB47_DATA190_0       (0x1U<<16)
#define JPEG_HUFFSYMB47_DATA189         (0xFFU<<8)
#define JPEG_HUFFSYMB47_DATA189_0       (0x1U<<8)
#define JPEG_HUFFSYMB47_DATA188         (0xFFU<<0)
#define JPEG_HUFFSYMB47_DATA188_0       (0x1U<<0)

// HUFFSYMB48 Configuration

#define JPEG_HUFFSYMB48_DATA195         (0xFFU<<24)
#define JPEG_HUFFSYMB48_DATA195_0       (0x1U<<24)
#define JPEG_HUFFSYMB48_DATA194         (0xFFU<<16)
#define JPEG_HUFFSYMB48_DATA194_0       (0x1U<<16)
#define JPEG_HUFFSYMB48_DATA193         (0xFFU<<8)
#define JPEG_HUFFSYMB48_DATA193_0       (0x1U<<8)
#define JPEG_HUFFSYMB48_DATA192         (0xFFU<<0)
#define JPEG_HUFFSYMB48_DATA192_0       (0x1U<<0)

// HUFFSYMB49 Configuration

#define JPEG_HUFFSYMB49_DATA199         (0xFFU<<24)
#define JPEG_HUFFSYMB49_DATA199_0       (0x1U<<24)
#define JPEG_HUFFSYMB49_DATA198         (0xFFU<<16)
#define JPEG_HUFFSYMB49_DATA198_0       (0x1U<<16)
#define JPEG_HUFFSYMB49_DATA197         (0xFFU<<8)
#define JPEG_HUFFSYMB49_DATA197_0       (0x1U<<8)
#define JPEG_HUFFSYMB49_DATA196         (0xFFU<<0)
#define JPEG_HUFFSYMB49_DATA196_0       (0x1U<<0)

