Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFSYMB66 Configuration

#define JPEG_HUFFSYMB66_DATA267         (0xFFU<<24)
#define JPEG_HUFFSYMB66_DATA267_0       (0x1U<<24)
#define JPEG_HUFFSYMB66_DATA266         (0xFFU<<16)
#define JPEG_HUFFSYMB66_DATA266_0       (0x1U<<16)
#define JPEG_HUFFSYMB66_DATA265         (0xFFU<<8)
#define JPEG_HUFFSYMB66_DATA265_0       (0x1U<<8)
#define JPEG_HUFFSYMB66_DATA264         (0xFFU<<0)
#define JPEG_HUFFSYMB66_DATA264_0       (0x1U<<0)

// HUFFSYMB67 Configuration

#define JPEG_HUFFSYMB67_DATA271         (0xFFU<<24)
#define JPEG_HUFFSYMB67_DATA271_0       (0x1U<<24)
#define JPEG_HUFFSYMB67_DATA270         (0xFFU<<16)
#define JPEG_HUFFSYMB67_DATA270_0       (0x1U<<16)
#define JPEG_HUFFSYMB67_DATA269         (0xFFU<<8)
#define JPEG_HUFFSYMB67_DATA269_0       (0x1U<<8)
#define JPEG_HUFFSYMB67_DATA268         (0xFFU<<0)
#define JPEG_HUFFSYMB67_DATA268_0       (0x1U<<0)

// HUFFSYMB68 Configuration

#define JPEG_HUFFSYMB68_DATA275         (0xFFU<<24)
#define JPEG_HUFFSYMB68_DATA275_0       (0x1U<<24)
#define JPEG_HUFFSYMB68_DATA274         (0xFFU<<16)
#define JPEG_HUFFSYMB68_DATA274_0       (0x1U<<16)
#define JPEG_HUFFSYMB68_DATA273         (0xFFU<<8)
#define JPEG_HUFFSYMB68_DATA273_0       (0x1U<<8)
#define JPEG_HUFFSYMB68_DATA272         (0xFFU<<0)
#define JPEG_HUFFSYMB68_DATA272_0       (0x1U<<0)

// HUFFSYMB69 Configuration

#define JPEG_HUFFSYMB69_DATA279         (0xFFU<<24)
#define JPEG_HUFFSYMB69_DATA279_0       (0x1U<<24)
#define JPEG_HUFFSYMB69_DATA278         (0xFFU<<16)
#define JPEG_HUFFSYMB69_DATA278_0       (0x1U<<16)
#define JPEG_HUFFSYMB69_DATA277         (0xFFU<<8)
#define JPEG_HUFFSYMB69_DATA277_0       (0x1U<<8)
#define JPEG_HUFFSYMB69_DATA276         (0xFFU<<0)
#define JPEG_HUFFSYMB69_DATA276_0       (0x1U<<0)

// HUFFSYMB70 Configuration

#define JPEG_HUFFSYMB70_DATA283         (0xFFU<<24)
#define JPEG_HUFFSYMB70_DATA283_0       (0x1U<<24)
#define JPEG_HUFFSYMB70_DATA282         (0xFFU<<16)
#define JPEG_HUFFSYMB70_DATA282_0       (0x1U<<16)
#define JPEG_HUFFSYMB70_DATA281         (0xFFU<<8)
#define JPEG_HUFFSYMB70_DATA281_0       (0x1U<<8)
#define JPEG_HUFFSYMB70_DATA280         (0xFFU<<0)
#define JPEG_HUFFSYMB70_DATA280_0       (0x1U<<0)

// HUFFSYMB71 Configuration

#define JPEG_HUFFSYMB71_DATA287         (0xFFU<<24)
#define JPEG_HUFFSYMB71_DATA287_0       (0x1U<<24)
#define JPEG_HUFFSYMB71_DATA286         (0xFFU<<16)
#define JPEG_HUFFSYMB71_DATA286_0       (0x1U<<16)
#define JPEG_HUFFSYMB71_DATA285         (0xFFU<<8)
#define JPEG_HUFFSYMB71_DATA285_0       (0x1U<<8)
#define JPEG_HUFFSYMB71_DATA284         (0xFFU<<0)
#define JPEG_HUFFSYMB71_DATA284_0       (0x1U<<0)

// HUFFSYMB72 Configuration

#define JPEG_HUFFSYMB72_DATA291         (0xFFU<<24)
#define JPEG_HUFFSYMB72_DATA291_0       (0x1U<<24)
#define JPEG_HUFFSYMB72_DATA290         (0xFFU<<16)
#define JPEG_HUFFSYMB72_DATA290_0       (0x1U<<16)
#define JPEG_HUFFSYMB72_DATA289         (0xFFU<<8)
#define JPEG_HUFFSYMB72_DATA289_0       (0x1U<<8)
#define JPEG_HUFFSYMB72_DATA288         (0xFFU<<0)
#define JPEG_HUFFSYMB72_DATA288_0       (0x1U<<0)

// HUFFSYMB73 Configuration

#define JPEG_HUFFSYMB73_DATA295         (0xFFU<<24)
#define JPEG_HUFFSYMB73_DATA295_0       (0x1U<<24)
#define JPEG_HUFFSYMB73_DATA294         (0xFFU<<16)
#define JPEG_HUFFSYMB73_DATA294_0       (0x1U<<16)
#define JPEG_HUFFSYMB73_DATA293         (0xFFU<<8)
#define JPEG_HUFFSYMB73_DATA293_0       (0x1U<<8)
#define JPEG_HUFFSYMB73_DATA292         (0xFFU<<0)
#define JPEG_HUFFSYMB73_DATA292_0       (0x1U<<0)

// HUFFSYMB74 Configuration

#define JPEG_HUFFSYMB74_DATA299         (0xFFU<<24)
#define JPEG_HUFFSYMB74_DATA299_0       (0x1U<<24)
#define JPEG_HUFFSYMB74_DATA298         (0xFFU<<16)
#define JPEG_HUFFSYMB74_DATA298_0       (0x1U<<16)
#define JPEG_HUFFSYMB74_DATA297         (0xFFU<<8)
#define JPEG_HUFFSYMB74_DATA297_0       (0x1U<<8)
#define JPEG_HUFFSYMB74_DATA296         (0xFFU<<0)
#define JPEG_HUFFSYMB74_DATA296_0       (0x1U<<0)

// HUFFSYMB75 Configuration

#define JPEG_HUFFSYMB75_DATA303         (0xFFU<<24)
#define JPEG_HUFFSYMB75_DATA303_0       (0x1U<<24)
#define JPEG_HUFFSYMB75_DATA302         (0xFFU<<16)
#define JPEG_HUFFSYMB75_DATA302_0       (0x1U<<16)
#define JPEG_HUFFSYMB75_DATA301         (0xFFU<<8)
#define JPEG_HUFFSYMB75_DATA301_0       (0x1U<<8)
#define JPEG_HUFFSYMB75_DATA300         (0xFFU<<0)
#define JPEG_HUFFSYMB75_DATA300_0       (0x1U<<0)

// HUFFSYMB76 Configuration

#define JPEG_HUFFSYMB76_DATA307         (0xFFU<<24)
#define JPEG_HUFFSYMB76_DATA307_0       (0x1U<<24)
#define JPEG_HUFFSYMB76_DATA306         (0xFFU<<16)
#define JPEG_HUFFSYMB76_DATA306_0       (0x1U<<16)
#define JPEG_HUFFSYMB76_DATA305         (0xFFU<<8)
#define JPEG_HUFFSYMB76_DATA305_0       (0x1U<<8)
#define JPEG_HUFFSYMB76_DATA304         (0xFFU<<0)
#define JPEG_HUFFSYMB76_DATA304_0       (0x1U<<0)

// HUFFSYMB77 Configuration

#define JPEG_HUFFSYMB77_DATA311         (0xFFU<<24)
#define JPEG_HUFFSYMB77_DATA311_0       (0x1U<<24)
#define JPEG_HUFFSYMB77_DATA310         (0xFFU<<16)
#define JPEG_HUFFSYMB77_DATA310_0       (0x1U<<16)
#define JPEG_HUFFSYMB77_DATA309         (0xFFU<<8)
#define JPEG_HUFFSYMB77_DATA309_0       (0x1U<<8)
#define JPEG_HUFFSYMB77_DATA308         (0xFFU<<0)
#define JPEG_HUFFSYMB77_DATA308_0       (0x1U<<0)

// HUFFSYMB78 Configuration

#define JPEG_HUFFSYMB78_DATA315         (0xFFU<<24)
#define JPEG_HUFFSYMB78_DATA315_0       (0x1U<<24)
#define JPEG_HUFFSYMB78_DATA314         (0xFFU<<16)
#define JPEG_HUFFSYMB78_DATA314_0       (0x1U<<16)
#define JPEG_HUFFSYMB78_DATA313         (0xFFU<<8)
#define JPEG_HUFFSYMB78_DATA313_0       (0x1U<<8)
#define JPEG_HUFFSYMB78_DATA312         (0xFFU<<0)
#define JPEG_HUFFSYMB78_DATA312_0       (0x1U<<0)

// HUFFSYMB79 Configuration

#define JPEG_HUFFSYMB79_DATA319         (0xFFU<<24)
#define JPEG_HUFFSYMB79_DATA319_0       (0x1U<<24)
#define JPEG_HUFFSYMB79_DATA318         (0xFFU<<16)
#define JPEG_HUFFSYMB79_DATA318_0       (0x1U<<16)
#define JPEG_HUFFSYMB79_DATA317         (0xFFU<<8)
#define JPEG_HUFFSYMB79_DATA317_0       (0x1U<<8)
#define JPEG_HUFFSYMB79_DATA316         (0xFFU<<0)
#define JPEG_HUFFSYMB79_DATA316_0       (0x1U<<0)

// HUFFSYMB80 Configuration

#define JPEG_HUFFSYMB80_DATA323         (0xFFU<<24)
#define JPEG_HUFFSYMB80_DATA323_0       (0x1U<<24)
#define JPEG_HUFFSYMB80_DATA322         (0xFFU<<16)
#define JPEG_HUFFSYMB80_DATA322_0       (0x1U<<16)
#define JPEG_HUFFSYMB80_DATA321         (0xFFU<<8)
#define JPEG_HUFFSYMB80_DATA321_0       (0x1U<<8)
#define JPEG_HUFFSYMB80_DATA320         (0xFFU<<0)
#define JPEG_HUFFSYMB80_DATA320_0       (0x1U<<0)

// HUFFSYMB81 Configuration

#define JPEG_HUFFSYMB81_DATA327         (0xFFU<<24)
#define JPEG_HUFFSYMB81_DATA327_0       (0x1U<<24)
#define JPEG_HUFFSYMB81_DATA326         (0xFFU<<16)
#define JPEG_HUFFSYMB81_DATA326_0       (0x1U<<16)
#define JPEG_HUFFSYMB81_DATA325         (0xFFU<<8)
#define JPEG_HUFFSYMB81_DATA325_0       (0x1U<<8)
#define JPEG_HUFFSYMB81_DATA324         (0xFFU<<0)
#define JPEG_HUFFSYMB81_DATA324_0       (0x1U<<0)

