Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFSYMB82 Configuration

#define JPEG_HUFFSYMB82_DATA331         (0xFFU<<24)
#define JPEG_HUFFSYMB82_DATA331_0       (0x1U<<24)
#define JPEG_HUFFSYMB82_DATA330         (0xFFU<<16)
#define JPEG_HUFFSYMB82_DATA330_0       (0x1U<<16)
#define JPEG_HUFFSYMB82_DATA329         (0xFFU<<8)
#define JPEG_HUFFSYMB82_DATA329_0       (0x1U<<8)
#define JPEG_HUFFSYMB82_DATA328         (0xFFU<<0)
#define JPEG_HUFFSYMB82_DATA328_0       (0x1U<<0)

// HUFFSYMB83 Configuration

#define JPEG_HUFFSYMB83_DATA335         (0xFFU<<24)
#define JPEG_HUFFSYMB83_DATA335_0       (0x1U<<24)
#define JPEG_HUFFSYMB83_DATA334         (0xFFU<<16)
#define JPEG_HUFFSYMB83_DATA334_0       (0x1U<<16)
#define JPEG_HUFFSYMB83_DATA333         (0xFFU<<8)
#define JPEG_HUFFSYMB83_DATA333_0       (0x1U<<8)
#define JPEG_HUFFSYMB83_DATA332         (0xFFU<<0)
#define JPEG_HUFFSYMB83_DATA332_0       (0x1U<<0)

// DHTMEM0 Configuration

#define JPEG_DHTMEM0_DATA3              (0xFFU<<24)
#define JPEG_DHTMEM0_DATA3_0            (0x1U<<24)
#define JPEG_DHTMEM0_DATA2              (0xFFU<<16)
#define JPEG_DHTMEM0_DATA2_0            (0x1U<<16)
#define JPEG_DHTMEM0_DATA1              (0xFFU<<8)
#define JPEG_DHTMEM0_DATA1_0            (0x1U<<8)
#define JPEG_DHTMEM0_DATA0              (0xFFU<<0)
#define JPEG_DHTMEM0_DATA0_0            (0x1U<<0)

// DHTMEM1 Configuration

#define JPEG_DHTMEM1_DATA7              (0xFFU<<24)
#define JPEG_DHTMEM1_DATA7_0            (0x1U<<24)
#define JPEG_DHTMEM1_DATA6              (0xFFU<<16)
#define JPEG_DHTMEM1_DATA6_0            (0x1U<<16)
#define JPEG_DHTMEM1_DATA5              (0xFFU<<8)
#define JPEG_DHTMEM1_DATA5_0            (0x1U<<8)
#define JPEG_DHTMEM1_DATA4              (0xFFU<<0)
#define JPEG_DHTMEM1_DATA4_0            (0x1U<<0)

// DHTMEM2 Configuration

#define JPEG_DHTMEM2_DATA11             (0xFFU<<24)
#define JPEG_DHTMEM2_DATA11_0           (0x1U<<24)
#define JPEG_DHTMEM2_DATA10             (0xFFU<<16)
#define JPEG_DHTMEM2_DATA10_0           (0x1U<<16)
#define JPEG_DHTMEM2_DATA9              (0xFFU<<8)
#define JPEG_DHTMEM2_DATA9_0            (0x1U<<8)
#define JPEG_DHTMEM2_DATA8              (0xFFU<<0)
#define JPEG_DHTMEM2_DATA8_0            (0x1U<<0)

// DHTMEM3 Configuration

#define JPEG_DHTMEM3_DATA15             (0xFFU<<24)
#define JPEG_DHTMEM3_DATA15_0           (0x1U<<24)
#define JPEG_DHTMEM3_DATA14             (0xFFU<<16)
#define JPEG_DHTMEM3_DATA14_0           (0x1U<<16)
#define JPEG_DHTMEM3_DATA13             (0xFFU<<8)
#define JPEG_DHTMEM3_DATA13_0           (0x1U<<8)
#define JPEG_DHTMEM3_DATA12             (0xFFU<<0)
#define JPEG_DHTMEM3_DATA12_0           (0x1U<<0)

// DHTMEM4 Configuration

#define JPEG_DHTMEM4_DATA19             (0xFFU<<24)
#define JPEG_DHTMEM4_DATA19_0           (0x1U<<24)
#define JPEG_DHTMEM4_DATA18             (0xFFU<<16)
#define JPEG_DHTMEM4_DATA18_0           (0x1U<<16)
#define JPEG_DHTMEM4_DATA17             (0xFFU<<8)
#define JPEG_DHTMEM4_DATA17_0           (0x1U<<8)
#define JPEG_DHTMEM4_DATA16             (0xFFU<<0)
#define JPEG_DHTMEM4_DATA16_0           (0x1U<<0)

// DHTMEM5 Configuration

#define JPEG_DHTMEM5_DATA23             (0xFFU<<24)
#define JPEG_DHTMEM5_DATA23_0           (0x1U<<24)
#define JPEG_DHTMEM5_DATA22             (0xFFU<<16)
#define JPEG_DHTMEM5_DATA22_0           (0x1U<<16)
#define JPEG_DHTMEM5_DATA21             (0xFFU<<8)
#define JPEG_DHTMEM5_DATA21_0           (0x1U<<8)
#define JPEG_DHTMEM5_DATA20             (0xFFU<<0)
#define JPEG_DHTMEM5_DATA20_0           (0x1U<<0)

// DHTMEM6 Configuration

#define JPEG_DHTMEM6_DATA27             (0xFFU<<24)
#define JPEG_DHTMEM6_DATA27_0           (0x1U<<24)
#define JPEG_DHTMEM6_DATA26             (0xFFU<<16)
#define JPEG_DHTMEM6_DATA26_0           (0x1U<<16)
#define JPEG_DHTMEM6_DATA25             (0xFFU<<8)
#define JPEG_DHTMEM6_DATA25_0           (0x1U<<8)
#define JPEG_DHTMEM6_DATA24             (0xFFU<<0)
#define JPEG_DHTMEM6_DATA24_0           (0x1U<<0)

// DHTMEM7 Configuration

#define JPEG_DHTMEM7_DATA31             (0xFFU<<24)
#define JPEG_DHTMEM7_DATA31_0           (0x1U<<24)
#define JPEG_DHTMEM7_DATA30             (0xFFU<<16)
#define JPEG_DHTMEM7_DATA30_0           (0x1U<<16)
#define JPEG_DHTMEM7_DATA29             (0xFFU<<8)
#define JPEG_DHTMEM7_DATA29_0           (0x1U<<8)
#define JPEG_DHTMEM7_DATA28             (0xFFU<<0)
#define JPEG_DHTMEM7_DATA28_0           (0x1U<<0)

// DHTMEM8 Configuration

#define JPEG_DHTMEM8_DATA35             (0xFFU<<24)
#define JPEG_DHTMEM8_DATA35_0           (0x1U<<24)
#define JPEG_DHTMEM8_DATA34             (0xFFU<<16)
#define JPEG_DHTMEM8_DATA34_0           (0x1U<<16)
#define JPEG_DHTMEM8_DATA33             (0xFFU<<8)
#define JPEG_DHTMEM8_DATA33_0           (0x1U<<8)
#define JPEG_DHTMEM8_DATA32             (0xFFU<<0)
#define JPEG_DHTMEM8_DATA32_0           (0x1U<<0)

// DHTMEM9 Configuration

#define JPEG_DHTMEM9_DATA39             (0xFFU<<24)
#define JPEG_DHTMEM9_DATA39_0           (0x1U<<24)
#define JPEG_DHTMEM9_DATA38             (0xFFU<<16)
#define JPEG_DHTMEM9_DATA38_0           (0x1U<<16)
#define JPEG_DHTMEM9_DATA37             (0xFFU<<8)
#define JPEG_DHTMEM9_DATA37_0           (0x1U<<8)
#define JPEG_DHTMEM9_DATA36             (0xFFU<<0)
#define JPEG_DHTMEM9_DATA36_0           (0x1U<<0)

// DHTMEM10 Configuration

#define JPEG_DHTMEM10_DATA43            (0xFFU<<24)
#define JPEG_DHTMEM10_DATA43_0          (0x1U<<24)
#define JPEG_DHTMEM10_DATA42            (0xFFU<<16)
#define JPEG_DHTMEM10_DATA42_0          (0x1U<<16)
#define JPEG_DHTMEM10_DATA41            (0xFFU<<8)
#define JPEG_DHTMEM10_DATA41_0          (0x1U<<8)
#define JPEG_DHTMEM10_DATA40            (0xFFU<<0)
#define JPEG_DHTMEM10_DATA40_0          (0x1U<<0)

// DHTMEM11 Configuration

#define JPEG_DHTMEM11_DATA47            (0xFFU<<24)
#define JPEG_DHTMEM11_DATA47_0          (0x1U<<24)
#define JPEG_DHTMEM11_DATA46            (0xFFU<<16)
#define JPEG_DHTMEM11_DATA46_0          (0x1U<<16)
#define JPEG_DHTMEM11_DATA45            (0xFFU<<8)
#define JPEG_DHTMEM11_DATA45_0          (0x1U<<8)
#define JPEG_DHTMEM11_DATA44            (0xFFU<<0)
#define JPEG_DHTMEM11_DATA44_0          (0x1U<<0)

// DHTMEM12 Configuration

