Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// DHTMEM26 Configuration

#define JPEG_DHTMEM26_DATA107           (0xFFU<<24)
#define JPEG_DHTMEM26_DATA107_0         (0x1U<<24)
#define JPEG_DHTMEM26_DATA106           (0xFFU<<16)
#define JPEG_DHTMEM26_DATA106_0         (0x1U<<16)
#define JPEG_DHTMEM26_DATA105           (0xFFU<<8)
#define JPEG_DHTMEM26_DATA105_0         (0x1U<<8)
#define JPEG_DHTMEM26_DATA104           (0xFFU<<0)
#define JPEG_DHTMEM26_DATA104_0         (0x1U<<0)

// DHTMEM27 Configuration

#define JPEG_DHTMEM27_DATA111           (0xFFU<<24)
#define JPEG_DHTMEM27_DATA111_0         (0x1U<<24)
#define JPEG_DHTMEM27_DATA110           (0xFFU<<16)
#define JPEG_DHTMEM27_DATA110_0         (0x1U<<16)
#define JPEG_DHTMEM27_DATA109           (0xFFU<<8)
#define JPEG_DHTMEM27_DATA109_0         (0x1U<<8)
#define JPEG_DHTMEM27_DATA108           (0xFFU<<0)
#define JPEG_DHTMEM27_DATA108_0         (0x1U<<0)

// DHTMEM28 Configuration

#define JPEG_DHTMEM28_DATA115           (0xFFU<<24)
#define JPEG_DHTMEM28_DATA115_0         (0x1U<<24)
#define JPEG_DHTMEM28_DATA114           (0xFFU<<16)
#define JPEG_DHTMEM28_DATA114_0         (0x1U<<16)
#define JPEG_DHTMEM28_DATA113           (0xFFU<<8)
#define JPEG_DHTMEM28_DATA113_0         (0x1U<<8)
#define JPEG_DHTMEM28_DATA112           (0xFFU<<0)
#define JPEG_DHTMEM28_DATA112_0         (0x1U<<0)

// DHTMEM29 Configuration

#define JPEG_DHTMEM29_DATA119           (0xFFU<<24)
#define JPEG_DHTMEM29_DATA119_0         (0x1U<<24)
#define JPEG_DHTMEM29_DATA118           (0xFFU<<16)
#define JPEG_DHTMEM29_DATA118_0         (0x1U<<16)
#define JPEG_DHTMEM29_DATA117           (0xFFU<<8)
#define JPEG_DHTMEM29_DATA117_0         (0x1U<<8)
#define JPEG_DHTMEM29_DATA116           (0xFFU<<0)
#define JPEG_DHTMEM29_DATA116_0         (0x1U<<0)

// DHTMEM30 Configuration

#define JPEG_DHTMEM30_DATA123           (0xFFU<<24)
#define JPEG_DHTMEM30_DATA123_0         (0x1U<<24)
#define JPEG_DHTMEM30_DATA122           (0xFFU<<16)
#define JPEG_DHTMEM30_DATA122_0         (0x1U<<16)
#define JPEG_DHTMEM30_DATA121           (0xFFU<<8)
#define JPEG_DHTMEM30_DATA121_0         (0x1U<<8)
#define JPEG_DHTMEM30_DATA120           (0xFFU<<0)
#define JPEG_DHTMEM30_DATA120_0         (0x1U<<0)

// DHTMEM31 Configuration

#define JPEG_DHTMEM31_DATA127           (0xFFU<<24)
#define JPEG_DHTMEM31_DATA127_0         (0x1U<<24)
#define JPEG_DHTMEM31_DATA126           (0xFFU<<16)
#define JPEG_DHTMEM31_DATA126_0         (0x1U<<16)
#define JPEG_DHTMEM31_DATA125           (0xFFU<<8)
#define JPEG_DHTMEM31_DATA125_0         (0x1U<<8)
#define JPEG_DHTMEM31_DATA124           (0xFFU<<0)
#define JPEG_DHTMEM31_DATA124_0         (0x1U<<0)

// DHTMEM32 Configuration

#define JPEG_DHTMEM32_DATA131           (0xFFU<<24)
#define JPEG_DHTMEM32_DATA131_0         (0x1U<<24)
#define JPEG_DHTMEM32_DATA130           (0xFFU<<16)
#define JPEG_DHTMEM32_DATA130_0         (0x1U<<16)
#define JPEG_DHTMEM32_DATA129           (0xFFU<<8)
#define JPEG_DHTMEM32_DATA129_0         (0x1U<<8)
#define JPEG_DHTMEM32_DATA128           (0xFFU<<0)
#define JPEG_DHTMEM32_DATA128_0         (0x1U<<0)

// DHTMEM33 Configuration

#define JPEG_DHTMEM33_DATA135           (0xFFU<<24)
#define JPEG_DHTMEM33_DATA135_0         (0x1U<<24)
#define JPEG_DHTMEM33_DATA134           (0xFFU<<16)
#define JPEG_DHTMEM33_DATA134_0         (0x1U<<16)
#define JPEG_DHTMEM33_DATA133           (0xFFU<<8)
#define JPEG_DHTMEM33_DATA133_0         (0x1U<<8)
#define JPEG_DHTMEM33_DATA132           (0xFFU<<0)
#define JPEG_DHTMEM33_DATA132_0         (0x1U<<0)

// DHTMEM34 Configuration

#define JPEG_DHTMEM34_DATA139           (0xFFU<<24)
#define JPEG_DHTMEM34_DATA139_0         (0x1U<<24)
#define JPEG_DHTMEM34_DATA138           (0xFFU<<16)
#define JPEG_DHTMEM34_DATA138_0         (0x1U<<16)
#define JPEG_DHTMEM34_DATA137           (0xFFU<<8)
#define JPEG_DHTMEM34_DATA137_0         (0x1U<<8)
#define JPEG_DHTMEM34_DATA136           (0xFFU<<0)
#define JPEG_DHTMEM34_DATA136_0         (0x1U<<0)

// DHTMEM35 Configuration

#define JPEG_DHTMEM35_DATA143           (0xFFU<<24)
#define JPEG_DHTMEM35_DATA143_0         (0x1U<<24)
#define JPEG_DHTMEM35_DATA142           (0xFFU<<16)
#define JPEG_DHTMEM35_DATA142_0         (0x1U<<16)
#define JPEG_DHTMEM35_DATA141           (0xFFU<<8)
#define JPEG_DHTMEM35_DATA141_0         (0x1U<<8)
#define JPEG_DHTMEM35_DATA140           (0xFFU<<0)
#define JPEG_DHTMEM35_DATA140_0         (0x1U<<0)

// DHTMEM36 Configuration

#define JPEG_DHTMEM36_DATA147           (0xFFU<<24)
#define JPEG_DHTMEM36_DATA147_0         (0x1U<<24)
#define JPEG_DHTMEM36_DATA146           (0xFFU<<16)
#define JPEG_DHTMEM36_DATA146_0         (0x1U<<16)
#define JPEG_DHTMEM36_DATA145           (0xFFU<<8)
#define JPEG_DHTMEM36_DATA145_0         (0x1U<<8)
#define JPEG_DHTMEM36_DATA144           (0xFFU<<0)
#define JPEG_DHTMEM36_DATA144_0         (0x1U<<0)

// DHTMEM37 Configuration

#define JPEG_DHTMEM37_DATA151           (0xFFU<<24)
#define JPEG_DHTMEM37_DATA151_0         (0x1U<<24)
#define JPEG_DHTMEM37_DATA150           (0xFFU<<16)
#define JPEG_DHTMEM37_DATA150_0         (0x1U<<16)
#define JPEG_DHTMEM37_DATA149           (0xFFU<<8)
#define JPEG_DHTMEM37_DATA149_0         (0x1U<<8)
#define JPEG_DHTMEM37_DATA148           (0xFFU<<0)
#define JPEG_DHTMEM37_DATA148_0         (0x1U<<0)

// DHTMEM38 Configuration

#define JPEG_DHTMEM38_DATA155           (0xFFU<<24)
#define JPEG_DHTMEM38_DATA155_0         (0x1U<<24)
#define JPEG_DHTMEM38_DATA154           (0xFFU<<16)
#define JPEG_DHTMEM38_DATA154_0         (0x1U<<16)
#define JPEG_DHTMEM38_DATA153           (0xFFU<<8)
#define JPEG_DHTMEM38_DATA153_0         (0x1U<<8)
#define JPEG_DHTMEM38_DATA152           (0xFFU<<0)
#define JPEG_DHTMEM38_DATA152_0         (0x1U<<0)

// DHTMEM39 Configuration

#define JPEG_DHTMEM39_DATA159           (0xFFU<<24)
#define JPEG_DHTMEM39_DATA159_0         (0x1U<<24)
#define JPEG_DHTMEM39_DATA158           (0xFFU<<16)
#define JPEG_DHTMEM39_DATA158_0         (0x1U<<16)
#define JPEG_DHTMEM39_DATA157           (0xFFU<<8)
#define JPEG_DHTMEM39_DATA157_0         (0x1U<<8)
#define JPEG_DHTMEM39_DATA156           (0xFFU<<0)
#define JPEG_DHTMEM39_DATA156_0         (0x1U<<0)

// DHTMEM40 Configuration

#define JPEG_DHTMEM40_DATA163           (0xFFU<<24)
#define JPEG_DHTMEM40_DATA163_0         (0x1U<<24)
#define JPEG_DHTMEM40_DATA162           (0xFFU<<16)
#define JPEG_DHTMEM40_DATA162_0         (0x1U<<16)
#define JPEG_DHTMEM40_DATA161           (0xFFU<<8)
#define JPEG_DHTMEM40_DATA161_0         (0x1U<<8)
#define JPEG_DHTMEM40_DATA160           (0xFFU<<0)
#define JPEG_DHTMEM40_DATA160_0         (0x1U<<0)

// DHTMEM41 Configuration

#define JPEG_DHTMEM41_DATA167           (0xFFU<<24)
#define JPEG_DHTMEM41_DATA167_0         (0x1U<<24)
#define JPEG_DHTMEM41_DATA166           (0xFFU<<16)
#define JPEG_DHTMEM41_DATA166_0         (0x1U<<16)
#define JPEG_DHTMEM41_DATA165           (0xFFU<<8)
#define JPEG_DHTMEM41_DATA165_0         (0x1U<<8)
#define JPEG_DHTMEM41_DATA164           (0xFFU<<0)
#define JPEG_DHTMEM41_DATA164_0         (0x1U<<0)

// DHTMEM42 Configuration

#define JPEG_DHTMEM42_DATA171           (0xFFU<<24)
#define JPEG_DHTMEM42_DATA171_0         (0x1U<<24)
#define JPEG_DHTMEM42_DATA170           (0xFFU<<16)
#define JPEG_DHTMEM42_DATA170_0         (0x1U<<16)
#define JPEG_DHTMEM42_DATA169           (0xFFU<<8)
#define JPEG_DHTMEM42_DATA169_0         (0x1U<<8)
#define JPEG_DHTMEM42_DATA168           (0xFFU<<0)
#define JPEG_DHTMEM42_DATA168_0         (0x1U<<0)

// DHTMEM43 Configuration

#define JPEG_DHTMEM43_DATA175           (0xFFU<<24)
#define JPEG_DHTMEM43_DATA175_0         (0x1U<<24)
#define JPEG_DHTMEM43_DATA174           (0xFFU<<16)
#define JPEG_DHTMEM43_DATA174_0         (0x1U<<16)
#define JPEG_DHTMEM43_DATA173           (0xFFU<<8)
#define JPEG_DHTMEM43_DATA173_0         (0x1U<<8)
#define JPEG_DHTMEM43_DATA172           (0xFFU<<0)
#define JPEG_DHTMEM43_DATA172_0         (0x1U<<0)

// DHTMEM44 Configuration

#define JPEG_DHTMEM44_DATA179           (0xFFU<<24)
#define JPEG_DHTMEM44_DATA179_0         (0x1U<<24)
#define JPEG_DHTMEM44_DATA178           (0xFFU<<16)
#define JPEG_DHTMEM44_DATA178_0         (0x1U<<16)
#define JPEG_DHTMEM44_DATA177           (0xFFU<<8)
#define JPEG_DHTMEM44_DATA177_0         (0x1U<<8)
#define JPEG_DHTMEM44_DATA176           (0xFFU<<0)
#define JPEG_DHTMEM44_DATA176_0         (0x1U<<0)

// DHTMEM45 Configuration

