Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// DHTMEM59 Configuration

#define JPEG_DHTMEM59_DATA239           (0xFFU<<24)
#define JPEG_DHTMEM59_DATA239_0         (0x1U<<24)
#define JPEG_DHTMEM59_DATA238           (0xFFU<<16)
#define JPEG_DHTMEM59_DATA238_0         (0x1U<<16)
#define JPEG_DHTMEM59_DATA237           (0xFFU<<8)
#define JPEG_DHTMEM59_DATA237_0         (0x1U<<8)
#define JPEG_DHTMEM59_DATA236           (0xFFU<<0)
#define JPEG_DHTMEM59_DATA236_0         (0x1U<<0)

// DHTMEM60 Configuration

#define JPEG_DHTMEM60_DATA243           (0xFFU<<24)
#define JPEG_DHTMEM60_DATA243_0         (0x1U<<24)
#define JPEG_DHTMEM60_DATA242           (0xFFU<<16)
#define JPEG_DHTMEM60_DATA242_0         (0x1U<<16)
#define JPEG_DHTMEM60_DATA241           (0xFFU<<8)
#define JPEG_DHTMEM60_DATA241_0         (0x1U<<8)
#define JPEG_DHTMEM60_DATA240           (0xFFU<<0)
#define JPEG_DHTMEM60_DATA240_0         (0x1U<<0)

// DHTMEM61 Configuration

#define JPEG_DHTMEM61_DATA247           (0xFFU<<24)
#define JPEG_DHTMEM61_DATA247_0         (0x1U<<24)
#define JPEG_DHTMEM61_DATA246           (0xFFU<<16)
#define JPEG_DHTMEM61_DATA246_0         (0x1U<<16)
#define JPEG_DHTMEM61_DATA245           (0xFFU<<8)
#define JPEG_DHTMEM61_DATA245_0         (0x1U<<8)
#define JPEG_DHTMEM61_DATA244           (0xFFU<<0)
#define JPEG_DHTMEM61_DATA244_0         (0x1U<<0)

// DHTMEM62 Configuration

#define JPEG_DHTMEM62_DATA251           (0xFFU<<24)
#define JPEG_DHTMEM62_DATA251_0         (0x1U<<24)
#define JPEG_DHTMEM62_DATA250           (0xFFU<<16)
#define JPEG_DHTMEM62_DATA250_0         (0x1U<<16)
#define JPEG_DHTMEM62_DATA249           (0xFFU<<8)
#define JPEG_DHTMEM62_DATA249_0         (0x1U<<8)
#define JPEG_DHTMEM62_DATA248           (0xFFU<<0)
#define JPEG_DHTMEM62_DATA248_0         (0x1U<<0)

// DHTMEM63 Configuration

#define JPEG_DHTMEM63_DATA255           (0xFFU<<24)
#define JPEG_DHTMEM63_DATA255_0         (0x1U<<24)
#define JPEG_DHTMEM63_DATA254           (0xFFU<<16)
#define JPEG_DHTMEM63_DATA254_0         (0x1U<<16)
#define JPEG_DHTMEM63_DATA253           (0xFFU<<8)
#define JPEG_DHTMEM63_DATA253_0         (0x1U<<8)
#define JPEG_DHTMEM63_DATA252           (0xFFU<<0)
#define JPEG_DHTMEM63_DATA252_0         (0x1U<<0)

// DHTMEM64 Configuration

#define JPEG_DHTMEM64_DATA259           (0xFFU<<24)
#define JPEG_DHTMEM64_DATA259_0         (0x1U<<24)
#define JPEG_DHTMEM64_DATA258           (0xFFU<<16)
#define JPEG_DHTMEM64_DATA258_0         (0x1U<<16)
#define JPEG_DHTMEM64_DATA257           (0xFFU<<8)
#define JPEG_DHTMEM64_DATA257_0         (0x1U<<8)
#define JPEG_DHTMEM64_DATA256           (0xFFU<<0)
#define JPEG_DHTMEM64_DATA256_0         (0x1U<<0)

// DHTMEM65 Configuration

#define JPEG_DHTMEM65_DATA263           (0xFFU<<24)
#define JPEG_DHTMEM65_DATA263_0         (0x1U<<24)
#define JPEG_DHTMEM65_DATA262           (0xFFU<<16)
#define JPEG_DHTMEM65_DATA262_0         (0x1U<<16)
#define JPEG_DHTMEM65_DATA261           (0xFFU<<8)
#define JPEG_DHTMEM65_DATA261_0         (0x1U<<8)
#define JPEG_DHTMEM65_DATA260           (0xFFU<<0)
#define JPEG_DHTMEM65_DATA260_0         (0x1U<<0)

// DHTMEM66 Configuration

#define JPEG_DHTMEM66_DATA267           (0xFFU<<24)
#define JPEG_DHTMEM66_DATA267_0         (0x1U<<24)
#define JPEG_DHTMEM66_DATA266           (0xFFU<<16)
#define JPEG_DHTMEM66_DATA266_0         (0x1U<<16)
#define JPEG_DHTMEM66_DATA265           (0xFFU<<8)
#define JPEG_DHTMEM66_DATA265_0         (0x1U<<8)
#define JPEG_DHTMEM66_DATA264           (0xFFU<<0)
#define JPEG_DHTMEM66_DATA264_0         (0x1U<<0)

// DHTMEM67 Configuration

#define JPEG_DHTMEM67_DATA271           (0xFFU<<24)
#define JPEG_DHTMEM67_DATA271_0         (0x1U<<24)
#define JPEG_DHTMEM67_DATA270           (0xFFU<<16)
#define JPEG_DHTMEM67_DATA270_0         (0x1U<<16)
#define JPEG_DHTMEM67_DATA269           (0xFFU<<8)
#define JPEG_DHTMEM67_DATA269_0         (0x1U<<8)
#define JPEG_DHTMEM67_DATA268           (0xFFU<<0)
#define JPEG_DHTMEM67_DATA268_0         (0x1U<<0)

// DHTMEM68 Configuration

#define JPEG_DHTMEM68_DATA275           (0xFFU<<24)
#define JPEG_DHTMEM68_DATA275_0         (0x1U<<24)
#define JPEG_DHTMEM68_DATA274           (0xFFU<<16)
#define JPEG_DHTMEM68_DATA274_0         (0x1U<<16)
#define JPEG_DHTMEM68_DATA273           (0xFFU<<8)
#define JPEG_DHTMEM68_DATA273_0         (0x1U<<8)
#define JPEG_DHTMEM68_DATA272           (0xFFU<<0)
#define JPEG_DHTMEM68_DATA272_0         (0x1U<<0)

// DHTMEM69 Configuration

#define JPEG_DHTMEM69_DATA279           (0xFFU<<24)
#define JPEG_DHTMEM69_DATA279_0         (0x1U<<24)
#define JPEG_DHTMEM69_DATA278           (0xFFU<<16)
#define JPEG_DHTMEM69_DATA278_0         (0x1U<<16)
#define JPEG_DHTMEM69_DATA277           (0xFFU<<8)
#define JPEG_DHTMEM69_DATA277_0         (0x1U<<8)
#define JPEG_DHTMEM69_DATA276           (0xFFU<<0)
#define JPEG_DHTMEM69_DATA276_0         (0x1U<<0)

// DHTMEM70 Configuration

#define JPEG_DHTMEM70_DATA283           (0xFFU<<24)
#define JPEG_DHTMEM70_DATA283_0         (0x1U<<24)
#define JPEG_DHTMEM70_DATA282           (0xFFU<<16)
#define JPEG_DHTMEM70_DATA282_0         (0x1U<<16)
#define JPEG_DHTMEM70_DATA281           (0xFFU<<8)
#define JPEG_DHTMEM70_DATA281_0         (0x1U<<8)
#define JPEG_DHTMEM70_DATA280           (0xFFU<<0)
#define JPEG_DHTMEM70_DATA280_0         (0x1U<<0)

// DHTMEM71 Configuration

#define JPEG_DHTMEM71_DATA287           (0xFFU<<24)
#define JPEG_DHTMEM71_DATA287_0         (0x1U<<24)
#define JPEG_DHTMEM71_DATA286           (0xFFU<<16)
#define JPEG_DHTMEM71_DATA286_0         (0x1U<<16)
#define JPEG_DHTMEM71_DATA285           (0xFFU<<8)
#define JPEG_DHTMEM71_DATA285_0         (0x1U<<8)
#define JPEG_DHTMEM71_DATA284           (0xFFU<<0)
#define JPEG_DHTMEM71_DATA284_0         (0x1U<<0)

// DHTMEM72 Configuration

#define JPEG_DHTMEM72_DATA291           (0xFFU<<24)
#define JPEG_DHTMEM72_DATA291_0         (0x1U<<24)
#define JPEG_DHTMEM72_DATA290           (0xFFU<<16)
#define JPEG_DHTMEM72_DATA290_0         (0x1U<<16)
#define JPEG_DHTMEM72_DATA289           (0xFFU<<8)
#define JPEG_DHTMEM72_DATA289_0         (0x1U<<8)
#define JPEG_DHTMEM72_DATA288           (0xFFU<<0)
#define JPEG_DHTMEM72_DATA288_0         (0x1U<<0)

// DHTMEM73 Configuration

#define JPEG_DHTMEM73_DATA295           (0xFFU<<24)
#define JPEG_DHTMEM73_DATA295_0         (0x1U<<24)
#define JPEG_DHTMEM73_DATA294           (0xFFU<<16)
#define JPEG_DHTMEM73_DATA294_0         (0x1U<<16)
#define JPEG_DHTMEM73_DATA293           (0xFFU<<8)
#define JPEG_DHTMEM73_DATA293_0         (0x1U<<8)
#define JPEG_DHTMEM73_DATA292           (0xFFU<<0)
#define JPEG_DHTMEM73_DATA292_0         (0x1U<<0)

// DHTMEM74 Configuration

#define JPEG_DHTMEM74_DATA299           (0xFFU<<24)
#define JPEG_DHTMEM74_DATA299_0         (0x1U<<24)
#define JPEG_DHTMEM74_DATA298           (0xFFU<<16)
#define JPEG_DHTMEM74_DATA298_0         (0x1U<<16)
#define JPEG_DHTMEM74_DATA297           (0xFFU<<8)
#define JPEG_DHTMEM74_DATA297_0         (0x1U<<8)
#define JPEG_DHTMEM74_DATA296           (0xFFU<<0)
#define JPEG_DHTMEM74_DATA296_0         (0x1U<<0)

// DHTMEM75 Configuration

