Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
#define JPEG_DHTMEM75_DATA303           (0xFFU<<24)
#define JPEG_DHTMEM75_DATA303_0         (0x1U<<24)
#define JPEG_DHTMEM75_DATA302           (0xFFU<<16)
#define JPEG_DHTMEM75_DATA302_0         (0x1U<<16)
#define JPEG_DHTMEM75_DATA301           (0xFFU<<8)
#define JPEG_DHTMEM75_DATA301_0         (0x1U<<8)
#define JPEG_DHTMEM75_DATA300           (0xFFU<<0)
#define JPEG_DHTMEM75_DATA300_0         (0x1U<<0)

// DHTMEM76 Configuration

#define JPEG_DHTMEM76_DATA307           (0xFFU<<24)
#define JPEG_DHTMEM76_DATA307_0         (0x1U<<24)
#define JPEG_DHTMEM76_DATA306           (0xFFU<<16)
#define JPEG_DHTMEM76_DATA306_0         (0x1U<<16)
#define JPEG_DHTMEM76_DATA305           (0xFFU<<8)
#define JPEG_DHTMEM76_DATA305_0         (0x1U<<8)
#define JPEG_DHTMEM76_DATA304           (0xFFU<<0)
#define JPEG_DHTMEM76_DATA304_0         (0x1U<<0)

// DHTMEM77 Configuration

#define JPEG_DHTMEM77_DATA311           (0xFFU<<24)
#define JPEG_DHTMEM77_DATA311_0         (0x1U<<24)
#define JPEG_DHTMEM77_DATA310           (0xFFU<<16)
#define JPEG_DHTMEM77_DATA310_0         (0x1U<<16)
#define JPEG_DHTMEM77_DATA309           (0xFFU<<8)
#define JPEG_DHTMEM77_DATA309_0         (0x1U<<8)
#define JPEG_DHTMEM77_DATA308           (0xFFU<<0)
#define JPEG_DHTMEM77_DATA308_0         (0x1U<<0)

// DHTMEM78 Configuration

#define JPEG_DHTMEM78_DATA315           (0xFFU<<24)
#define JPEG_DHTMEM78_DATA315_0         (0x1U<<24)
#define JPEG_DHTMEM78_DATA314           (0xFFU<<16)
#define JPEG_DHTMEM78_DATA314_0         (0x1U<<16)
#define JPEG_DHTMEM78_DATA313           (0xFFU<<8)
#define JPEG_DHTMEM78_DATA313_0         (0x1U<<8)
#define JPEG_DHTMEM78_DATA312           (0xFFU<<0)
#define JPEG_DHTMEM78_DATA312_0         (0x1U<<0)

// DHTMEM79 Configuration

#define JPEG_DHTMEM79_DATA319           (0xFFU<<24)
#define JPEG_DHTMEM79_DATA319_0         (0x1U<<24)
#define JPEG_DHTMEM79_DATA318           (0xFFU<<16)
#define JPEG_DHTMEM79_DATA318_0         (0x1U<<16)
#define JPEG_DHTMEM79_DATA317           (0xFFU<<8)
#define JPEG_DHTMEM79_DATA317_0         (0x1U<<8)
#define JPEG_DHTMEM79_DATA316           (0xFFU<<0)
#define JPEG_DHTMEM79_DATA316_0         (0x1U<<0)

// DHTMEM80 Configuration

#define JPEG_DHTMEM80_DATA323           (0xFFU<<24)
#define JPEG_DHTMEM80_DATA323_0         (0x1U<<24)
#define JPEG_DHTMEM80_DATA322           (0xFFU<<16)
#define JPEG_DHTMEM80_DATA322_0         (0x1U<<16)
#define JPEG_DHTMEM80_DATA321           (0xFFU<<8)
#define JPEG_DHTMEM80_DATA321_0         (0x1U<<8)
#define JPEG_DHTMEM80_DATA320           (0xFFU<<0)
#define JPEG_DHTMEM80_DATA320_0         (0x1U<<0)

// DHTMEM81 Configuration

#define JPEG_DHTMEM81_DATA327           (0xFFU<<24)
#define JPEG_DHTMEM81_DATA327_0         (0x1U<<24)
#define JPEG_DHTMEM81_DATA326           (0xFFU<<16)
#define JPEG_DHTMEM81_DATA326_0         (0x1U<<16)
#define JPEG_DHTMEM81_DATA325           (0xFFU<<8)
#define JPEG_DHTMEM81_DATA325_0         (0x1U<<8)
#define JPEG_DHTMEM81_DATA324           (0xFFU<<0)
#define JPEG_DHTMEM81_DATA324_0         (0x1U<<0)

// DHTMEM82 Configuration

#define JPEG_DHTMEM82_DATA331           (0xFFU<<24)
#define JPEG_DHTMEM82_DATA331_0         (0x1U<<24)
#define JPEG_DHTMEM82_DATA330           (0xFFU<<16)
#define JPEG_DHTMEM82_DATA330_0         (0x1U<<16)
#define JPEG_DHTMEM82_DATA329           (0xFFU<<8)
#define JPEG_DHTMEM82_DATA329_0         (0x1U<<8)
#define JPEG_DHTMEM82_DATA328           (0xFFU<<0)
#define JPEG_DHTMEM82_DATA328_0         (0x1U<<0)

// DHTMEM83 Configuration

#define JPEG_DHTMEM83_DATA335           (0xFFU<<24)
#define JPEG_DHTMEM83_DATA335_0         (0x1U<<24)
#define JPEG_DHTMEM83_DATA334           (0xFFU<<16)
#define JPEG_DHTMEM83_DATA334_0         (0x1U<<16)
#define JPEG_DHTMEM83_DATA333           (0xFFU<<8)
#define JPEG_DHTMEM83_DATA333_0         (0x1U<<8)
#define JPEG_DHTMEM83_DATA332           (0xFFU<<0)
#define JPEG_DHTMEM83_DATA332_0         (0x1U<<0)

// DHTMEM84 Configuration

#define JPEG_DHTMEM84_DATA339           (0xFFU<<24)
#define JPEG_DHTMEM84_DATA339_0         (0x1U<<24)
#define JPEG_DHTMEM84_DATA338           (0xFFU<<16)
#define JPEG_DHTMEM84_DATA338_0         (0x1U<<16)
#define JPEG_DHTMEM84_DATA337           (0xFFU<<8)
#define JPEG_DHTMEM84_DATA337_0         (0x1U<<8)
#define JPEG_DHTMEM84_DATA336           (0xFFU<<0)
#define JPEG_DHTMEM84_DATA336_0         (0x1U<<0)

// DHTMEM85 Configuration

#define JPEG_DHTMEM85_DATA343           (0xFFU<<24)
#define JPEG_DHTMEM85_DATA343_0         (0x1U<<24)
#define JPEG_DHTMEM85_DATA342           (0xFFU<<16)
#define JPEG_DHTMEM85_DATA342_0         (0x1U<<16)
#define JPEG_DHTMEM85_DATA341           (0xFFU<<8)
#define JPEG_DHTMEM85_DATA341_0         (0x1U<<8)
#define JPEG_DHTMEM85_DATA340           (0xFFU<<0)
#define JPEG_DHTMEM85_DATA340_0         (0x1U<<0)

// DHTMEM86 Configuration

#define JPEG_DHTMEM86_DATA347           (0xFFU<<24)
#define JPEG_DHTMEM86_DATA347_0         (0x1U<<24)
#define JPEG_DHTMEM86_DATA346           (0xFFU<<16)
#define JPEG_DHTMEM86_DATA346_0         (0x1U<<16)
#define JPEG_DHTMEM86_DATA345           (0xFFU<<8)
#define JPEG_DHTMEM86_DATA345_0         (0x1U<<8)
#define JPEG_DHTMEM86_DATA344           (0xFFU<<0)
#define JPEG_DHTMEM86_DATA344_0         (0x1U<<0)

// DHTMEM87 Configuration

#define JPEG_DHTMEM87_DATA351           (0xFFU<<24)
#define JPEG_DHTMEM87_DATA351_0         (0x1U<<24)
#define JPEG_DHTMEM87_DATA350           (0xFFU<<16)
#define JPEG_DHTMEM87_DATA350_0         (0x1U<<16)
#define JPEG_DHTMEM87_DATA349           (0xFFU<<8)
#define JPEG_DHTMEM87_DATA349_0         (0x1U<<8)
#define JPEG_DHTMEM87_DATA348           (0xFFU<<0)
#define JPEG_DHTMEM87_DATA348_0         (0x1U<<0)

// DHTMEM88 Configuration

#define JPEG_DHTMEM88_DATA355           (0xFFU<<24)
#define JPEG_DHTMEM88_DATA355_0         (0x1U<<24)
#define JPEG_DHTMEM88_DATA354           (0xFFU<<16)
#define JPEG_DHTMEM88_DATA354_0         (0x1U<<16)
#define JPEG_DHTMEM88_DATA353           (0xFFU<<8)
#define JPEG_DHTMEM88_DATA353_0         (0x1U<<8)
#define JPEG_DHTMEM88_DATA352           (0xFFU<<0)
#define JPEG_DHTMEM88_DATA352_0         (0x1U<<0)

// DHTMEM89 Configuration

#define JPEG_DHTMEM89_DATA359           (0xFFU<<24)
#define JPEG_DHTMEM89_DATA359_0         (0x1U<<24)
#define JPEG_DHTMEM89_DATA358           (0xFFU<<16)
#define JPEG_DHTMEM89_DATA358_0         (0x1U<<16)
#define JPEG_DHTMEM89_DATA357           (0xFFU<<8)
#define JPEG_DHTMEM89_DATA357_0         (0x1U<<8)
#define JPEG_DHTMEM89_DATA356           (0xFFU<<0)
#define JPEG_DHTMEM89_DATA356_0         (0x1U<<0)

// DHTMEM90 Configuration

#define JPEG_DHTMEM90_DATA363           (0xFFU<<24)
#define JPEG_DHTMEM90_DATA363_0         (0x1U<<24)
#define JPEG_DHTMEM90_DATA362           (0xFFU<<16)
#define JPEG_DHTMEM90_DATA362_0         (0x1U<<16)
#define JPEG_DHTMEM90_DATA361           (0xFFU<<8)
#define JPEG_DHTMEM90_DATA361_0         (0x1U<<8)
#define JPEG_DHTMEM90_DATA360           (0xFFU<<0)
#define JPEG_DHTMEM90_DATA360_0         (0x1U<<0)

// DHTMEM91 Configuration

