Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
#define JPEG_DHTMEM91_DATA367           (0xFFU<<24)
#define JPEG_DHTMEM91_DATA367_0         (0x1U<<24)
#define JPEG_DHTMEM91_DATA366           (0xFFU<<16)
#define JPEG_DHTMEM91_DATA366_0         (0x1U<<16)
#define JPEG_DHTMEM91_DATA365           (0xFFU<<8)
#define JPEG_DHTMEM91_DATA365_0         (0x1U<<8)
#define JPEG_DHTMEM91_DATA364           (0xFFU<<0)
#define JPEG_DHTMEM91_DATA364_0         (0x1U<<0)

// DHTMEM92 Configuration

#define JPEG_DHTMEM92_DATA371           (0xFFU<<24)
#define JPEG_DHTMEM92_DATA371_0         (0x1U<<24)
#define JPEG_DHTMEM92_DATA370           (0xFFU<<16)
#define JPEG_DHTMEM92_DATA370_0         (0x1U<<16)
#define JPEG_DHTMEM92_DATA369           (0xFFU<<8)
#define JPEG_DHTMEM92_DATA369_0         (0x1U<<8)
#define JPEG_DHTMEM92_DATA368           (0xFFU<<0)
#define JPEG_DHTMEM92_DATA368_0         (0x1U<<0)

// DHTMEM93 Configuration

#define JPEG_DHTMEM93_DATA375           (0xFFU<<24)
#define JPEG_DHTMEM93_DATA375_0         (0x1U<<24)
#define JPEG_DHTMEM93_DATA374           (0xFFU<<16)
#define JPEG_DHTMEM93_DATA374_0         (0x1U<<16)
#define JPEG_DHTMEM93_DATA373           (0xFFU<<8)
#define JPEG_DHTMEM93_DATA373_0         (0x1U<<8)
#define JPEG_DHTMEM93_DATA372           (0xFFU<<0)
#define JPEG_DHTMEM93_DATA372_0         (0x1U<<0)

// DHTMEM94 Configuration

#define JPEG_DHTMEM94_DATA379           (0xFFU<<24)
#define JPEG_DHTMEM94_DATA379_0         (0x1U<<24)
#define JPEG_DHTMEM94_DATA378           (0xFFU<<16)
#define JPEG_DHTMEM94_DATA378_0         (0x1U<<16)
#define JPEG_DHTMEM94_DATA377           (0xFFU<<8)
#define JPEG_DHTMEM94_DATA377_0         (0x1U<<8)
#define JPEG_DHTMEM94_DATA376           (0xFFU<<0)
#define JPEG_DHTMEM94_DATA376_0         (0x1U<<0)

// DHTMEM95 Configuration

#define JPEG_DHTMEM95_DATA383           (0xFFU<<24)
#define JPEG_DHTMEM95_DATA383_0         (0x1U<<24)
#define JPEG_DHTMEM95_DATA382           (0xFFU<<16)
#define JPEG_DHTMEM95_DATA382_0         (0x1U<<16)
#define JPEG_DHTMEM95_DATA381           (0xFFU<<8)
#define JPEG_DHTMEM95_DATA381_0         (0x1U<<8)
#define JPEG_DHTMEM95_DATA380           (0xFFU<<0)
#define JPEG_DHTMEM95_DATA380_0         (0x1U<<0)

// DHTMEM96 Configuration

#define JPEG_DHTMEM96_DATA387           (0xFFU<<24)
#define JPEG_DHTMEM96_DATA387_0         (0x1U<<24)
#define JPEG_DHTMEM96_DATA386           (0xFFU<<16)
#define JPEG_DHTMEM96_DATA386_0         (0x1U<<16)
#define JPEG_DHTMEM96_DATA385           (0xFFU<<8)
#define JPEG_DHTMEM96_DATA385_0         (0x1U<<8)
#define JPEG_DHTMEM96_DATA384           (0xFFU<<0)
#define JPEG_DHTMEM96_DATA384_0         (0x1U<<0)

// DHTMEM97 Configuration

#define JPEG_DHTMEM97_DATA391           (0xFFU<<24)
#define JPEG_DHTMEM97_DATA391_0         (0x1U<<24)
#define JPEG_DHTMEM97_DATA390           (0xFFU<<16)
#define JPEG_DHTMEM97_DATA390_0         (0x1U<<16)
#define JPEG_DHTMEM97_DATA389           (0xFFU<<8)
#define JPEG_DHTMEM97_DATA389_0         (0x1U<<8)
#define JPEG_DHTMEM97_DATA388           (0xFFU<<0)
#define JPEG_DHTMEM97_DATA388_0         (0x1U<<0)

// DHTMEM98 Configuration

#define JPEG_DHTMEM98_DATA395           (0xFFU<<24)
#define JPEG_DHTMEM98_DATA395_0         (0x1U<<24)
#define JPEG_DHTMEM98_DATA394           (0xFFU<<16)
#define JPEG_DHTMEM98_DATA394_0         (0x1U<<16)
#define JPEG_DHTMEM98_DATA393           (0xFFU<<8)
#define JPEG_DHTMEM98_DATA393_0         (0x1U<<8)
#define JPEG_DHTMEM98_DATA392           (0xFFU<<0)
#define JPEG_DHTMEM98_DATA392_0         (0x1U<<0)

// DHTMEM99 Configuration

#define JPEG_DHTMEM99_DATA399           (0xFFU<<24)
#define JPEG_DHTMEM99_DATA399_0         (0x1U<<24)
#define JPEG_DHTMEM99_DATA398           (0xFFU<<16)
#define JPEG_DHTMEM99_DATA398_0         (0x1U<<16)
#define JPEG_DHTMEM99_DATA397           (0xFFU<<8)
#define JPEG_DHTMEM99_DATA397_0         (0x1U<<8)
#define JPEG_DHTMEM99_DATA396           (0xFFU<<0)
#define JPEG_DHTMEM99_DATA396_0         (0x1U<<0)

// DHTMEM100 Configuration

#define JPEG_DHTMEM100_DATA403          (0xFFU<<24)
#define JPEG_DHTMEM100_DATA403_0        (0x1U<<24)
#define JPEG_DHTMEM100_DATA402          (0xFFU<<16)
#define JPEG_DHTMEM100_DATA402_0        (0x1U<<16)
#define JPEG_DHTMEM100_DATA401          (0xFFU<<8)
#define JPEG_DHTMEM100_DATA401_0        (0x1U<<8)
#define JPEG_DHTMEM100_DATA400          (0xFFU<<0)
#define JPEG_DHTMEM100_DATA400_0        (0x1U<<0)

// DHTMEM101 Configuration

#define JPEG_DHTMEM101_DATA407          (0xFFU<<24)
#define JPEG_DHTMEM101_DATA407_0        (0x1U<<24)
#define JPEG_DHTMEM101_DATA406          (0xFFU<<16)
#define JPEG_DHTMEM101_DATA406_0        (0x1U<<16)
#define JPEG_DHTMEM101_DATA405          (0xFFU<<8)
#define JPEG_DHTMEM101_DATA405_0        (0x1U<<8)
#define JPEG_DHTMEM101_DATA404          (0xFFU<<0)
#define JPEG_DHTMEM101_DATA404_0        (0x1U<<0)

// DHTMEM102 Configuration

#define JPEG_DHTMEM102_DATA411          (0xFFU<<24)
#define JPEG_DHTMEM102_DATA411_0        (0x1U<<24)
#define JPEG_DHTMEM102_DATA410          (0xFFU<<16)
#define JPEG_DHTMEM102_DATA410_0        (0x1U<<16)
#define JPEG_DHTMEM102_DATA409          (0xFFU<<8)
#define JPEG_DHTMEM102_DATA409_0        (0x1U<<8)
#define JPEG_DHTMEM102_DATA408          (0xFFU<<0)
#define JPEG_DHTMEM102_DATA408_0        (0x1U<<0)

// HUFFENC_AC0_0 Configuration

#define JPEG_HUFFENC_AC0_0_HLEN1        (0xFU<<24)
#define JPEG_HUFFENC_AC0_0_HLEN1_0      (0x1U<<24)
#define JPEG_HUFFENC_AC0_0_HCODE1       (0xFFU<<16)
#define JPEG_HUFFENC_AC0_0_HCODE1_0     (0x1U<<16)
#define JPEG_HUFFENC_AC0_0_HLEN0        (0xFU<<8)
#define JPEG_HUFFENC_AC0_0_HLEN0_0      (0x1U<<8)
#define JPEG_HUFFENC_AC0_0_HCODE0       (0xFFU<<0)
#define JPEG_HUFFENC_AC0_0_HCODE0_0     (0x1U<<0)

// HUFFENC_AC0_1 Configuration

#define JPEG_HUFFENC_AC0_1_HLEN3        (0xFU<<24)
#define JPEG_HUFFENC_AC0_1_HLEN3_0      (0x1U<<24)
#define JPEG_HUFFENC_AC0_1_HCODE3       (0xFFU<<16)
#define JPEG_HUFFENC_AC0_1_HCODE3_0     (0x1U<<16)
#define JPEG_HUFFENC_AC0_1_HLEN2        (0xFU<<8)
#define JPEG_HUFFENC_AC0_1_HLEN2_0      (0x1U<<8)
#define JPEG_HUFFENC_AC0_1_HCODE2       (0xFFU<<0)
#define JPEG_HUFFENC_AC0_1_HCODE2_0     (0x1U<<0)

