Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC0_2 Configuration

#define JPEG_HUFFENC_AC0_2_HLEN5        (0xFU<<24)
#define JPEG_HUFFENC_AC0_2_HLEN5_0      (0x1U<<24)
#define JPEG_HUFFENC_AC0_2_HCODE5       (0xFFU<<16)
#define JPEG_HUFFENC_AC0_2_HCODE5_0     (0x1U<<16)
#define JPEG_HUFFENC_AC0_2_HLEN4        (0xFU<<8)
#define JPEG_HUFFENC_AC0_2_HLEN4_0      (0x1U<<8)
#define JPEG_HUFFENC_AC0_2_HCODE4       (0xFFU<<0)
#define JPEG_HUFFENC_AC0_2_HCODE4_0     (0x1U<<0)

// HUFFENC_AC0_3 Configuration

#define JPEG_HUFFENC_AC0_3_HLEN7        (0xFU<<24)
#define JPEG_HUFFENC_AC0_3_HLEN7_0      (0x1U<<24)
#define JPEG_HUFFENC_AC0_3_HCODE7       (0xFFU<<16)
#define JPEG_HUFFENC_AC0_3_HCODE7_0     (0x1U<<16)
#define JPEG_HUFFENC_AC0_3_HLEN6        (0xFU<<8)
#define JPEG_HUFFENC_AC0_3_HLEN6_0      (0x1U<<8)
#define JPEG_HUFFENC_AC0_3_HCODE6       (0xFFU<<0)
#define JPEG_HUFFENC_AC0_3_HCODE6_0     (0x1U<<0)

// HUFFENC_AC0_4 Configuration

#define JPEG_HUFFENC_AC0_4_HLEN9        (0xFU<<24)
#define JPEG_HUFFENC_AC0_4_HLEN9_0      (0x1U<<24)
#define JPEG_HUFFENC_AC0_4_HCODE9       (0xFFU<<16)
#define JPEG_HUFFENC_AC0_4_HCODE9_0     (0x1U<<16)
#define JPEG_HUFFENC_AC0_4_HLEN8        (0xFU<<8)
#define JPEG_HUFFENC_AC0_4_HLEN8_0      (0x1U<<8)
#define JPEG_HUFFENC_AC0_4_HCODE8       (0xFFU<<0)
#define JPEG_HUFFENC_AC0_4_HCODE8_0     (0x1U<<0)

// HUFFENC_AC0_5 Configuration

#define JPEG_HUFFENC_AC0_5_HLEN11       (0xFU<<24)
#define JPEG_HUFFENC_AC0_5_HLEN11_0     (0x1U<<24)
#define JPEG_HUFFENC_AC0_5_HCODE11      (0xFFU<<16)
#define JPEG_HUFFENC_AC0_5_HCODE11_0    (0x1U<<16)
#define JPEG_HUFFENC_AC0_5_HLEN10       (0xFU<<8)
#define JPEG_HUFFENC_AC0_5_HLEN10_0     (0x1U<<8)
#define JPEG_HUFFENC_AC0_5_HCODE10      (0xFFU<<0)
#define JPEG_HUFFENC_AC0_5_HCODE10_0    (0x1U<<0)

// HUFFENC_AC0_6 Configuration

#define JPEG_HUFFENC_AC0_6_HLEN13       (0xFU<<24)
#define JPEG_HUFFENC_AC0_6_HLEN13_0     (0x1U<<24)
#define JPEG_HUFFENC_AC0_6_HCODE13      (0xFFU<<16)
#define JPEG_HUFFENC_AC0_6_HCODE13_0    (0x1U<<16)
#define JPEG_HUFFENC_AC0_6_HLEN12       (0xFU<<8)
#define JPEG_HUFFENC_AC0_6_HLEN12_0     (0x1U<<8)
#define JPEG_HUFFENC_AC0_6_HCODE12      (0xFFU<<0)
#define JPEG_HUFFENC_AC0_6_HCODE12_0    (0x1U<<0)

// HUFFENC_AC0_7 Configuration

#define JPEG_HUFFENC_AC0_7_HLEN15       (0xFU<<24)
#define JPEG_HUFFENC_AC0_7_HLEN15_0     (0x1U<<24)
#define JPEG_HUFFENC_AC0_7_HCODE15      (0xFFU<<16)
#define JPEG_HUFFENC_AC0_7_HCODE15_0    (0x1U<<16)
#define JPEG_HUFFENC_AC0_7_HLEN14       (0xFU<<8)
#define JPEG_HUFFENC_AC0_7_HLEN14_0     (0x1U<<8)
#define JPEG_HUFFENC_AC0_7_HCODE14      (0xFFU<<0)
#define JPEG_HUFFENC_AC0_7_HCODE14_0    (0x1U<<0)

// HUFFENC_AC0_8 Configuration

#define JPEG_HUFFENC_AC0_8_HLEN17       (0xFU<<24)
#define JPEG_HUFFENC_AC0_8_HLEN17_0     (0x1U<<24)
#define JPEG_HUFFENC_AC0_8_HCODE17      (0xFFU<<16)
#define JPEG_HUFFENC_AC0_8_HCODE17_0    (0x1U<<16)
#define JPEG_HUFFENC_AC0_8_HLEN16       (0xFU<<8)
#define JPEG_HUFFENC_AC0_8_HLEN16_0     (0x1U<<8)
#define JPEG_HUFFENC_AC0_8_HCODE16      (0xFFU<<0)
#define JPEG_HUFFENC_AC0_8_HCODE16_0    (0x1U<<0)

// HUFFENC_AC0_9 Configuration

#define JPEG_HUFFENC_AC0_9_HLEN19       (0xFU<<24)
#define JPEG_HUFFENC_AC0_9_HLEN19_0     (0x1U<<24)
#define JPEG_HUFFENC_AC0_9_HCODE19      (0xFFU<<16)
#define JPEG_HUFFENC_AC0_9_HCODE19_0    (0x1U<<16)
#define JPEG_HUFFENC_AC0_9_HLEN18       (0xFU<<8)
#define JPEG_HUFFENC_AC0_9_HLEN18_0     (0x1U<<8)
#define JPEG_HUFFENC_AC0_9_HCODE18      (0xFFU<<0)
#define JPEG_HUFFENC_AC0_9_HCODE18_0    (0x1U<<0)

// HUFFENC_AC0_10 Configuration

#define JPEG_HUFFENC_AC0_10_HLEN21      (0xFU<<24)
#define JPEG_HUFFENC_AC0_10_HLEN21_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_10_HCODE21     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_10_HCODE21_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_10_HLEN20      (0xFU<<8)
#define JPEG_HUFFENC_AC0_10_HLEN20_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_10_HCODE20     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_10_HCODE20_0   (0x1U<<0)

// HUFFENC_AC0_11 Configuration

#define JPEG_HUFFENC_AC0_11_HLEN23      (0xFU<<24)
#define JPEG_HUFFENC_AC0_11_HLEN23_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_11_HCODE23     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_11_HCODE23_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_11_HLEN22      (0xFU<<8)
#define JPEG_HUFFENC_AC0_11_HLEN22_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_11_HCODE22     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_11_HCODE22_0   (0x1U<<0)

// HUFFENC_AC0_12 Configuration

#define JPEG_HUFFENC_AC0_12_HLEN25      (0xFU<<24)
#define JPEG_HUFFENC_AC0_12_HLEN25_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_12_HCODE25     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_12_HCODE25_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_12_HLEN24      (0xFU<<8)
#define JPEG_HUFFENC_AC0_12_HLEN24_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_12_HCODE24     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_12_HCODE24_0   (0x1U<<0)

// HUFFENC_AC0_13 Configuration

#define JPEG_HUFFENC_AC0_13_HLEN27      (0xFU<<24)
#define JPEG_HUFFENC_AC0_13_HLEN27_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_13_HCODE27     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_13_HCODE27_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_13_HLEN26      (0xFU<<8)
#define JPEG_HUFFENC_AC0_13_HLEN26_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_13_HCODE26     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_13_HCODE26_0   (0x1U<<0)

// HUFFENC_AC0_14 Configuration

#define JPEG_HUFFENC_AC0_14_HLEN29      (0xFU<<24)
#define JPEG_HUFFENC_AC0_14_HLEN29_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_14_HCODE29     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_14_HCODE29_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_14_HLEN28      (0xFU<<8)
#define JPEG_HUFFENC_AC0_14_HLEN28_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_14_HCODE28     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_14_HCODE28_0   (0x1U<<0)

// HUFFENC_AC0_15 Configuration

#define JPEG_HUFFENC_AC0_15_HLEN31      (0xFU<<24)
#define JPEG_HUFFENC_AC0_15_HLEN31_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_15_HCODE31     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_15_HCODE31_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_15_HLEN30      (0xFU<<8)
#define JPEG_HUFFENC_AC0_15_HLEN30_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_15_HCODE30     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_15_HCODE30_0   (0x1U<<0)

