Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC0_16 Configuration

#define JPEG_HUFFENC_AC0_16_HLEN33      (0xFU<<24)
#define JPEG_HUFFENC_AC0_16_HLEN33_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_16_HCODE33     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_16_HCODE33_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_16_HLEN32      (0xFU<<8)
#define JPEG_HUFFENC_AC0_16_HLEN32_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_16_HCODE32     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_16_HCODE32_0   (0x1U<<0)

// HUFFENC_AC0_17 Configuration

#define JPEG_HUFFENC_AC0_17_HLEN35      (0xFU<<24)
#define JPEG_HUFFENC_AC0_17_HLEN35_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_17_HCODE35     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_17_HCODE35_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_17_HLEN34      (0xFU<<8)
#define JPEG_HUFFENC_AC0_17_HLEN34_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_17_HCODE34     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_17_HCODE34_0   (0x1U<<0)

// HUFFENC_AC0_18 Configuration

#define JPEG_HUFFENC_AC0_18_HLEN37      (0xFU<<24)
#define JPEG_HUFFENC_AC0_18_HLEN37_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_18_HCODE37     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_18_HCODE37_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_18_HLEN36      (0xFU<<8)
#define JPEG_HUFFENC_AC0_18_HLEN36_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_18_HCODE36     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_18_HCODE36_0   (0x1U<<0)

// HUFFENC_AC0_19 Configuration

#define JPEG_HUFFENC_AC0_19_HLEN39      (0xFU<<24)
#define JPEG_HUFFENC_AC0_19_HLEN39_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_19_HCODE39     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_19_HCODE39_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_19_HLEN38      (0xFU<<8)
#define JPEG_HUFFENC_AC0_19_HLEN38_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_19_HCODE38     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_19_HCODE38_0   (0x1U<<0)

// HUFFENC_AC0_20 Configuration

#define JPEG_HUFFENC_AC0_20_HLEN41      (0xFU<<24)
#define JPEG_HUFFENC_AC0_20_HLEN41_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_20_HCODE41     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_20_HCODE41_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_20_HLEN40      (0xFU<<8)
#define JPEG_HUFFENC_AC0_20_HLEN40_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_20_HCODE40     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_20_HCODE40_0   (0x1U<<0)

// HUFFENC_AC0_21 Configuration

#define JPEG_HUFFENC_AC0_21_HLEN43      (0xFU<<24)
#define JPEG_HUFFENC_AC0_21_HLEN43_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_21_HCODE43     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_21_HCODE43_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_21_HLEN42      (0xFU<<8)
#define JPEG_HUFFENC_AC0_21_HLEN42_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_21_HCODE42     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_21_HCODE42_0   (0x1U<<0)

// HUFFENC_AC0_22 Configuration

#define JPEG_HUFFENC_AC0_22_HLEN45      (0xFU<<24)
#define JPEG_HUFFENC_AC0_22_HLEN45_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_22_HCODE45     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_22_HCODE45_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_22_HLEN44      (0xFU<<8)
#define JPEG_HUFFENC_AC0_22_HLEN44_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_22_HCODE44     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_22_HCODE44_0   (0x1U<<0)

// HUFFENC_AC0_23 Configuration

#define JPEG_HUFFENC_AC0_23_HLEN47      (0xFU<<24)
#define JPEG_HUFFENC_AC0_23_HLEN47_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_23_HCODE47     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_23_HCODE47_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_23_HLEN46      (0xFU<<8)
#define JPEG_HUFFENC_AC0_23_HLEN46_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_23_HCODE46     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_23_HCODE46_0   (0x1U<<0)

// HUFFENC_AC0_24 Configuration

#define JPEG_HUFFENC_AC0_24_HLEN49      (0xFU<<24)
#define JPEG_HUFFENC_AC0_24_HLEN49_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_24_HCODE49     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_24_HCODE49_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_24_HLEN48      (0xFU<<8)
#define JPEG_HUFFENC_AC0_24_HLEN48_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_24_HCODE48     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_24_HCODE48_0   (0x1U<<0)

// HUFFENC_AC0_25 Configuration

#define JPEG_HUFFENC_AC0_25_HLEN51      (0xFU<<24)
#define JPEG_HUFFENC_AC0_25_HLEN51_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_25_HCODE51     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_25_HCODE51_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_25_HLEN50      (0xFU<<8)
#define JPEG_HUFFENC_AC0_25_HLEN50_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_25_HCODE50     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_25_HCODE50_0   (0x1U<<0)

// HUFFENC_AC0_26 Configuration

#define JPEG_HUFFENC_AC0_26_HLEN53      (0xFU<<24)
#define JPEG_HUFFENC_AC0_26_HLEN53_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_26_HCODE53     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_26_HCODE53_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_26_HLEN52      (0xFU<<8)
#define JPEG_HUFFENC_AC0_26_HLEN52_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_26_HCODE52     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_26_HCODE52_0   (0x1U<<0)

// HUFFENC_AC0_27 Configuration

#define JPEG_HUFFENC_AC0_27_HLEN55      (0xFU<<24)
#define JPEG_HUFFENC_AC0_27_HLEN55_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_27_HCODE55     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_27_HCODE55_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_27_HLEN54      (0xFU<<8)
#define JPEG_HUFFENC_AC0_27_HLEN54_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_27_HCODE54     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_27_HCODE54_0   (0x1U<<0)

// HUFFENC_AC0_28 Configuration

#define JPEG_HUFFENC_AC0_28_HLEN57      (0xFU<<24)
#define JPEG_HUFFENC_AC0_28_HLEN57_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_28_HCODE57     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_28_HCODE57_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_28_HLEN56      (0xFU<<8)
#define JPEG_HUFFENC_AC0_28_HLEN56_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_28_HCODE56     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_28_HCODE56_0   (0x1U<<0)

// HUFFENC_AC0_29 Configuration

#define JPEG_HUFFENC_AC0_29_HLEN59      (0xFU<<24)
#define JPEG_HUFFENC_AC0_29_HLEN59_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_29_HCODE59     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_29_HCODE59_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_29_HLEN58      (0xFU<<8)
#define JPEG_HUFFENC_AC0_29_HLEN58_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_29_HCODE58     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_29_HCODE58_0   (0x1U<<0)

// HUFFENC_AC0_30 Configuration

#define JPEG_HUFFENC_AC0_30_HLEN61      (0xFU<<24)
#define JPEG_HUFFENC_AC0_30_HLEN61_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_30_HCODE61     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_30_HCODE61_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_30_HLEN60      (0xFU<<8)
#define JPEG_HUFFENC_AC0_30_HLEN60_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_30_HCODE60     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_30_HCODE60_0   (0x1U<<0)

// HUFFENC_AC0_31 Configuration

#define JPEG_HUFFENC_AC0_31_HLEN63      (0xFU<<24)
#define JPEG_HUFFENC_AC0_31_HLEN63_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_31_HCODE63     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_31_HCODE63_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_31_HLEN62      (0xFU<<8)
#define JPEG_HUFFENC_AC0_31_HLEN62_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_31_HCODE62     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_31_HCODE62_0   (0x1U<<0)

