Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC0_32 Configuration

#define JPEG_HUFFENC_AC0_32_HLEN65      (0xFU<<24)
#define JPEG_HUFFENC_AC0_32_HLEN65_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_32_HCODE65     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_32_HCODE65_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_32_HLEN64      (0xFU<<8)
#define JPEG_HUFFENC_AC0_32_HLEN64_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_32_HCODE64     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_32_HCODE64_0   (0x1U<<0)

// HUFFENC_AC0_33 Configuration

#define JPEG_HUFFENC_AC0_33_HLEN67      (0xFU<<24)
#define JPEG_HUFFENC_AC0_33_HLEN67_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_33_HCODE67     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_33_HCODE67_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_33_HLEN66      (0xFU<<8)
#define JPEG_HUFFENC_AC0_33_HLEN66_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_33_HCODE66     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_33_HCODE66_0   (0x1U<<0)

// HUFFENC_AC0_34 Configuration

#define JPEG_HUFFENC_AC0_34_HLEN69      (0xFU<<24)
#define JPEG_HUFFENC_AC0_34_HLEN69_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_34_HCODE69     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_34_HCODE69_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_34_HLEN68      (0xFU<<8)
#define JPEG_HUFFENC_AC0_34_HLEN68_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_34_HCODE68     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_34_HCODE68_0   (0x1U<<0)

// HUFFENC_AC0_35 Configuration

#define JPEG_HUFFENC_AC0_35_HLEN71      (0xFU<<24)
#define JPEG_HUFFENC_AC0_35_HLEN71_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_35_HCODE71     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_35_HCODE71_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_35_HLEN70      (0xFU<<8)
#define JPEG_HUFFENC_AC0_35_HLEN70_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_35_HCODE70     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_35_HCODE70_0   (0x1U<<0)

// HUFFENC_AC0_36 Configuration

#define JPEG_HUFFENC_AC0_36_HLEN73      (0xFU<<24)
#define JPEG_HUFFENC_AC0_36_HLEN73_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_36_HCODE73     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_36_HCODE73_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_36_HLEN72      (0xFU<<8)
#define JPEG_HUFFENC_AC0_36_HLEN72_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_36_HCODE72     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_36_HCODE72_0   (0x1U<<0)

// HUFFENC_AC0_37 Configuration

#define JPEG_HUFFENC_AC0_37_HLEN75      (0xFU<<24)
#define JPEG_HUFFENC_AC0_37_HLEN75_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_37_HCODE75     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_37_HCODE75_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_37_HLEN74      (0xFU<<8)
#define JPEG_HUFFENC_AC0_37_HLEN74_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_37_HCODE74     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_37_HCODE74_0   (0x1U<<0)

// HUFFENC_AC0_38 Configuration

#define JPEG_HUFFENC_AC0_38_HLEN77      (0xFU<<24)
#define JPEG_HUFFENC_AC0_38_HLEN77_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_38_HCODE77     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_38_HCODE77_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_38_HLEN76      (0xFU<<8)
#define JPEG_HUFFENC_AC0_38_HLEN76_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_38_HCODE76     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_38_HCODE76_0   (0x1U<<0)

// HUFFENC_AC0_39 Configuration

#define JPEG_HUFFENC_AC0_39_HLEN79      (0xFU<<24)
#define JPEG_HUFFENC_AC0_39_HLEN79_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_39_HCODE79     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_39_HCODE79_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_39_HLEN78      (0xFU<<8)
#define JPEG_HUFFENC_AC0_39_HLEN78_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_39_HCODE78     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_39_HCODE78_0   (0x1U<<0)

// HUFFENC_AC0_40 Configuration

#define JPEG_HUFFENC_AC0_40_HLEN81      (0xFU<<24)
#define JPEG_HUFFENC_AC0_40_HLEN81_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_40_HCODE81     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_40_HCODE81_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_40_HLEN80      (0xFU<<8)
#define JPEG_HUFFENC_AC0_40_HLEN80_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_40_HCODE80     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_40_HCODE80_0   (0x1U<<0)

// HUFFENC_AC0_41 Configuration

#define JPEG_HUFFENC_AC0_41_HLEN83      (0xFU<<24)
#define JPEG_HUFFENC_AC0_41_HLEN83_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_41_HCODE83     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_41_HCODE83_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_41_HLEN82      (0xFU<<8)
#define JPEG_HUFFENC_AC0_41_HLEN82_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_41_HCODE82     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_41_HCODE82_0   (0x1U<<0)

// HUFFENC_AC0_42 Configuration

#define JPEG_HUFFENC_AC0_42_HLEN85      (0xFU<<24)
#define JPEG_HUFFENC_AC0_42_HLEN85_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_42_HCODE85     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_42_HCODE85_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_42_HLEN84      (0xFU<<8)
#define JPEG_HUFFENC_AC0_42_HLEN84_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_42_HCODE84     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_42_HCODE84_0   (0x1U<<0)

// HUFFENC_AC0_43 Configuration

#define JPEG_HUFFENC_AC0_43_HLEN87      (0xFU<<24)
#define JPEG_HUFFENC_AC0_43_HLEN87_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_43_HCODE87     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_43_HCODE87_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_43_HLEN86      (0xFU<<8)
#define JPEG_HUFFENC_AC0_43_HLEN86_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_43_HCODE86     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_43_HCODE86_0   (0x1U<<0)

// HUFFENC_AC0_44 Configuration

#define JPEG_HUFFENC_AC0_44_HLEN89      (0xFU<<24)
#define JPEG_HUFFENC_AC0_44_HLEN89_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_44_HCODE89     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_44_HCODE89_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_44_HLEN88      (0xFU<<8)
#define JPEG_HUFFENC_AC0_44_HLEN88_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_44_HCODE88     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_44_HCODE88_0   (0x1U<<0)

// HUFFENC_AC0_45 Configuration

#define JPEG_HUFFENC_AC0_45_HLEN91      (0xFU<<24)
#define JPEG_HUFFENC_AC0_45_HLEN91_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_45_HCODE91     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_45_HCODE91_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_45_HLEN90      (0xFU<<8)
#define JPEG_HUFFENC_AC0_45_HLEN90_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_45_HCODE90     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_45_HCODE90_0   (0x1U<<0)

// HUFFENC_AC0_46 Configuration

#define JPEG_HUFFENC_AC0_46_HLEN93      (0xFU<<24)
#define JPEG_HUFFENC_AC0_46_HLEN93_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_46_HCODE93     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_46_HCODE93_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_46_HLEN92      (0xFU<<8)
#define JPEG_HUFFENC_AC0_46_HLEN92_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_46_HCODE92     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_46_HCODE92_0   (0x1U<<0)

// HUFFENC_AC0_47 Configuration

#define JPEG_HUFFENC_AC0_47_HLEN95      (0xFU<<24)
#define JPEG_HUFFENC_AC0_47_HLEN95_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_47_HCODE95     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_47_HCODE95_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_47_HLEN94      (0xFU<<8)
#define JPEG_HUFFENC_AC0_47_HLEN94_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_47_HCODE94     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_47_HCODE94_0   (0x1U<<0)

// HUFFENC_AC0_48 Configuration

#define JPEG_HUFFENC_AC0_48_HLEN97      (0xFU<<24)
#define JPEG_HUFFENC_AC0_48_HLEN97_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_48_HCODE97     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_48_HCODE97_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_48_HLEN96      (0xFU<<8)
#define JPEG_HUFFENC_AC0_48_HLEN96_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_48_HCODE96     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_48_HCODE96_0   (0x1U<<0)

// HUFFENC_AC0_49 Configuration

#define JPEG_HUFFENC_AC0_49_HLEN99      (0xFU<<24)
#define JPEG_HUFFENC_AC0_49_HLEN99_0    (0x1U<<24)
#define JPEG_HUFFENC_AC0_49_HCODE99     (0xFFU<<16)
#define JPEG_HUFFENC_AC0_49_HCODE99_0   (0x1U<<16)
#define JPEG_HUFFENC_AC0_49_HLEN98      (0xFU<<8)
#define JPEG_HUFFENC_AC0_49_HLEN98_0    (0x1U<<8)
#define JPEG_HUFFENC_AC0_49_HCODE98     (0xFFU<<0)
#define JPEG_HUFFENC_AC0_49_HCODE98_0   (0x1U<<0)

// HUFFENC_AC0_50 Configuration

#define JPEG_HUFFENC_AC0_50_HLEN101     (0xFU<<24)
#define JPEG_HUFFENC_AC0_50_HLEN101_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_50_HCODE101    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_50_HCODE101_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_50_HLEN100     (0xFU<<8)
#define JPEG_HUFFENC_AC0_50_HLEN100_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_50_HCODE100    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_50_HCODE100_0  (0x1U<<0)

// HUFFENC_AC0_51 Configuration

#define JPEG_HUFFENC_AC0_51_HLEN103     (0xFU<<24)
#define JPEG_HUFFENC_AC0_51_HLEN103_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_51_HCODE103    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_51_HCODE103_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_51_HLEN102     (0xFU<<8)
#define JPEG_HUFFENC_AC0_51_HLEN102_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_51_HCODE102    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_51_HCODE102_0  (0x1U<<0)

