Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC0_52 Configuration

#define JPEG_HUFFENC_AC0_52_HLEN105     (0xFU<<24)
#define JPEG_HUFFENC_AC0_52_HLEN105_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_52_HCODE105    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_52_HCODE105_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_52_HLEN104     (0xFU<<8)
#define JPEG_HUFFENC_AC0_52_HLEN104_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_52_HCODE104    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_52_HCODE104_0  (0x1U<<0)

// HUFFENC_AC0_53 Configuration

#define JPEG_HUFFENC_AC0_53_HLEN107     (0xFU<<24)
#define JPEG_HUFFENC_AC0_53_HLEN107_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_53_HCODE107    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_53_HCODE107_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_53_HLEN106     (0xFU<<8)
#define JPEG_HUFFENC_AC0_53_HLEN106_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_53_HCODE106    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_53_HCODE106_0  (0x1U<<0)

// HUFFENC_AC0_54 Configuration

#define JPEG_HUFFENC_AC0_54_HLEN109     (0xFU<<24)
#define JPEG_HUFFENC_AC0_54_HLEN109_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_54_HCODE109    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_54_HCODE109_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_54_HLEN108     (0xFU<<8)
#define JPEG_HUFFENC_AC0_54_HLEN108_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_54_HCODE108    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_54_HCODE108_0  (0x1U<<0)

// HUFFENC_AC0_55 Configuration

#define JPEG_HUFFENC_AC0_55_HLEN111     (0xFU<<24)
#define JPEG_HUFFENC_AC0_55_HLEN111_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_55_HCODE111    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_55_HCODE111_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_55_HLEN110     (0xFU<<8)
#define JPEG_HUFFENC_AC0_55_HLEN110_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_55_HCODE110    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_55_HCODE110_0  (0x1U<<0)

// HUFFENC_AC1_0 Configuration

#define JPEG_HUFFENC_AC1_0_HLEN1        (0xFU<<24)
#define JPEG_HUFFENC_AC1_0_HLEN1_0      (0x1U<<24)
#define JPEG_HUFFENC_AC1_0_HCODE1       (0xFFU<<16)
#define JPEG_HUFFENC_AC1_0_HCODE1_0     (0x1U<<16)
#define JPEG_HUFFENC_AC1_0_HLEN0        (0xFU<<8)
#define JPEG_HUFFENC_AC1_0_HLEN0_0      (0x1U<<8)
#define JPEG_HUFFENC_AC1_0_HCODE0       (0xFFU<<0)
#define JPEG_HUFFENC_AC1_0_HCODE0_0     (0x1U<<0)

// HUFFENC_AC0_56 Configuration

#define JPEG_HUFFENC_AC0_56_HLEN113     (0xFU<<24)
#define JPEG_HUFFENC_AC0_56_HLEN113_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_56_HCODE113    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_56_HCODE113_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_56_HLEN112     (0xFU<<8)
#define JPEG_HUFFENC_AC0_56_HLEN112_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_56_HCODE112    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_56_HCODE112_0  (0x1U<<0)

// HUFFENC_AC1_1 Configuration

#define JPEG_HUFFENC_AC1_1_HLEN3        (0xFU<<24)
#define JPEG_HUFFENC_AC1_1_HLEN3_0      (0x1U<<24)
#define JPEG_HUFFENC_AC1_1_HCODE3       (0xFFU<<16)
#define JPEG_HUFFENC_AC1_1_HCODE3_0     (0x1U<<16)
#define JPEG_HUFFENC_AC1_1_HLEN2        (0xFU<<8)
#define JPEG_HUFFENC_AC1_1_HLEN2_0      (0x1U<<8)
#define JPEG_HUFFENC_AC1_1_HCODE2       (0xFFU<<0)
#define JPEG_HUFFENC_AC1_1_HCODE2_0     (0x1U<<0)

// HUFFENC_AC0_57 Configuration

#define JPEG_HUFFENC_AC0_57_HLEN115     (0xFU<<24)
#define JPEG_HUFFENC_AC0_57_HLEN115_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_57_HCODE115    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_57_HCODE115_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_57_HLEN114     (0xFU<<8)
#define JPEG_HUFFENC_AC0_57_HLEN114_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_57_HCODE114    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_57_HCODE114_0  (0x1U<<0)

// HUFFENC_AC1_2 Configuration

#define JPEG_HUFFENC_AC1_2_HLEN5        (0xFU<<24)
#define JPEG_HUFFENC_AC1_2_HLEN5_0      (0x1U<<24)
#define JPEG_HUFFENC_AC1_2_HCODE5       (0xFFU<<16)
#define JPEG_HUFFENC_AC1_2_HCODE5_0     (0x1U<<16)
#define JPEG_HUFFENC_AC1_2_HLEN4        (0xFU<<8)
#define JPEG_HUFFENC_AC1_2_HLEN4_0      (0x1U<<8)
#define JPEG_HUFFENC_AC1_2_HCODE4       (0xFFU<<0)
#define JPEG_HUFFENC_AC1_2_HCODE4_0     (0x1U<<0)

// HUFFENC_AC0_58 Configuration

#define JPEG_HUFFENC_AC0_58_HLEN117     (0xFU<<24)
#define JPEG_HUFFENC_AC0_58_HLEN117_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_58_HCODE117    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_58_HCODE117_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_58_HLEN116     (0xFU<<8)
#define JPEG_HUFFENC_AC0_58_HLEN116_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_58_HCODE116    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_58_HCODE116_0  (0x1U<<0)

// HUFFENC_AC1_3 Configuration

#define JPEG_HUFFENC_AC1_3_HLEN7        (0xFU<<24)
#define JPEG_HUFFENC_AC1_3_HLEN7_0      (0x1U<<24)
#define JPEG_HUFFENC_AC1_3_HCODE7       (0xFFU<<16)
#define JPEG_HUFFENC_AC1_3_HCODE7_0     (0x1U<<16)
#define JPEG_HUFFENC_AC1_3_HLEN6        (0xFU<<8)
#define JPEG_HUFFENC_AC1_3_HLEN6_0      (0x1U<<8)
#define JPEG_HUFFENC_AC1_3_HCODE6       (0xFFU<<0)
#define JPEG_HUFFENC_AC1_3_HCODE6_0     (0x1U<<0)

// HUFFENC_AC0_59 Configuration

#define JPEG_HUFFENC_AC0_59_HLEN119     (0xFU<<24)
#define JPEG_HUFFENC_AC0_59_HLEN119_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_59_HCODE119    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_59_HCODE119_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_59_HLEN118     (0xFU<<8)
#define JPEG_HUFFENC_AC0_59_HLEN118_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_59_HCODE118    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_59_HCODE118_0  (0x1U<<0)

// HUFFENC_AC1_4 Configuration

#define JPEG_HUFFENC_AC1_4_HLEN9        (0xFU<<24)
#define JPEG_HUFFENC_AC1_4_HLEN9_0      (0x1U<<24)
#define JPEG_HUFFENC_AC1_4_HCODE9       (0xFFU<<16)
#define JPEG_HUFFENC_AC1_4_HCODE9_0     (0x1U<<16)
#define JPEG_HUFFENC_AC1_4_HLEN8        (0xFU<<8)
#define JPEG_HUFFENC_AC1_4_HLEN8_0      (0x1U<<8)
#define JPEG_HUFFENC_AC1_4_HCODE8       (0xFFU<<0)
#define JPEG_HUFFENC_AC1_4_HCODE8_0     (0x1U<<0)

// HUFFENC_AC0_60 Configuration

#define JPEG_HUFFENC_AC0_60_HLEN121     (0xFU<<24)
#define JPEG_HUFFENC_AC0_60_HLEN121_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_60_HCODE121    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_60_HCODE121_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_60_HLEN120     (0xFU<<8)
#define JPEG_HUFFENC_AC0_60_HLEN120_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_60_HCODE120    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_60_HCODE120_0  (0x1U<<0)

// HUFFENC_AC1_5 Configuration

