Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
#define JPEG_HUFFENC_AC1_5_HLEN11       (0xFU<<24)
#define JPEG_HUFFENC_AC1_5_HLEN11_0     (0x1U<<24)
#define JPEG_HUFFENC_AC1_5_HCODE11      (0xFFU<<16)
#define JPEG_HUFFENC_AC1_5_HCODE11_0    (0x1U<<16)
#define JPEG_HUFFENC_AC1_5_HLEN10       (0xFU<<8)
#define JPEG_HUFFENC_AC1_5_HLEN10_0     (0x1U<<8)
#define JPEG_HUFFENC_AC1_5_HCODE10      (0xFFU<<0)
#define JPEG_HUFFENC_AC1_5_HCODE10_0    (0x1U<<0)

// HUFFENC_AC0_61 Configuration

#define JPEG_HUFFENC_AC0_61_HLEN123     (0xFU<<24)
#define JPEG_HUFFENC_AC0_61_HLEN123_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_61_HCODE123    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_61_HCODE123_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_61_HLEN122     (0xFU<<8)
#define JPEG_HUFFENC_AC0_61_HLEN122_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_61_HCODE122    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_61_HCODE122_0  (0x1U<<0)

// HUFFENC_AC1_6 Configuration

#define JPEG_HUFFENC_AC1_6_HLEN13       (0xFU<<24)
#define JPEG_HUFFENC_AC1_6_HLEN13_0     (0x1U<<24)
#define JPEG_HUFFENC_AC1_6_HCODE13      (0xFFU<<16)
#define JPEG_HUFFENC_AC1_6_HCODE13_0    (0x1U<<16)
#define JPEG_HUFFENC_AC1_6_HLEN12       (0xFU<<8)
#define JPEG_HUFFENC_AC1_6_HLEN12_0     (0x1U<<8)
#define JPEG_HUFFENC_AC1_6_HCODE12      (0xFFU<<0)
#define JPEG_HUFFENC_AC1_6_HCODE12_0    (0x1U<<0)

// HUFFENC_AC0_62 Configuration

#define JPEG_HUFFENC_AC0_62_HLEN125     (0xFU<<24)
#define JPEG_HUFFENC_AC0_62_HLEN125_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_62_HCODE125    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_62_HCODE125_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_62_HLEN124     (0xFU<<8)
#define JPEG_HUFFENC_AC0_62_HLEN124_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_62_HCODE124    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_62_HCODE124_0  (0x1U<<0)

// HUFFENC_AC1_7 Configuration

#define JPEG_HUFFENC_AC1_7_HLEN15       (0xFU<<24)
#define JPEG_HUFFENC_AC1_7_HLEN15_0     (0x1U<<24)
#define JPEG_HUFFENC_AC1_7_HCODE15      (0xFFU<<16)
#define JPEG_HUFFENC_AC1_7_HCODE15_0    (0x1U<<16)
#define JPEG_HUFFENC_AC1_7_HLEN14       (0xFU<<8)
#define JPEG_HUFFENC_AC1_7_HLEN14_0     (0x1U<<8)
#define JPEG_HUFFENC_AC1_7_HCODE14      (0xFFU<<0)
#define JPEG_HUFFENC_AC1_7_HCODE14_0    (0x1U<<0)

// HUFFENC_AC0_63 Configuration

#define JPEG_HUFFENC_AC0_63_HLEN127     (0xFU<<24)
#define JPEG_HUFFENC_AC0_63_HLEN127_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_63_HCODE127    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_63_HCODE127_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_63_HLEN126     (0xFU<<8)
#define JPEG_HUFFENC_AC0_63_HLEN126_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_63_HCODE126    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_63_HCODE126_0  (0x1U<<0)

// HUFFENC_AC1_8 Configuration

#define JPEG_HUFFENC_AC1_8_HLEN17       (0xFU<<24)
#define JPEG_HUFFENC_AC1_8_HLEN17_0     (0x1U<<24)
#define JPEG_HUFFENC_AC1_8_HCODE17      (0xFFU<<16)
#define JPEG_HUFFENC_AC1_8_HCODE17_0    (0x1U<<16)
#define JPEG_HUFFENC_AC1_8_HLEN16       (0xFU<<8)
#define JPEG_HUFFENC_AC1_8_HLEN16_0     (0x1U<<8)
#define JPEG_HUFFENC_AC1_8_HCODE16      (0xFFU<<0)
#define JPEG_HUFFENC_AC1_8_HCODE16_0    (0x1U<<0)

// HUFFENC_AC0_64 Configuration

#define JPEG_HUFFENC_AC0_64_HLEN129     (0xFU<<24)
#define JPEG_HUFFENC_AC0_64_HLEN129_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_64_HCODE129    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_64_HCODE129_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_64_HLEN128     (0xFU<<8)
#define JPEG_HUFFENC_AC0_64_HLEN128_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_64_HCODE128    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_64_HCODE128_0  (0x1U<<0)

// HUFFENC_AC1_9 Configuration

#define JPEG_HUFFENC_AC1_9_HLEN19       (0xFU<<24)
#define JPEG_HUFFENC_AC1_9_HLEN19_0     (0x1U<<24)
#define JPEG_HUFFENC_AC1_9_HCODE19      (0xFFU<<16)
#define JPEG_HUFFENC_AC1_9_HCODE19_0    (0x1U<<16)
#define JPEG_HUFFENC_AC1_9_HLEN18       (0xFU<<8)
#define JPEG_HUFFENC_AC1_9_HLEN18_0     (0x1U<<8)
#define JPEG_HUFFENC_AC1_9_HCODE18      (0xFFU<<0)
#define JPEG_HUFFENC_AC1_9_HCODE18_0    (0x1U<<0)

// HUFFENC_AC0_65 Configuration

#define JPEG_HUFFENC_AC0_65_HLEN131     (0xFU<<24)
#define JPEG_HUFFENC_AC0_65_HLEN131_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_65_HCODE131    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_65_HCODE131_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_65_HLEN130     (0xFU<<8)
#define JPEG_HUFFENC_AC0_65_HLEN130_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_65_HCODE130    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_65_HCODE130_0  (0x1U<<0)

// HUFFENC_AC1_10 Configuration

#define JPEG_HUFFENC_AC1_10_HLEN21      (0xFU<<24)
#define JPEG_HUFFENC_AC1_10_HLEN21_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_10_HCODE21     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_10_HCODE21_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_10_HLEN20      (0xFU<<8)
#define JPEG_HUFFENC_AC1_10_HLEN20_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_10_HCODE20     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_10_HCODE20_0   (0x1U<<0)

// HUFFENC_AC0_66 Configuration

#define JPEG_HUFFENC_AC0_66_HLEN133     (0xFU<<24)
#define JPEG_HUFFENC_AC0_66_HLEN133_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_66_HCODE133    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_66_HCODE133_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_66_HLEN132     (0xFU<<8)
#define JPEG_HUFFENC_AC0_66_HLEN132_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_66_HCODE132    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_66_HCODE132_0  (0x1U<<0)

// HUFFENC_AC1_11 Configuration

#define JPEG_HUFFENC_AC1_11_HLEN23      (0xFU<<24)
#define JPEG_HUFFENC_AC1_11_HLEN23_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_11_HCODE23     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_11_HCODE23_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_11_HLEN22      (0xFU<<8)
#define JPEG_HUFFENC_AC1_11_HLEN22_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_11_HCODE22     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_11_HCODE22_0   (0x1U<<0)

// HUFFENC_AC0_67 Configuration

#define JPEG_HUFFENC_AC0_67_HLEN135     (0xFU<<24)
#define JPEG_HUFFENC_AC0_67_HLEN135_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_67_HCODE135    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_67_HCODE135_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_67_HLEN134     (0xFU<<8)
#define JPEG_HUFFENC_AC0_67_HLEN134_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_67_HCODE134    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_67_HCODE134_0  (0x1U<<0)

// HUFFENC_AC1_12 Configuration

#define JPEG_HUFFENC_AC1_12_HLEN25      (0xFU<<24)
#define JPEG_HUFFENC_AC1_12_HLEN25_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_12_HCODE25     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_12_HCODE25_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_12_HLEN24      (0xFU<<8)
#define JPEG_HUFFENC_AC1_12_HLEN24_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_12_HCODE24     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_12_HCODE24_0   (0x1U<<0)

