Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC0_68 Configuration

#define JPEG_HUFFENC_AC0_68_HLEN137     (0xFU<<24)
#define JPEG_HUFFENC_AC0_68_HLEN137_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_68_HCODE137    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_68_HCODE137_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_68_HLEN136     (0xFU<<8)
#define JPEG_HUFFENC_AC0_68_HLEN136_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_68_HCODE136    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_68_HCODE136_0  (0x1U<<0)

// HUFFENC_AC1_13 Configuration

#define JPEG_HUFFENC_AC1_13_HLEN27      (0xFU<<24)
#define JPEG_HUFFENC_AC1_13_HLEN27_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_13_HCODE27     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_13_HCODE27_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_13_HLEN26      (0xFU<<8)
#define JPEG_HUFFENC_AC1_13_HLEN26_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_13_HCODE26     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_13_HCODE26_0   (0x1U<<0)

// HUFFENC_AC0_69 Configuration

#define JPEG_HUFFENC_AC0_69_HLEN139     (0xFU<<24)
#define JPEG_HUFFENC_AC0_69_HLEN139_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_69_HCODE139    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_69_HCODE139_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_69_HLEN138     (0xFU<<8)
#define JPEG_HUFFENC_AC0_69_HLEN138_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_69_HCODE138    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_69_HCODE138_0  (0x1U<<0)

// HUFFENC_AC1_14 Configuration

#define JPEG_HUFFENC_AC1_14_HLEN29      (0xFU<<24)
#define JPEG_HUFFENC_AC1_14_HLEN29_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_14_HCODE29     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_14_HCODE29_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_14_HLEN28      (0xFU<<8)
#define JPEG_HUFFENC_AC1_14_HLEN28_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_14_HCODE28     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_14_HCODE28_0   (0x1U<<0)

// HUFFENC_AC0_70 Configuration

#define JPEG_HUFFENC_AC0_70_HLEN141     (0xFU<<24)
#define JPEG_HUFFENC_AC0_70_HLEN141_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_70_HCODE141    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_70_HCODE141_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_70_HLEN140     (0xFU<<8)
#define JPEG_HUFFENC_AC0_70_HLEN140_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_70_HCODE140    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_70_HCODE140_0  (0x1U<<0)

// HUFFENC_AC1_15 Configuration

#define JPEG_HUFFENC_AC1_15_HLEN31      (0xFU<<24)
#define JPEG_HUFFENC_AC1_15_HLEN31_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_15_HCODE31     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_15_HCODE31_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_15_HLEN30      (0xFU<<8)
#define JPEG_HUFFENC_AC1_15_HLEN30_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_15_HCODE30     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_15_HCODE30_0   (0x1U<<0)

// HUFFENC_AC0_71 Configuration

#define JPEG_HUFFENC_AC0_71_HLEN143     (0xFU<<24)
#define JPEG_HUFFENC_AC0_71_HLEN143_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_71_HCODE143    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_71_HCODE143_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_71_HLEN142     (0xFU<<8)
#define JPEG_HUFFENC_AC0_71_HLEN142_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_71_HCODE142    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_71_HCODE142_0  (0x1U<<0)

// HUFFENC_AC1_16 Configuration

#define JPEG_HUFFENC_AC1_16_HLEN33      (0xFU<<24)
#define JPEG_HUFFENC_AC1_16_HLEN33_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_16_HCODE33     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_16_HCODE33_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_16_HLEN32      (0xFU<<8)
#define JPEG_HUFFENC_AC1_16_HLEN32_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_16_HCODE32     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_16_HCODE32_0   (0x1U<<0)

// HUFFENC_AC0_72 Configuration

#define JPEG_HUFFENC_AC0_72_HLEN145     (0xFU<<24)
#define JPEG_HUFFENC_AC0_72_HLEN145_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_72_HCODE145    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_72_HCODE145_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_72_HLEN144     (0xFU<<8)
#define JPEG_HUFFENC_AC0_72_HLEN144_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_72_HCODE144    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_72_HCODE144_0  (0x1U<<0)

// HUFFENC_AC1_17 Configuration

#define JPEG_HUFFENC_AC1_17_HLEN35      (0xFU<<24)
#define JPEG_HUFFENC_AC1_17_HLEN35_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_17_HCODE35     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_17_HCODE35_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_17_HLEN34      (0xFU<<8)
#define JPEG_HUFFENC_AC1_17_HLEN34_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_17_HCODE34     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_17_HCODE34_0   (0x1U<<0)

// HUFFENC_AC0_73 Configuration

#define JPEG_HUFFENC_AC0_73_HLEN147     (0xFU<<24)
#define JPEG_HUFFENC_AC0_73_HLEN147_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_73_HCODE147    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_73_HCODE147_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_73_HLEN146     (0xFU<<8)
#define JPEG_HUFFENC_AC0_73_HLEN146_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_73_HCODE146    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_73_HCODE146_0  (0x1U<<0)

// HUFFENC_AC1_18 Configuration

#define JPEG_HUFFENC_AC1_18_HLEN37      (0xFU<<24)
#define JPEG_HUFFENC_AC1_18_HLEN37_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_18_HCODE37     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_18_HCODE37_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_18_HLEN36      (0xFU<<8)
#define JPEG_HUFFENC_AC1_18_HLEN36_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_18_HCODE36     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_18_HCODE36_0   (0x1U<<0)

// HUFFENC_AC0_74 Configuration

#define JPEG_HUFFENC_AC0_74_HLEN149     (0xFU<<24)
#define JPEG_HUFFENC_AC0_74_HLEN149_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_74_HCODE149    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_74_HCODE149_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_74_HLEN148     (0xFU<<8)
#define JPEG_HUFFENC_AC0_74_HLEN148_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_74_HCODE148    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_74_HCODE148_0  (0x1U<<0)

// HUFFENC_AC1_19 Configuration

#define JPEG_HUFFENC_AC1_19_HLEN39      (0xFU<<24)
#define JPEG_HUFFENC_AC1_19_HLEN39_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_19_HCODE39     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_19_HCODE39_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_19_HLEN38      (0xFU<<8)
#define JPEG_HUFFENC_AC1_19_HLEN38_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_19_HCODE38     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_19_HCODE38_0   (0x1U<<0)

// HUFFENC_AC0_75 Configuration

#define JPEG_HUFFENC_AC0_75_HLEN151     (0xFU<<24)
#define JPEG_HUFFENC_AC0_75_HLEN151_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_75_HCODE151    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_75_HCODE151_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_75_HLEN150     (0xFU<<8)
#define JPEG_HUFFENC_AC0_75_HLEN150_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_75_HCODE150    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_75_HCODE150_0  (0x1U<<0)

// HUFFENC_AC1_20 Configuration

#define JPEG_HUFFENC_AC1_20_HLEN41      (0xFU<<24)
#define JPEG_HUFFENC_AC1_20_HLEN41_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_20_HCODE41     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_20_HCODE41_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_20_HLEN40      (0xFU<<8)
#define JPEG_HUFFENC_AC1_20_HLEN40_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_20_HCODE40     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_20_HCODE40_0   (0x1U<<0)

