Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC0_76 Configuration

#define JPEG_HUFFENC_AC0_76_HLEN153     (0xFU<<24)
#define JPEG_HUFFENC_AC0_76_HLEN153_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_76_HCODE153    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_76_HCODE153_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_76_HLEN152     (0xFU<<8)
#define JPEG_HUFFENC_AC0_76_HLEN152_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_76_HCODE152    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_76_HCODE152_0  (0x1U<<0)

// HUFFENC_AC1_21 Configuration

#define JPEG_HUFFENC_AC1_21_HLEN43      (0xFU<<24)
#define JPEG_HUFFENC_AC1_21_HLEN43_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_21_HCODE43     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_21_HCODE43_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_21_HLEN42      (0xFU<<8)
#define JPEG_HUFFENC_AC1_21_HLEN42_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_21_HCODE42     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_21_HCODE42_0   (0x1U<<0)

// HUFFENC_AC0_77 Configuration

#define JPEG_HUFFENC_AC0_77_HLEN155     (0xFU<<24)
#define JPEG_HUFFENC_AC0_77_HLEN155_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_77_HCODE155    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_77_HCODE155_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_77_HLEN154     (0xFU<<8)
#define JPEG_HUFFENC_AC0_77_HLEN154_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_77_HCODE154    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_77_HCODE154_0  (0x1U<<0)

// HUFFENC_AC1_22 Configuration

#define JPEG_HUFFENC_AC1_22_HLEN45      (0xFU<<24)
#define JPEG_HUFFENC_AC1_22_HLEN45_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_22_HCODE45     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_22_HCODE45_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_22_HLEN44      (0xFU<<8)
#define JPEG_HUFFENC_AC1_22_HLEN44_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_22_HCODE44     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_22_HCODE44_0   (0x1U<<0)

// HUFFENC_AC0_78 Configuration

#define JPEG_HUFFENC_AC0_78_HLEN157     (0xFU<<24)
#define JPEG_HUFFENC_AC0_78_HLEN157_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_78_HCODE157    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_78_HCODE157_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_78_HLEN156     (0xFU<<8)
#define JPEG_HUFFENC_AC0_78_HLEN156_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_78_HCODE156    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_78_HCODE156_0  (0x1U<<0)

// HUFFENC_AC1_23 Configuration

#define JPEG_HUFFENC_AC1_23_HLEN47      (0xFU<<24)
#define JPEG_HUFFENC_AC1_23_HLEN47_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_23_HCODE47     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_23_HCODE47_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_23_HLEN46      (0xFU<<8)
#define JPEG_HUFFENC_AC1_23_HLEN46_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_23_HCODE46     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_23_HCODE46_0   (0x1U<<0)

// HUFFENC_AC0_79 Configuration

#define JPEG_HUFFENC_AC0_79_HLEN159     (0xFU<<24)
#define JPEG_HUFFENC_AC0_79_HLEN159_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_79_HCODE159    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_79_HCODE159_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_79_HLEN158     (0xFU<<8)
#define JPEG_HUFFENC_AC0_79_HLEN158_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_79_HCODE158    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_79_HCODE158_0  (0x1U<<0)

// HUFFENC_AC1_24 Configuration

#define JPEG_HUFFENC_AC1_24_HLEN49      (0xFU<<24)
#define JPEG_HUFFENC_AC1_24_HLEN49_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_24_HCODE49     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_24_HCODE49_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_24_HLEN48      (0xFU<<8)
#define JPEG_HUFFENC_AC1_24_HLEN48_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_24_HCODE48     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_24_HCODE48_0   (0x1U<<0)

// HUFFENC_AC0_80 Configuration

#define JPEG_HUFFENC_AC0_80_HLEN161     (0xFU<<24)
#define JPEG_HUFFENC_AC0_80_HLEN161_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_80_HCODE161    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_80_HCODE161_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_80_HLEN160     (0xFU<<8)
#define JPEG_HUFFENC_AC0_80_HLEN160_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_80_HCODE160    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_80_HCODE160_0  (0x1U<<0)

// HUFFENC_AC1_25 Configuration

#define JPEG_HUFFENC_AC1_25_HLEN51      (0xFU<<24)
#define JPEG_HUFFENC_AC1_25_HLEN51_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_25_HCODE51     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_25_HCODE51_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_25_HLEN50      (0xFU<<8)
#define JPEG_HUFFENC_AC1_25_HLEN50_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_25_HCODE50     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_25_HCODE50_0   (0x1U<<0)

// HUFFENC_AC0_81 Configuration

#define JPEG_HUFFENC_AC0_81_HLEN163     (0xFU<<24)
#define JPEG_HUFFENC_AC0_81_HLEN163_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_81_HCODE163    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_81_HCODE163_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_81_HLEN162     (0xFU<<8)
#define JPEG_HUFFENC_AC0_81_HLEN162_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_81_HCODE162    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_81_HCODE162_0  (0x1U<<0)

// HUFFENC_AC1_26 Configuration

#define JPEG_HUFFENC_AC1_26_HLEN53      (0xFU<<24)
#define JPEG_HUFFENC_AC1_26_HLEN53_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_26_HCODE53     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_26_HCODE53_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_26_HLEN52      (0xFU<<8)
#define JPEG_HUFFENC_AC1_26_HLEN52_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_26_HCODE52     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_26_HCODE52_0   (0x1U<<0)

// HUFFENC_AC0_82 Configuration

#define JPEG_HUFFENC_AC0_82_HLEN165     (0xFU<<24)
#define JPEG_HUFFENC_AC0_82_HLEN165_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_82_HCODE165    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_82_HCODE165_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_82_HLEN164     (0xFU<<8)
#define JPEG_HUFFENC_AC0_82_HLEN164_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_82_HCODE164    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_82_HCODE164_0  (0x1U<<0)

// HUFFENC_AC1_27 Configuration

#define JPEG_HUFFENC_AC1_27_HLEN55      (0xFU<<24)
#define JPEG_HUFFENC_AC1_27_HLEN55_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_27_HCODE55     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_27_HCODE55_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_27_HLEN54      (0xFU<<8)
#define JPEG_HUFFENC_AC1_27_HLEN54_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_27_HCODE54     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_27_HCODE54_0   (0x1U<<0)

// HUFFENC_AC0_83 Configuration

#define JPEG_HUFFENC_AC0_83_HLEN167     (0xFU<<24)
#define JPEG_HUFFENC_AC0_83_HLEN167_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_83_HCODE167    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_83_HCODE167_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_83_HLEN166     (0xFU<<8)
#define JPEG_HUFFENC_AC0_83_HLEN166_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_83_HCODE166    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_83_HCODE166_0  (0x1U<<0)

// HUFFENC_AC1_28 Configuration

#define JPEG_HUFFENC_AC1_28_HLEN57      (0xFU<<24)
#define JPEG_HUFFENC_AC1_28_HLEN57_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_28_HCODE57     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_28_HCODE57_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_28_HLEN56      (0xFU<<8)
#define JPEG_HUFFENC_AC1_28_HLEN56_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_28_HCODE56     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_28_HCODE56_0   (0x1U<<0)

// HUFFENC_AC0_84 Configuration

#define JPEG_HUFFENC_AC0_84_HLEN169     (0xFU<<24)
#define JPEG_HUFFENC_AC0_84_HLEN169_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_84_HCODE169    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_84_HCODE169_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_84_HLEN168     (0xFU<<8)
#define JPEG_HUFFENC_AC0_84_HLEN168_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_84_HCODE168    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_84_HCODE168_0  (0x1U<<0)

// HUFFENC_AC1_29 Configuration

#define JPEG_HUFFENC_AC1_29_HLEN59      (0xFU<<24)
#define JPEG_HUFFENC_AC1_29_HLEN59_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_29_HCODE59     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_29_HCODE59_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_29_HLEN58      (0xFU<<8)
#define JPEG_HUFFENC_AC1_29_HLEN58_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_29_HCODE58     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_29_HCODE58_0   (0x1U<<0)

// HUFFENC_AC0_85 Configuration

#define JPEG_HUFFENC_AC0_85_HLEN171     (0xFU<<24)
#define JPEG_HUFFENC_AC0_85_HLEN171_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_85_HCODE171    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_85_HCODE171_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_85_HLEN170     (0xFU<<8)
#define JPEG_HUFFENC_AC0_85_HLEN170_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_85_HCODE170    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_85_HCODE170_0  (0x1U<<0)

