Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC1_30 Configuration

#define JPEG_HUFFENC_AC1_30_HLEN61      (0xFU<<24)
#define JPEG_HUFFENC_AC1_30_HLEN61_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_30_HCODE61     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_30_HCODE61_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_30_HLEN60      (0xFU<<8)
#define JPEG_HUFFENC_AC1_30_HLEN60_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_30_HCODE60     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_30_HCODE60_0   (0x1U<<0)

// HUFFENC_AC0_86 Configuration

#define JPEG_HUFFENC_AC0_86_HLEN173     (0xFU<<24)
#define JPEG_HUFFENC_AC0_86_HLEN173_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_86_HCODE173    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_86_HCODE173_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_86_HLEN172     (0xFU<<8)
#define JPEG_HUFFENC_AC0_86_HLEN172_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_86_HCODE172    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_86_HCODE172_0  (0x1U<<0)

// HUFFENC_AC1_31 Configuration

#define JPEG_HUFFENC_AC1_31_HLEN63      (0xFU<<24)
#define JPEG_HUFFENC_AC1_31_HLEN63_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_31_HCODE63     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_31_HCODE63_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_31_HLEN62      (0xFU<<8)
#define JPEG_HUFFENC_AC1_31_HLEN62_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_31_HCODE62     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_31_HCODE62_0   (0x1U<<0)

// HUFFENC_AC0_87 Configuration

#define JPEG_HUFFENC_AC0_87_HLEN175     (0xFU<<24)
#define JPEG_HUFFENC_AC0_87_HLEN175_0   (0x1U<<24)
#define JPEG_HUFFENC_AC0_87_HCODE175    (0xFFU<<16)
#define JPEG_HUFFENC_AC0_87_HCODE175_0  (0x1U<<16)
#define JPEG_HUFFENC_AC0_87_HLEN174     (0xFU<<8)
#define JPEG_HUFFENC_AC0_87_HLEN174_0   (0x1U<<8)
#define JPEG_HUFFENC_AC0_87_HCODE174    (0xFFU<<0)
#define JPEG_HUFFENC_AC0_87_HCODE174_0  (0x1U<<0)

// HUFFENC_AC1_32 Configuration

#define JPEG_HUFFENC_AC1_32_HLEN65      (0xFU<<24)
#define JPEG_HUFFENC_AC1_32_HLEN65_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_32_HCODE65     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_32_HCODE65_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_32_HLEN64      (0xFU<<8)
#define JPEG_HUFFENC_AC1_32_HLEN64_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_32_HCODE64     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_32_HCODE64_0   (0x1U<<0)

// HUFFENC_AC1_33 Configuration

#define JPEG_HUFFENC_AC1_33_HLEN67      (0xFU<<24)
#define JPEG_HUFFENC_AC1_33_HLEN67_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_33_HCODE67     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_33_HCODE67_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_33_HLEN66      (0xFU<<8)
#define JPEG_HUFFENC_AC1_33_HLEN66_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_33_HCODE66     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_33_HCODE66_0   (0x1U<<0)

// HUFFENC_AC1_34 Configuration

#define JPEG_HUFFENC_AC1_34_HLEN69      (0xFU<<24)
#define JPEG_HUFFENC_AC1_34_HLEN69_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_34_HCODE69     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_34_HCODE69_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_34_HLEN68      (0xFU<<8)
#define JPEG_HUFFENC_AC1_34_HLEN68_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_34_HCODE68     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_34_HCODE68_0   (0x1U<<0)

// HUFFENC_AC1_35 Configuration

#define JPEG_HUFFENC_AC1_35_HLEN71      (0xFU<<24)
#define JPEG_HUFFENC_AC1_35_HLEN71_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_35_HCODE71     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_35_HCODE71_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_35_HLEN70      (0xFU<<8)
#define JPEG_HUFFENC_AC1_35_HLEN70_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_35_HCODE70     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_35_HCODE70_0   (0x1U<<0)

// HUFFENC_AC1_36 Configuration

#define JPEG_HUFFENC_AC1_36_HLEN73      (0xFU<<24)
#define JPEG_HUFFENC_AC1_36_HLEN73_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_36_HCODE73     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_36_HCODE73_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_36_HLEN72      (0xFU<<8)
#define JPEG_HUFFENC_AC1_36_HLEN72_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_36_HCODE72     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_36_HCODE72_0   (0x1U<<0)

// HUFFENC_AC1_37 Configuration

#define JPEG_HUFFENC_AC1_37_HLEN75      (0xFU<<24)
#define JPEG_HUFFENC_AC1_37_HLEN75_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_37_HCODE75     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_37_HCODE75_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_37_HLEN74      (0xFU<<8)
#define JPEG_HUFFENC_AC1_37_HLEN74_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_37_HCODE74     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_37_HCODE74_0   (0x1U<<0)

// HUFFENC_AC1_38 Configuration

#define JPEG_HUFFENC_AC1_38_HLEN77      (0xFU<<24)
#define JPEG_HUFFENC_AC1_38_HLEN77_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_38_HCODE77     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_38_HCODE77_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_38_HLEN76      (0xFU<<8)
#define JPEG_HUFFENC_AC1_38_HLEN76_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_38_HCODE76     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_38_HCODE76_0   (0x1U<<0)

// HUFFENC_AC1_39 Configuration

#define JPEG_HUFFENC_AC1_39_HLEN79      (0xFU<<24)
#define JPEG_HUFFENC_AC1_39_HLEN79_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_39_HCODE79     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_39_HCODE79_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_39_HLEN78      (0xFU<<8)
#define JPEG_HUFFENC_AC1_39_HLEN78_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_39_HCODE78     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_39_HCODE78_0   (0x1U<<0)

// HUFFENC_AC1_40 Configuration

#define JPEG_HUFFENC_AC1_40_HLEN81      (0xFU<<24)
#define JPEG_HUFFENC_AC1_40_HLEN81_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_40_HCODE81     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_40_HCODE81_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_40_HLEN80      (0xFU<<8)
#define JPEG_HUFFENC_AC1_40_HLEN80_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_40_HCODE80     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_40_HCODE80_0   (0x1U<<0)

// HUFFENC_AC1_41 Configuration

#define JPEG_HUFFENC_AC1_41_HLEN83      (0xFU<<24)
#define JPEG_HUFFENC_AC1_41_HLEN83_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_41_HCODE83     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_41_HCODE83_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_41_HLEN82      (0xFU<<8)
#define JPEG_HUFFENC_AC1_41_HLEN82_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_41_HCODE82     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_41_HCODE82_0   (0x1U<<0)

