Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC1_42 Configuration

#define JPEG_HUFFENC_AC1_42_HLEN85      (0xFU<<24)
#define JPEG_HUFFENC_AC1_42_HLEN85_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_42_HCODE85     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_42_HCODE85_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_42_HLEN84      (0xFU<<8)
#define JPEG_HUFFENC_AC1_42_HLEN84_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_42_HCODE84     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_42_HCODE84_0   (0x1U<<0)

// HUFFENC_AC1_43 Configuration

#define JPEG_HUFFENC_AC1_43_HLEN87      (0xFU<<24)
#define JPEG_HUFFENC_AC1_43_HLEN87_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_43_HCODE87     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_43_HCODE87_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_43_HLEN86      (0xFU<<8)
#define JPEG_HUFFENC_AC1_43_HLEN86_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_43_HCODE86     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_43_HCODE86_0   (0x1U<<0)

// HUFFENC_AC1_44 Configuration

#define JPEG_HUFFENC_AC1_44_HLEN89      (0xFU<<24)
#define JPEG_HUFFENC_AC1_44_HLEN89_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_44_HCODE89     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_44_HCODE89_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_44_HLEN88      (0xFU<<8)
#define JPEG_HUFFENC_AC1_44_HLEN88_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_44_HCODE88     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_44_HCODE88_0   (0x1U<<0)

// HUFFENC_AC1_45 Configuration

#define JPEG_HUFFENC_AC1_45_HLEN91      (0xFU<<24)
#define JPEG_HUFFENC_AC1_45_HLEN91_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_45_HCODE91     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_45_HCODE91_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_45_HLEN90      (0xFU<<8)
#define JPEG_HUFFENC_AC1_45_HLEN90_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_45_HCODE90     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_45_HCODE90_0   (0x1U<<0)

// HUFFENC_AC1_46 Configuration

#define JPEG_HUFFENC_AC1_46_HLEN93      (0xFU<<24)
#define JPEG_HUFFENC_AC1_46_HLEN93_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_46_HCODE93     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_46_HCODE93_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_46_HLEN92      (0xFU<<8)
#define JPEG_HUFFENC_AC1_46_HLEN92_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_46_HCODE92     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_46_HCODE92_0   (0x1U<<0)

// HUFFENC_AC1_47 Configuration

#define JPEG_HUFFENC_AC1_47_HLEN95      (0xFU<<24)
#define JPEG_HUFFENC_AC1_47_HLEN95_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_47_HCODE95     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_47_HCODE95_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_47_HLEN94      (0xFU<<8)
#define JPEG_HUFFENC_AC1_47_HLEN94_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_47_HCODE94     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_47_HCODE94_0   (0x1U<<0)

// HUFFENC_AC1_48 Configuration

#define JPEG_HUFFENC_AC1_48_HLEN97      (0xFU<<24)
#define JPEG_HUFFENC_AC1_48_HLEN97_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_48_HCODE97     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_48_HCODE97_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_48_HLEN96      (0xFU<<8)
#define JPEG_HUFFENC_AC1_48_HLEN96_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_48_HCODE96     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_48_HCODE96_0   (0x1U<<0)

// HUFFENC_AC1_49 Configuration

#define JPEG_HUFFENC_AC1_49_HLEN99      (0xFU<<24)
#define JPEG_HUFFENC_AC1_49_HLEN99_0    (0x1U<<24)
#define JPEG_HUFFENC_AC1_49_HCODE99     (0xFFU<<16)
#define JPEG_HUFFENC_AC1_49_HCODE99_0   (0x1U<<16)
#define JPEG_HUFFENC_AC1_49_HLEN98      (0xFU<<8)
#define JPEG_HUFFENC_AC1_49_HLEN98_0    (0x1U<<8)
#define JPEG_HUFFENC_AC1_49_HCODE98     (0xFFU<<0)
#define JPEG_HUFFENC_AC1_49_HCODE98_0   (0x1U<<0)

// HUFFENC_AC1_50 Configuration

#define JPEG_HUFFENC_AC1_50_HLEN101     (0xFU<<24)
#define JPEG_HUFFENC_AC1_50_HLEN101_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_50_HCODE101    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_50_HCODE101_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_50_HLEN100     (0xFU<<8)
#define JPEG_HUFFENC_AC1_50_HLEN100_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_50_HCODE100    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_50_HCODE100_0  (0x1U<<0)

// HUFFENC_AC1_51 Configuration

#define JPEG_HUFFENC_AC1_51_HLEN103     (0xFU<<24)
#define JPEG_HUFFENC_AC1_51_HLEN103_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_51_HCODE103    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_51_HCODE103_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_51_HLEN102     (0xFU<<8)
#define JPEG_HUFFENC_AC1_51_HLEN102_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_51_HCODE102    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_51_HCODE102_0  (0x1U<<0)

// HUFFENC_AC1_52 Configuration

#define JPEG_HUFFENC_AC1_52_HLEN105     (0xFU<<24)
#define JPEG_HUFFENC_AC1_52_HLEN105_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_52_HCODE105    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_52_HCODE105_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_52_HLEN104     (0xFU<<8)
#define JPEG_HUFFENC_AC1_52_HLEN104_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_52_HCODE104    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_52_HCODE104_0  (0x1U<<0)

// HUFFENC_AC1_53 Configuration

#define JPEG_HUFFENC_AC1_53_HLEN107     (0xFU<<24)
#define JPEG_HUFFENC_AC1_53_HLEN107_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_53_HCODE107    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_53_HCODE107_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_53_HLEN106     (0xFU<<8)
#define JPEG_HUFFENC_AC1_53_HLEN106_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_53_HCODE106    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_53_HCODE106_0  (0x1U<<0)

// HUFFENC_AC1_54 Configuration

#define JPEG_HUFFENC_AC1_54_HLEN109     (0xFU<<24)
#define JPEG_HUFFENC_AC1_54_HLEN109_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_54_HCODE109    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_54_HCODE109_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_54_HLEN108     (0xFU<<8)
#define JPEG_HUFFENC_AC1_54_HLEN108_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_54_HCODE108    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_54_HCODE108_0  (0x1U<<0)

// HUFFENC_AC1_55 Configuration

#define JPEG_HUFFENC_AC1_55_HLEN111     (0xFU<<24)
#define JPEG_HUFFENC_AC1_55_HLEN111_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_55_HCODE111    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_55_HCODE111_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_55_HLEN110     (0xFU<<8)
#define JPEG_HUFFENC_AC1_55_HLEN110_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_55_HCODE110    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_55_HCODE110_0  (0x1U<<0)

// HUFFENC_AC1_56 Configuration

#define JPEG_HUFFENC_AC1_56_HLEN113     (0xFU<<24)
#define JPEG_HUFFENC_AC1_56_HLEN113_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_56_HCODE113    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_56_HCODE113_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_56_HLEN112     (0xFU<<8)
#define JPEG_HUFFENC_AC1_56_HLEN112_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_56_HCODE112    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_56_HCODE112_0  (0x1U<<0)

// HUFFENC_AC1_57 Configuration

#define JPEG_HUFFENC_AC1_57_HLEN115     (0xFU<<24)
#define JPEG_HUFFENC_AC1_57_HLEN115_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_57_HCODE115    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_57_HCODE115_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_57_HLEN114     (0xFU<<8)
#define JPEG_HUFFENC_AC1_57_HLEN114_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_57_HCODE114    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_57_HCODE114_0  (0x1U<<0)

// HUFFENC_AC1_58 Configuration

#define JPEG_HUFFENC_AC1_58_HLEN117     (0xFU<<24)
#define JPEG_HUFFENC_AC1_58_HLEN117_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_58_HCODE117    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_58_HCODE117_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_58_HLEN116     (0xFU<<8)
#define JPEG_HUFFENC_AC1_58_HLEN116_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_58_HCODE116    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_58_HCODE116_0  (0x1U<<0)

// HUFFENC_AC1_59 Configuration

#define JPEG_HUFFENC_AC1_59_HLEN119     (0xFU<<24)
#define JPEG_HUFFENC_AC1_59_HLEN119_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_59_HCODE119    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_59_HCODE119_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_59_HLEN118     (0xFU<<8)
#define JPEG_HUFFENC_AC1_59_HLEN118_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_59_HCODE118    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_59_HCODE118_0  (0x1U<<0)

// HUFFENC_AC1_60 Configuration

#define JPEG_HUFFENC_AC1_60_HLEN121     (0xFU<<24)
#define JPEG_HUFFENC_AC1_60_HLEN121_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_60_HCODE121    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_60_HCODE121_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_60_HLEN120     (0xFU<<8)
#define JPEG_HUFFENC_AC1_60_HLEN120_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_60_HCODE120    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_60_HCODE120_0  (0x1U<<0)

// HUFFENC_AC1_61 Configuration

#define JPEG_HUFFENC_AC1_61_HLEN123     (0xFU<<24)
#define JPEG_HUFFENC_AC1_61_HLEN123_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_61_HCODE123    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_61_HCODE123_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_61_HLEN122     (0xFU<<8)
#define JPEG_HUFFENC_AC1_61_HLEN122_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_61_HCODE122    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_61_HCODE122_0  (0x1U<<0)

// HUFFENC_AC1_62 Configuration

#define JPEG_HUFFENC_AC1_62_HLEN125     (0xFU<<24)
#define JPEG_HUFFENC_AC1_62_HLEN125_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_62_HCODE125    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_62_HCODE125_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_62_HLEN124     (0xFU<<8)
#define JPEG_HUFFENC_AC1_62_HLEN124_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_62_HCODE124    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_62_HCODE124_0  (0x1U<<0)

// HUFFENC_AC1_63 Configuration

#define JPEG_HUFFENC_AC1_63_HLEN127     (0xFU<<24)
#define JPEG_HUFFENC_AC1_63_HLEN127_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_63_HCODE127    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_63_HCODE127_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_63_HLEN126     (0xFU<<8)
#define JPEG_HUFFENC_AC1_63_HLEN126_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_63_HCODE126    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_63_HCODE126_0  (0x1U<<0)

// HUFFENC_AC1_64 Configuration

#define JPEG_HUFFENC_AC1_64_HLEN129     (0xFU<<24)
#define JPEG_HUFFENC_AC1_64_HLEN129_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_64_HCODE129    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_64_HCODE129_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_64_HLEN128     (0xFU<<8)
#define JPEG_HUFFENC_AC1_64_HLEN128_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_64_HCODE128    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_64_HCODE128_0  (0x1U<<0)

// HUFFENC_AC1_65 Configuration

#define JPEG_HUFFENC_AC1_65_HLEN131     (0xFU<<24)
#define JPEG_HUFFENC_AC1_65_HLEN131_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_65_HCODE131    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_65_HCODE131_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_65_HLEN130     (0xFU<<8)
#define JPEG_HUFFENC_AC1_65_HLEN130_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_65_HCODE130    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_65_HCODE130_0  (0x1U<<0)

