Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
// HUFFENC_AC1_66 Configuration

#define JPEG_HUFFENC_AC1_66_HLEN133     (0xFU<<24)
#define JPEG_HUFFENC_AC1_66_HLEN133_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_66_HCODE133    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_66_HCODE133_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_66_HLEN132     (0xFU<<8)
#define JPEG_HUFFENC_AC1_66_HLEN132_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_66_HCODE132    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_66_HCODE132_0  (0x1U<<0)

// HUFFENC_AC1_67 Configuration

#define JPEG_HUFFENC_AC1_67_HLEN135     (0xFU<<24)
#define JPEG_HUFFENC_AC1_67_HLEN135_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_67_HCODE135    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_67_HCODE135_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_67_HLEN134     (0xFU<<8)
#define JPEG_HUFFENC_AC1_67_HLEN134_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_67_HCODE134    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_67_HCODE134_0  (0x1U<<0)

// HUFFENC_AC1_68 Configuration

#define JPEG_HUFFENC_AC1_68_HLEN137     (0xFU<<24)
#define JPEG_HUFFENC_AC1_68_HLEN137_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_68_HCODE137    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_68_HCODE137_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_68_HLEN136     (0xFU<<8)
#define JPEG_HUFFENC_AC1_68_HLEN136_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_68_HCODE136    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_68_HCODE136_0  (0x1U<<0)

// HUFFENC_AC1_69 Configuration

#define JPEG_HUFFENC_AC1_69_HLEN139     (0xFU<<24)
#define JPEG_HUFFENC_AC1_69_HLEN139_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_69_HCODE139    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_69_HCODE139_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_69_HLEN138     (0xFU<<8)
#define JPEG_HUFFENC_AC1_69_HLEN138_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_69_HCODE138    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_69_HCODE138_0  (0x1U<<0)

// HUFFENC_AC1_70 Configuration

#define JPEG_HUFFENC_AC1_70_HLEN141     (0xFU<<24)
#define JPEG_HUFFENC_AC1_70_HLEN141_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_70_HCODE141    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_70_HCODE141_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_70_HLEN140     (0xFU<<8)
#define JPEG_HUFFENC_AC1_70_HLEN140_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_70_HCODE140    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_70_HCODE140_0  (0x1U<<0)

// HUFFENC_AC1_71 Configuration

#define JPEG_HUFFENC_AC1_71_HLEN143     (0xFU<<24)
#define JPEG_HUFFENC_AC1_71_HLEN143_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_71_HCODE143    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_71_HCODE143_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_71_HLEN142     (0xFU<<8)
#define JPEG_HUFFENC_AC1_71_HLEN142_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_71_HCODE142    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_71_HCODE142_0  (0x1U<<0)

// HUFFENC_AC1_72 Configuration

#define JPEG_HUFFENC_AC1_72_HLEN145     (0xFU<<24)
#define JPEG_HUFFENC_AC1_72_HLEN145_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_72_HCODE145    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_72_HCODE145_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_72_HLEN144     (0xFU<<8)
#define JPEG_HUFFENC_AC1_72_HLEN144_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_72_HCODE144    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_72_HCODE144_0  (0x1U<<0)

// HUFFENC_AC1_73 Configuration

#define JPEG_HUFFENC_AC1_73_HLEN147     (0xFU<<24)
#define JPEG_HUFFENC_AC1_73_HLEN147_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_73_HCODE147    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_73_HCODE147_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_73_HLEN146     (0xFU<<8)
#define JPEG_HUFFENC_AC1_73_HLEN146_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_73_HCODE146    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_73_HCODE146_0  (0x1U<<0)

// HUFFENC_AC1_74 Configuration

#define JPEG_HUFFENC_AC1_74_HLEN149     (0xFU<<24)
#define JPEG_HUFFENC_AC1_74_HLEN149_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_74_HCODE149    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_74_HCODE149_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_74_HLEN148     (0xFU<<8)
#define JPEG_HUFFENC_AC1_74_HLEN148_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_74_HCODE148    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_74_HCODE148_0  (0x1U<<0)

// HUFFENC_AC1_75 Configuration

#define JPEG_HUFFENC_AC1_75_HLEN151     (0xFU<<24)
#define JPEG_HUFFENC_AC1_75_HLEN151_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_75_HCODE151    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_75_HCODE151_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_75_HLEN150     (0xFU<<8)
#define JPEG_HUFFENC_AC1_75_HLEN150_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_75_HCODE150    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_75_HCODE150_0  (0x1U<<0)

// HUFFENC_AC1_76 Configuration

#define JPEG_HUFFENC_AC1_76_HLEN153     (0xFU<<24)
#define JPEG_HUFFENC_AC1_76_HLEN153_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_76_HCODE153    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_76_HCODE153_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_76_HLEN152     (0xFU<<8)
#define JPEG_HUFFENC_AC1_76_HLEN152_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_76_HCODE152    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_76_HCODE152_0  (0x1U<<0)

// HUFFENC_AC1_77 Configuration

#define JPEG_HUFFENC_AC1_77_HLEN155     (0xFU<<24)
#define JPEG_HUFFENC_AC1_77_HLEN155_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_77_HCODE155    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_77_HCODE155_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_77_HLEN154     (0xFU<<8)
#define JPEG_HUFFENC_AC1_77_HLEN154_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_77_HCODE154    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_77_HCODE154_0  (0x1U<<0)

// HUFFENC_AC1_78 Configuration

#define JPEG_HUFFENC_AC1_78_HLEN157     (0xFU<<24)
#define JPEG_HUFFENC_AC1_78_HLEN157_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_78_HCODE157    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_78_HCODE157_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_78_HLEN156     (0xFU<<8)
#define JPEG_HUFFENC_AC1_78_HLEN156_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_78_HCODE156    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_78_HCODE156_0  (0x1U<<0)

// HUFFENC_AC1_79 Configuration

#define JPEG_HUFFENC_AC1_79_HLEN159     (0xFU<<24)
#define JPEG_HUFFENC_AC1_79_HLEN159_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_79_HCODE159    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_79_HCODE159_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_79_HLEN158     (0xFU<<8)
#define JPEG_HUFFENC_AC1_79_HLEN158_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_79_HCODE158    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_79_HCODE158_0  (0x1U<<0)

// HUFFENC_AC1_80 Configuration

