Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
#define JPEG_HUFFENC_AC1_80_HLEN161     (0xFU<<24)
#define JPEG_HUFFENC_AC1_80_HLEN161_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_80_HCODE161    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_80_HCODE161_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_80_HLEN160     (0xFU<<8)
#define JPEG_HUFFENC_AC1_80_HLEN160_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_80_HCODE160    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_80_HCODE160_0  (0x1U<<0)

// HUFFENC_AC1_81 Configuration

#define JPEG_HUFFENC_AC1_81_HLEN163     (0xFU<<24)
#define JPEG_HUFFENC_AC1_81_HLEN163_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_81_HCODE163    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_81_HCODE163_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_81_HLEN162     (0xFU<<8)
#define JPEG_HUFFENC_AC1_81_HLEN162_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_81_HCODE162    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_81_HCODE162_0  (0x1U<<0)

// HUFFENC_AC1_82 Configuration

#define JPEG_HUFFENC_AC1_82_HLEN165     (0xFU<<24)
#define JPEG_HUFFENC_AC1_82_HLEN165_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_82_HCODE165    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_82_HCODE165_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_82_HLEN164     (0xFU<<8)
#define JPEG_HUFFENC_AC1_82_HLEN164_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_82_HCODE164    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_82_HCODE164_0  (0x1U<<0)

// HUFFENC_AC1_83 Configuration

#define JPEG_HUFFENC_AC1_83_HLEN167     (0xFU<<24)
#define JPEG_HUFFENC_AC1_83_HLEN167_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_83_HCODE167    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_83_HCODE167_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_83_HLEN166     (0xFU<<8)
#define JPEG_HUFFENC_AC1_83_HLEN166_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_83_HCODE166    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_83_HCODE166_0  (0x1U<<0)

// HUFFENC_AC1_84 Configuration

#define JPEG_HUFFENC_AC1_84_HLEN169     (0xFU<<24)
#define JPEG_HUFFENC_AC1_84_HLEN169_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_84_HCODE169    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_84_HCODE169_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_84_HLEN168     (0xFU<<8)
#define JPEG_HUFFENC_AC1_84_HLEN168_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_84_HCODE168    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_84_HCODE168_0  (0x1U<<0)

// HUFFENC_AC1_85 Configuration

#define JPEG_HUFFENC_AC1_85_HLEN171     (0xFU<<24)
#define JPEG_HUFFENC_AC1_85_HLEN171_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_85_HCODE171    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_85_HCODE171_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_85_HLEN170     (0xFU<<8)
#define JPEG_HUFFENC_AC1_85_HLEN170_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_85_HCODE170    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_85_HCODE170_0  (0x1U<<0)

// HUFFENC_AC1_86 Configuration

#define JPEG_HUFFENC_AC1_86_HLEN173     (0xFU<<24)
#define JPEG_HUFFENC_AC1_86_HLEN173_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_86_HCODE173    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_86_HCODE173_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_86_HLEN172     (0xFU<<8)
#define JPEG_HUFFENC_AC1_86_HLEN172_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_86_HCODE172    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_86_HCODE172_0  (0x1U<<0)

// HUFFENC_AC1_87 Configuration

#define JPEG_HUFFENC_AC1_87_HLEN175     (0xFU<<24)
#define JPEG_HUFFENC_AC1_87_HLEN175_0   (0x1U<<24)
#define JPEG_HUFFENC_AC1_87_HCODE175    (0xFFU<<16)
#define JPEG_HUFFENC_AC1_87_HCODE175_0  (0x1U<<16)
#define JPEG_HUFFENC_AC1_87_HLEN174     (0xFU<<8)
#define JPEG_HUFFENC_AC1_87_HLEN174_0   (0x1U<<8)
#define JPEG_HUFFENC_AC1_87_HCODE174    (0xFFU<<0)
#define JPEG_HUFFENC_AC1_87_HCODE174_0  (0x1U<<0)

// HUFFENC_DC0_0 Configuration

#define JPEG_HUFFENC_DC0_0_HLEN1        (0xFU<<24)
#define JPEG_HUFFENC_DC0_0_HLEN1_0      (0x1U<<24)
#define JPEG_HUFFENC_DC0_0_HCODE1       (0xFFU<<16)
#define JPEG_HUFFENC_DC0_0_HCODE1_0     (0x1U<<16)
#define JPEG_HUFFENC_DC0_0_HLEN0        (0xFU<<8)
#define JPEG_HUFFENC_DC0_0_HLEN0_0      (0x1U<<8)
#define JPEG_HUFFENC_DC0_0_HCODE0       (0xFFU<<0)
#define JPEG_HUFFENC_DC0_0_HCODE0_0     (0x1U<<0)

// HUFFENC_DC0_1 Configuration

#define JPEG_HUFFENC_DC0_1_HLEN3        (0xFU<<24)
#define JPEG_HUFFENC_DC0_1_HLEN3_0      (0x1U<<24)
#define JPEG_HUFFENC_DC0_1_HCODE3       (0xFFU<<16)
#define JPEG_HUFFENC_DC0_1_HCODE3_0     (0x1U<<16)
#define JPEG_HUFFENC_DC0_1_HLEN2        (0xFU<<8)
#define JPEG_HUFFENC_DC0_1_HLEN2_0      (0x1U<<8)
#define JPEG_HUFFENC_DC0_1_HCODE2       (0xFFU<<0)
#define JPEG_HUFFENC_DC0_1_HCODE2_0     (0x1U<<0)

// HUFFENC_DC0_2 Configuration

#define JPEG_HUFFENC_DC0_2_HLEN5        (0xFU<<24)
#define JPEG_HUFFENC_DC0_2_HLEN5_0      (0x1U<<24)
#define JPEG_HUFFENC_DC0_2_HCODE5       (0xFFU<<16)
#define JPEG_HUFFENC_DC0_2_HCODE5_0     (0x1U<<16)
#define JPEG_HUFFENC_DC0_2_HLEN4        (0xFU<<8)
#define JPEG_HUFFENC_DC0_2_HLEN4_0      (0x1U<<8)
#define JPEG_HUFFENC_DC0_2_HCODE4       (0xFFU<<0)
#define JPEG_HUFFENC_DC0_2_HCODE4_0     (0x1U<<0)

// HUFFENC_DC0_3 Configuration

#define JPEG_HUFFENC_DC0_3_HLEN7        (0xFU<<24)
#define JPEG_HUFFENC_DC0_3_HLEN7_0      (0x1U<<24)
#define JPEG_HUFFENC_DC0_3_HCODE7       (0xFFU<<16)
#define JPEG_HUFFENC_DC0_3_HCODE7_0     (0x1U<<16)
#define JPEG_HUFFENC_DC0_3_HLEN6        (0xFU<<8)
#define JPEG_HUFFENC_DC0_3_HLEN6_0      (0x1U<<8)
#define JPEG_HUFFENC_DC0_3_HCODE6       (0xFFU<<0)
#define JPEG_HUFFENC_DC0_3_HCODE6_0     (0x1U<<0)

// HUFFENC_DC0_4 Configuration

#define JPEG_HUFFENC_DC0_4_HLEN9        (0xFU<<24)
#define JPEG_HUFFENC_DC0_4_HLEN9_0      (0x1U<<24)
#define JPEG_HUFFENC_DC0_4_HCODE9       (0xFFU<<16)
#define JPEG_HUFFENC_DC0_4_HCODE9_0     (0x1U<<16)
#define JPEG_HUFFENC_DC0_4_HLEN8        (0xFU<<8)
#define JPEG_HUFFENC_DC0_4_HLEN8_0      (0x1U<<8)
#define JPEG_HUFFENC_DC0_4_HCODE8       (0xFFU<<0)
#define JPEG_HUFFENC_DC0_4_HCODE8_0     (0x1U<<0)

// HUFFENC_DC0_5 Configuration

#define JPEG_HUFFENC_DC0_5_HLEN11       (0xFU<<24)
#define JPEG_HUFFENC_DC0_5_HLEN11_0     (0x1U<<24)
#define JPEG_HUFFENC_DC0_5_HCODE11      (0xFFU<<16)
#define JPEG_HUFFENC_DC0_5_HCODE11_0    (0x1U<<16)
#define JPEG_HUFFENC_DC0_5_HLEN10       (0xFU<<8)
#define JPEG_HUFFENC_DC0_5_HLEN10_0     (0x1U<<8)
#define JPEG_HUFFENC_DC0_5_HCODE10      (0xFFU<<0)
#define JPEG_HUFFENC_DC0_5_HCODE10_0    (0x1U<<0)

// HUFFENC_DC0_6 Configuration

