Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_jpeg.h
#define JPEG_HUFFENC_DC0_6_HLEN13       (0xFU<<24)
#define JPEG_HUFFENC_DC0_6_HLEN13_0     (0x1U<<24)
#define JPEG_HUFFENC_DC0_6_HCODE13      (0xFFU<<16)
#define JPEG_HUFFENC_DC0_6_HCODE13_0    (0x1U<<16)
#define JPEG_HUFFENC_DC0_6_HLEN12       (0xFU<<8)
#define JPEG_HUFFENC_DC0_6_HLEN12_0     (0x1U<<8)
#define JPEG_HUFFENC_DC0_6_HCODE12      (0xFFU<<0)
#define JPEG_HUFFENC_DC0_6_HCODE12_0    (0x1U<<0)

// HUFFENC_DC0_7 Configuration

#define JPEG_HUFFENC_DC0_7_HLEN15       (0xFU<<24)
#define JPEG_HUFFENC_DC0_7_HLEN15_0     (0x1U<<24)
#define JPEG_HUFFENC_DC0_7_HCODE15      (0xFFU<<16)
#define JPEG_HUFFENC_DC0_7_HCODE15_0    (0x1U<<16)
#define JPEG_HUFFENC_DC0_7_HLEN14       (0xFU<<8)
#define JPEG_HUFFENC_DC0_7_HLEN14_0     (0x1U<<8)
#define JPEG_HUFFENC_DC0_7_HCODE14      (0xFFU<<0)
#define JPEG_HUFFENC_DC0_7_HCODE14_0    (0x1U<<0)

// HUFFENC_DC1_0 Configuration

#define JPEG_HUFFENC_DC1_0_HLEN1        (0xFU<<24)
#define JPEG_HUFFENC_DC1_0_HLEN1_0      (0x1U<<24)
#define JPEG_HUFFENC_DC1_0_HCODE1       (0xFFU<<16)
#define JPEG_HUFFENC_DC1_0_HCODE1_0     (0x1U<<16)
#define JPEG_HUFFENC_DC1_0_HLEN0        (0xFU<<8)
#define JPEG_HUFFENC_DC1_0_HLEN0_0      (0x1U<<8)
#define JPEG_HUFFENC_DC1_0_HCODE0       (0xFFU<<0)
#define JPEG_HUFFENC_DC1_0_HCODE0_0     (0x1U<<0)

// HUFFENC_DC1_1 Configuration

#define JPEG_HUFFENC_DC1_1_HLEN3        (0xFU<<24)
#define JPEG_HUFFENC_DC1_1_HLEN3_0      (0x1U<<24)
#define JPEG_HUFFENC_DC1_1_HCODE3       (0xFFU<<16)
#define JPEG_HUFFENC_DC1_1_HCODE3_0     (0x1U<<16)
#define JPEG_HUFFENC_DC1_1_HLEN2        (0xFU<<8)
#define JPEG_HUFFENC_DC1_1_HLEN2_0      (0x1U<<8)
#define JPEG_HUFFENC_DC1_1_HCODE2       (0xFFU<<0)
#define JPEG_HUFFENC_DC1_1_HCODE2_0     (0x1U<<0)

// HUFFENC_DC1_2 Configuration

#define JPEG_HUFFENC_DC1_2_HLEN5        (0xFU<<24)
#define JPEG_HUFFENC_DC1_2_HLEN5_0      (0x1U<<24)
#define JPEG_HUFFENC_DC1_2_HCODE5       (0xFFU<<16)
#define JPEG_HUFFENC_DC1_2_HCODE5_0     (0x1U<<16)
#define JPEG_HUFFENC_DC1_2_HLEN4        (0xFU<<8)
#define JPEG_HUFFENC_DC1_2_HLEN4_0      (0x1U<<8)
#define JPEG_HUFFENC_DC1_2_HCODE4       (0xFFU<<0)
#define JPEG_HUFFENC_DC1_2_HCODE4_0     (0x1U<<0)

// HUFFENC_DC1_3 Configuration

#define JPEG_HUFFENC_DC1_3_HLEN7        (0xFU<<24)
#define JPEG_HUFFENC_DC1_3_HLEN7_0      (0x1U<<24)
#define JPEG_HUFFENC_DC1_3_HCODE7       (0xFFU<<16)
#define JPEG_HUFFENC_DC1_3_HCODE7_0     (0x1U<<16)
#define JPEG_HUFFENC_DC1_3_HLEN6        (0xFU<<8)
#define JPEG_HUFFENC_DC1_3_HLEN6_0      (0x1U<<8)
#define JPEG_HUFFENC_DC1_3_HCODE6       (0xFFU<<0)
#define JPEG_HUFFENC_DC1_3_HCODE6_0     (0x1U<<0)

// HUFFENC_DC1_4 Configuration

#define JPEG_HUFFENC_DC1_4_HLEN9        (0xFU<<24)
#define JPEG_HUFFENC_DC1_4_HLEN9_0      (0x1U<<24)
#define JPEG_HUFFENC_DC1_4_HCODE9       (0xFFU<<16)
#define JPEG_HUFFENC_DC1_4_HCODE9_0     (0x1U<<16)
#define JPEG_HUFFENC_DC1_4_HLEN8        (0xFU<<8)
#define JPEG_HUFFENC_DC1_4_HLEN8_0      (0x1U<<8)
#define JPEG_HUFFENC_DC1_4_HCODE8       (0xFFU<<0)
#define JPEG_HUFFENC_DC1_4_HCODE8_0     (0x1U<<0)

// HUFFENC_DC1_5 Configuration

#define JPEG_HUFFENC_DC1_5_HLEN11       (0xFU<<24)
#define JPEG_HUFFENC_DC1_5_HLEN11_0     (0x1U<<24)
#define JPEG_HUFFENC_DC1_5_HCODE11      (0xFFU<<16)
#define JPEG_HUFFENC_DC1_5_HCODE11_0    (0x1U<<16)
#define JPEG_HUFFENC_DC1_5_HLEN10       (0xFU<<8)
#define JPEG_HUFFENC_DC1_5_HLEN10_0     (0x1U<<8)
#define JPEG_HUFFENC_DC1_5_HCODE10      (0xFFU<<0)
#define JPEG_HUFFENC_DC1_5_HCODE10_0    (0x1U<<0)

// HUFFENC_DC1_6 Configuration

#define JPEG_HUFFENC_DC1_6_HLEN13       (0xFU<<24)
#define JPEG_HUFFENC_DC1_6_HLEN13_0     (0x1U<<24)
#define JPEG_HUFFENC_DC1_6_HCODE13      (0xFFU<<16)
#define JPEG_HUFFENC_DC1_6_HCODE13_0    (0x1U<<16)
#define JPEG_HUFFENC_DC1_6_HLEN12       (0xFU<<8)
#define JPEG_HUFFENC_DC1_6_HLEN12_0     (0x1U<<8)
#define JPEG_HUFFENC_DC1_6_HCODE12      (0xFFU<<0)
#define JPEG_HUFFENC_DC1_6_HCODE12_0    (0x1U<<0)

// HUFFENC_DC1_7 Configuration

#define JPEG_HUFFENC_DC1_7_HLEN15       (0xFU<<24)
#define JPEG_HUFFENC_DC1_7_HLEN15_0     (0x1U<<24)
#define JPEG_HUFFENC_DC1_7_HCODE15      (0xFFU<<16)
#define JPEG_HUFFENC_DC1_7_HCODE15_0    (0x1U<<16)
#define JPEG_HUFFENC_DC1_7_HLEN14       (0xFU<<8)
#define JPEG_HUFFENC_DC1_7_HLEN14_0     (0x1U<<8)
#define JPEG_HUFFENC_DC1_7_HCODE14      (0xFFU<<0)
#define JPEG_HUFFENC_DC1_7_HCODE14_0    (0x1U<<0)
